[
    {
        "link": "https://cyberleninka.ru//article/n/mobilnoe-obuchenie-veb-tehnologiyam-i-veb-programmirovaniyu",
        "name": "Мобильное обучение веб-технологиям и веб-программированию",
        "author": "Государев Илья Борисович",
        "year": "2014",
        "branch": "Образовательные технологии и общество",
        "description": "﻿Мобильное обучение веб-технологиям и веб-программированию\r\nГосударев Илья Борисович доцент, к.п.н., доцент кафедры информационных и коммуникационных технологий, Российский государственный педагогический университет им.А.И.Герцена, наб. реки Мойки, д.48., г. Санкт-Петербург, 191186, (812) 643-77-67 (доб.2614)\r\ngossoudarev@,herzen spb. га\r\nАннотация\rАннотация\r\nВ статье описывается электронный учебно-методический комплекс по обучению веб-технологиям и веб-программированию, включающий онлайн-редактор кода на языках HTML, CSS, Javascript «Кодактор», и развертывание мобильной электронной информационно-образовательной среды на его основе. В статье также предложены варианты интеграции Кодактора с другими решениями"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-tehnologiya-pedagogicheskogo-vzaimodeystviya",
        "name": "Веб-технология педагогического взаимодействия",
        "author": "Буханцева Н. В.",
        "year": "2007",
        "branch": "Образовательные технологии и общество",
        "description": "﻿Educational Technology & Society 10(2) 2007\r\nISSN 1436-4522\r\nВеб-технология педагогического взаимодействия\r\nН.В. Буханцева Волгоградский государственный университет, Волгоград, nina.buhantseva@volsu.ru\r\nАннотация\r\nСтатья посвящена проблеме разработки адаптивной технологии для интерактивной коммуникации участников образовательного процесса, использующихпроцесс и функцию взаимодействия его участников на базе этих ресурсов. Адаптивная технология позволяет структурировать вэб-ресурсы под конкретный образовательный процесс, способствует развитию творческих способностей его участников, учит культуре подбора и применения веб-ресурсов для педагогических целей.\r\nAbstract\r\nThe paper deals with the problem of"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-yazyka-veb-ontologii-owl-i-semanticheskaya-veb-tehnologiya",
        "name": "Анализ языка Веб онтологии (owl) и семантическая веб-технология",
        "author": "Каунг Мьят Хту",
        "year": "2017",
        "branch": "Auditorium",
        "description": "﻿УДК 004.9\r\nАНАЛИЗ ЯЗЫКА ВЕБ ОНТОЛОГИИ (OWL) И СЕМАНТИЧЕСКАЯ ВЕБ-ТЕХНОЛОГИЯ\r\n© 2017 Каунг Мьят Хту\r\nаспирант кафедры программного обеспечения и администрирования информационных систем\r\ne-mail: kaungmhtoo16267@gmail. com Курский государственный университет\r\nВ этой статье рассмотрен и проанализирован ряд категорий OWL: OWL-Lite, OWL-DL и OWL-Full. Отмечаетсячастью стандарта OWL. OWL полезен для различных приложений, таких как поиск информации, фотографий и т. д.\r\nКлючевые слова: онтология, семантическая сеть, OWL, информационные технологии, XML, RDF.\r\nОнтология - это подполе философии. Это изучение природы существования и ветвей метафизики, связанных с определением видов вещей, которые на самом деле существуют"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-servisov-i-tehnologiy-veba-v-bibliotekah-tendentsii-i-perspektivy",
        "name": "Использование сервисов и технологий веба в библиотеках. Тенденции и перспективы",
        "author": "Драцкая Марина Евгеньевна",
        "year": "2012",
        "branch": "Библиосфера",
        "description": "г. Официальный сайт программы - http:// awstats .sourceforge.net.\r\nНаконец, обозначилась потребность в создании постоянной площадки для обмена опытом в области библиотечной веб-статистики и аналитики, публикации материалов, обзоров и консультаций по названной проблематике. Трибуной для выступлений могли бы стать специализированные секции на регулярносоответствующие рубрики или разделы в профессиональных изданиях («Научные и технические библиотеки», «Библиосфера» и пр.).\r\nЛитература\r\n1.\tВеб-аналитика // Википедия - свободная энциклопедия. - URL: http://ru.wikipedia.org/wiki/Веб-аналитика (дата обращения: 20.09.2012).\r\n2.\tWeb Analytics Association Web Analytics Definitions -Draft for Public Comment 9/22/2008"
    },
    {
        "link": "https://cyberleninka.ru//article/n/novyy-podhod-k-obespecheniyu-veb-dostupnosti-dlya-nezryachih-polzovateley-na-osnove-uluchsheniya-navigatsionnyh-harakteristik-veb",
        "name": "Новый подход к обеспечению веб-доступности для незрячих пользователей на основе улучшения навигационных характеристик веб-страниц",
        "author": "Файзрахманов Руслан Рустамович",
        "year": "2012",
        "branch": "Инженерный вестник Дона",
        "description": "к обеспечению веб-доступности для незрячих пользователей на основе улучшения навигационных характеристик веб-страниц\r\nР.Р. Файзрахманов Введение\r\nВсемирная паутина (далее Веб) играет очень важную роль в развитии современного информационного общества, касаясь различных сторон человеческой деятельности: бизнеса, политики, науки и т.д. Веб - это огромноеогромное динамическое хранилище информации, сформированное преимущественно большим множеством взаимосвязанных веб-страниц. К сожалению, большая часть веб-страниц оказывается недоступной для определенной части населения. Это связано с тем, что веб-разработчики не следуют международным стандартам и руководствам, предназначенным для создания вебресурсов, которые"
    },
    {
        "link": "https://cyberleninka.ru//article/n/opyt-sozdaniya-3d-gis-posredstvom-veb-tehnologiy",
        "name": "Опыт создания 3D ГИС посредством веб-технологий",
        "author": "Федоренко Александр Владимирович",
        "year": "2016",
        "branch": "Интерэкспо Гео-Сибирь",
        "description": "﻿УДК 528.2\r\nОПЫТ СОЗДАНИЯ 3D ГИС ПОСРЕДСТВОМ ВЕБ-ТЕХНОЛОГИЙ\r\nАлександр Владимирович Федоренко\r\nООО «Эксон Ай Ти», 220141, Республика Беларусь, г. Минск, ул. Купревича, 1/1, офис 1006, начальник отдела ГИС и САПР, тел. (375)17-265-75-91, e-mail: fedorenko@exonit.by,\r\nНа примере реализованного проекта демонстрируется система визуализации трехмерных пространственныхпространственных данных посредством веб-технологий.\r\nКлючевые слова: 3D, Веб, ГИС, WebGL.\r\nEXPERIENCE OF DEVELOPMENT OF 3D GIS SYSTEM USING WEB TECHNOLOGY\r\nAlexander V. Fedorenko\r\nCJS «ExonIT», 220141, Republic of Belarus, Minsk, 1/1 Kuprevicha St., office 1006, Head of GIS/CAD Department, tel. (375)17-265-75-91, e-mail: fedorenko@exonit.by\r\nOn the example"
    },
    {
        "link": "https://cyberleninka.ru//article/n/integratsiya-pedagogicheskih-i-veb-tehnologiy-v-obrazovatelnyy-protsess",
        "name": "ИНТЕГРАЦИЯ ПЕДАГОГИЧЕСКИХ И ВЕБ-ТЕХНОЛОГИЙ В ОБРАЗОВАТЕЛЬНЫЙ ПРОЦЕСС",
        "author": "Гизатулина Ольга Ивановна",
        "year": "2020",
        "branch": "Вестник науки и образования",
        "description": "﻿ИНТЕГРАЦИЯ ПЕДАГОГИЧЕСКИХ И ВЕБ-ТЕХНОЛОГИЙ В ОБРАЗОВАТЕЛЬНЫЙ ПРОЦЕСС Гизатулина О.И. Email: Gizatulina6103@scientifictext.ru\r\nГизатулина Ольга Ивановна - преподаватель, кафедра русского языка и литературы, Гулистанский государственный университет, г. Гулистан, Республика Узбекистан\r\nАннотация: статья посвящена изучению особенностей интернета как ипроблемам использования веб-технологий в образовательном процессе. Актуальность темы заключается в использовании инновационных образовательных технологий в образовательном процессе. Отмечается, что одним из наиболее перспективных направлений развития современных информационных технологий в образовании является использование веб-технологий. В статье выделены"
    },
    {
        "link": "https://cyberleninka.ru//article/n/optimizatsiya-upravleniya-korporatsiey-s-ispolzovaniem-veb-tehnologiy",
        "name": "Оптимизация управления корпорацией с использованием веб-технологий",
        "author": "Крюкова Елена Михайловна",
        "year": "2011",
        "branch": "Сервис plus",
        "description": "﻿ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ В ЭКОНОМИКЕ\r\nУДК 65.011.46\r\nI ОПТИМИЗАЦИЯ УПРАВЛЕНИЯ КОРПОРАЦИЕЙ I С ИСПОЛЬЗОВАНИЕМ ВЕБ-ТЕХНОЛОГИЙ\r\nКрюкова Елена Михайловна, кандидат экономических наук, доцент,\r\nlena-krukova@yandex.ru,\r\nИнститут сервиса (г. Москва), филиал ФГБОУ ВПО «Российский государственный университет туризма и сервиса», г. Москва\r\nIn contemporary highlyГибкость компаний в значительной степени зависит от того, насколько эффективно и быстро ее сотрудники справляются с ежедневными задачами. Информационные и коммуникационные технологии трансформируют образ компаний и функции сотрудников точно так же, как они изменяют средства массовой информации, культуру и экономику. Соответствующие программные инструменты"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-tehnologii-iskusstvennyy-intellekt-i-kognitivnoe-pravitelstvo",
        "name": "Веб-технологии, искусственный интеллект и когнитивное правительство",
        "author": "Дрожжинов Владимир Иванович, Райков Александр Николаевич",
        "year": "2017",
        "branch": "Современные информационные технологии и ИТ-образование",
        "description": "﻿Когнитивно-информационные технологии в цифровой экономике\r\nУДК 004.7+004.8+004.9\r\nДрожжинов В.И.1, Райков А.Н.2\r\n1 Национальный! центр компетенции! в области цифровой! экономики, г. Москва, Россия 2 Институт проблем управления им. В.А. Трапезникова РАН, г. Москва, Россия\r\nВЕБ-ТЕХНОЛОГИИ, ИСКУССТВЕННЫЙ ИНТЕЛЛЕКТ И КОГНИТИВНОЕ\r\nПРАВИТЕЛЬСТВО\r\n«2014-ьш«2014-ьш год ознаменовался концом однои эры в истории семантического веба и началом новои эры. Закончившаяся эра [Web 3.0] была первои волнои семантического веба. Эра, что началась, -- это эра когнитивных вычислении [Web 4.0].»\r\nНова Спивак, http://www.dataversity.net/nova-spivack-new-era-semantic-web-history/\r\nАннотация\r\nПока остается открытым вопрос: смогут"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-sovremennogo-napravleniya-razvitiya-veb-tehnologiy",
        "name": "Анализ современного направления развития веб-технологий",
        "author": "Кветкин Павел Валерьевич",
        "year": "2018",
        "branch": "European science",
        "description": "АНАЛИЗ СОВРЕМЕННОГО НАПРАВЛЕНИЯ РАЗВИТИЯ ВЕБ-ТЕХНОЛОГИЙ Кветкин П.В. (Республика Казахстан)\r\nКветкин Павел Валерьевич - учащийся, Коммунальное государственное учреждение Гимназия № 130 им. Ильяса Жансугурова, г. Алматы, Республика Казахстан\r\nАннотация: в статье отражены основные направления развития технологий, используемых при разработке сайтов. Рассмотреныразвития веб-технологий в современном мире: применение минимализма в дизайне сайта, технологии HTML5, технологии CSS3, параллакс-эффект, выведение окна меню при рассмотрении контента для удобства пользователя, разработка актуального мобильного приложения, повышение социальной защиты.\r\nКлючевые слова: веб-технологии, тенденции развития, информация, веб-дизайн"
    },
    {
        "link": "https://cyberleninka.ru//article/n/nekotorye-aspekty-obucheniya-studentov-osnovam-kontseptsii-semanticheskiy-veb",
        "name": "Некоторые аспекты обучения студентов основам концепции семантический веб",
        "author": "Климов В.В., Чернышов А.А., Баландина А.И., Косткина А.Д.",
        "year": "2016",
        "branch": "Машиностроение и компьютерные технологии",
        "description": "редакцию: 07.08.2016 Исправлена:\r\n© МГТУ им. Н.Э. Баумана\r\n^7005 fg.mail.ru\r\nУДК 378; 004.4; 004.738.5\r\nНекоторые аспекты обучения студентов основам концепции семантический веб\r\nКлимов В. В.1'*, Чернышев А. А.1, Баландина А. И.1, Косткина А. Д.1\r\nНациональный исследовательский ядерный университет \"МИФИ\", Москва, Россия\r\nВ рамках международного научногоЭ. Баумана, Москва, Россия).\r\nДанная статья содержит описание современных технологий в области семантического веба. Описываются текущие проблемы в данной области и предлагается возможное решение некоторых из них. Поставлена проблема обучения студентов семантическим технологиям и указываются предпосылки для создания обучающего курса по этим областям."
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-tehnologiy-veb-analitiki-v-marketingivoy-strategii",
        "name": "ИСПОЛЬЗОВАНИЕ ТЕХНОЛОГИЙ ВЕБ-АНАЛИТИКИ В МАРКЕТИНГИВОЙ СТРАТЕГИИ",
        "author": "Пак Елена Дмитриевна",
        "year": "2020",
        "branch": "StudNet",
        "description": "﻿STUD NET\r\nИСПОЛЬЗОВАНИЕ ТЕХНОЛОГИЙ ВЕБ-АНАЛИТИКИ В МАРКЕТИНГИВОЙ СТРАТЕГИИ\r\nUSING WEB ANALYTICS TECHNOLOGIES IN A MARKETING STRATEGY\r\nУДК-004\r\nПак Елена Дмитриевна\r\nБакалавр Санкт-Петербургского государственного экономического университета по направлению реклама и связи с общественностью в бизнесе Россия, г. Санкт-Петербург Pak Elena Dmitrievna lenkapak9@gmailмаркетинговой деятельности компании являются интернет-технологии. Устанавливая счётчики аналитических систем на свои сайты, маркетологи получают возможность отслеживать клиентов на всех этапах, от клика по рекламному объявлению до оплаты заказа в интернет-магазине. В данной статье описаны системы веб-аналитики Google analytics, Яндекс.Метрика, LiveInternet"
    },
    {
        "link": "https://cyberleninka.ru//article/n/uchebnye-tehnologii-primenyaemye-v-obuchenii-vidam-natsionalnoy-borby-kurash",
        "name": "Учебные технологии, применяемые в обучении видам национальной борьбы кураш",
        "author": "Муниров Нурали Алишерович, Раджабов Эргаш Нуриддинович",
        "year": "2019",
        "branch": "Научный журнал",
        "description": "﻿УЧЕБНЫЕ ТЕХНОЛОГИИ, ПРИМЕНЯЕМЫЕ В ОБУЧЕНИИ ВИДАМ НАЦИОНАЛЬНОЙ БОРЬБЫ КУРАШ Муниров Н.А.1, Раджабов Н.Э.2\r\n'Муниров Нурали Алишерович — преподаватель, кафедра теории и методологии физической культуры; 2Раджабов Эргаш Нуриддинович — студент,\r\nспортивный факультет, Бухарский государственный университет, г. Бухара, Республика Узбекистан\r\nАннотация: в состояниисостоянии анализируются понятия инструментов программирования и возможности использования учебного веб-контента в учебном процессе.\r\nКлючевые слова: веб-сайт, набор, информация, веб-технологии, веб-сервис, платформа, веб-инфраструктура.\r\nПри обучении народным видам кураша необходимо выбрать направление образовательного процесса с определенной степенью"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-veb-2-0-v-sisteme-upravleniya-kachestvom",
        "name": "Технологии веб 2. 0 в системе управления качеством",
        "author": "Минаков В. Ф., Макарчук Т. А., Щугорева В. А.",
        "year": "2014",
        "branch": "Международный научно-исследовательский журнал",
        "description": "университет ТЕХНОЛОГИИ ВЕБ 2.0 В СИСТЕМЕ УПРАВЛЕНИЯ КАЧЕСТВОМ\r\nАннотация\r\nПредставлен авторский вариант веб-сервиса поиска и выбора модели смартфона в зависимости от цены и качества. Показано, что информация базы данных сервиса может быть использована для планирования производства и продаж изделий разного уровня качества.\r\nКлючевые слова: веб-сервис, управлениеменеджмента качества [3, 4]. Для этого, на наш взгляд, пригодны информационные технологии веб 2.0. Их отличительная особенность от веб 1.0 состоит как раз в возможности создания и улучшения контента пользователями. Именно такая возможность и создает обратную связь от пользователя веб-сервисами, то есть потребителя продукции к производителю для учета последним"
    },
    {
        "link": "https://cyberleninka.ru//article/n/sovremennye-veb-tehnologii-v-obrazovatelnom-protsesse-i-ih-rol-v-obuchenii",
        "name": "СОВРЕМЕННЫЕ ВЕБ-ТЕХНОЛОГИИ В ОБРАЗОВАТЕЛЬНОМ ПРОЦЕССЕ И ИХ РОЛЬ В ОБУЧЕНИИ",
        "author": "Белоконова С.С., Назарова В.В.",
        "year": "2018",
        "branch": "Вестник Таганрогского института имени А.П. Чехова",
        "description": "Назарова\r\nСОВРЕМЕННЫЕ ВЕБ-ТЕХНОЛОГИИ В ОБРАЗОВАТЕЛЬНОМ ПРОЦЕССЕ\r\nИ ИХ РОЛЬ В ОБУЧЕНИИ\r\nАннотация. В статье представлены современные образовательные веб-технологии их классификации. Также рассмотрены возможности их использования, достоинства и недостатки.\r\nКлючевые слова: веб-технологии, облачные технологии, виртуальная лаборатория, веб-квест, вебинар, онлайн-платформатрадиционное образование трансформируется под влиянием новых образовательных технологий.\r\nРоль веб-технологий в образовательной сфере, несомненно, велика. Однако для более эффективного использования интернет-технологий в учебном процессе преподавателю стоит понимать, какие технологии подходят для изучения нового материала, повторения, закрепления или других"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-veb-tehnologiy-na-saytah-legalnyh-rossiyskih-bukmekerov",
        "name": "Анализ веб-технологий на сайтах легальных российских букмекеров",
        "author": "Солозобов Олег Анатольевич",
        "year": "2019",
        "branch": "Наука, техника и образование",
        "description": "﻿АНАЛИЗ ВЕБ-ТЕХНОЛОГИЙ НА САЙТАХ ЛЕГАЛЬНЫХ РОССИЙСКИХ БУКМЕКЕРОВ Солозобов О.А. Email: Solozobov1154@scientifictext.ru\r\nСолозобов Олег Анатольевич — соискатель ученой степени кандидата наук, Тамбовский государственный технический университет, г. Тамбов\r\nАннотация: в статье представлены результаты исследований веб-технологий, которые применяются на сайтахроссийских букмекеров. Установлено, что на сайтах букмекерских контор применяются не самые передовые веб-технологии, некоторые сайты работают даже без использования безопасного протокола передачи гипертекста (https). Популярными технологиями являются веб-сервер Nginx, библиотека jQuery, js-фреймворки React и Angular. Часть сайтов вообще никак не оптимизированы"
    },
    {
        "link": "https://cyberleninka.ru//article/n/integratsiya-veb-tehnologiy-v-protsess-obucheniya-arhitekturnomu-proektirovaniyu",
        "name": "ИНТЕГРАЦИЯ ВЕБ-ТЕХНОЛОГИЙ В ПРОЦЕСС ОБУЧЕНИЯ АРХИТЕКТУРНОМУ ПРОЕКТИРОВАНИЮ",
        "author": "Дьячкова Е.А.",
        "year": "2018",
        "branch": "Вестник Московского информационно-технологического университета – Московского архитектурно-строительного института",
        "description": "﻿ПЕДАГОГИКА PEDAGOGY\r\nУДК 37.013.32\r\nИНТЕГРАЦИЯ ВЕБ-ТЕХНОЛОГИЙ\r\nВ ПРОЦЕСС ОБУЧЕНИЯ АРХИТЕКТУРНОМУ ПРОЕКТИРОВАНИЮ\r\nЕ.А. Дьячкова\r\nАннотация. В статье анализируется опыт применения социальных сетей, мессенджеров и файлооб-менников в учебном процессе по направлению подготовки «Архитектура» на кафедре архитектуры МИТУ-МАСИ. Рассматриваются возможности ии перспективы развития электронного обучения в контексте использования образовательного потенциала веб-технологий.\r\nКлючевые слова: веб-технологии, социальные сети, мессенджеры, архитектурное образование, сетевое обучение.\r\nINTEGRATION WEB-TECHNOLOGIES\r\nINTO THE PROCESS OF TEACHING ARCHITECTURAL DESIGN\r\nE.A. Dyachkova\r\nAbstract. The experience of using"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-tehnologii-sbora-dannyh-klinicheskih-i-populyatsionnyh-issledovaniy",
        "name": "Веб-технологии сбора данных клинических и популяционных исследований",
        "author": "Русинов М. А., Чабаева Ю. А., Куликов С. М.",
        "year": "2012",
        "branch": "Гематология и трансфузиология",
        "description": "разработать оптимальные подходы к лечению.\r\nВеб-технологии сбора данных клинических и популяционных исследований\r\nМ.А. Русинов, Ю.А. Чабаева, С.М. Куликов ФГБУ Гематологический научный центр Минздравсоцразвития России, Москва\r\nВведение. В связи с распространением современных облачных информационных технологий и повсеместной информатизации медицинскихбиостатистики Гематологического научного центра (ГНЦ) встала задача адекватной организации сбора данных в удаленных центрах.\r\nМатериалы и методы. Современные компьютерные и сетевые технологии позволяют использовать систему электронного сбора данных (СЭСД).\r\nРезультаты и обсуждение. Общие характеристики СЭСД и преимущества перед традиционным сбором данных на бумажных"
    },
    {
        "link": "https://cyberleninka.ru//article/n/formirovanie-obrazovatelnoy-sredy-it-spetsialistov-na-osnove-veb-tehnologiy",
        "name": "Формирование образовательной среды ИТ-специалистов на основе веб-технологий",
        "author": "Голицына Ирина Николаевна, Афзалова Альфия Николаевна",
        "year": "2012",
        "branch": "Образовательные технологии и общество",
        "description": "﻿Формирование образовательной среды ИТ-специалистов на основе веб-технологий\r\nИрина Николаевна Голицына доцент, к.ф.м.н., заведующая кафедрой прикладной информатики Альфия Николаевна Афзалова доцент, к.п.н.\r\nКазанский (Приволжский) Федеральный университет, ул. Кремлевская, 35, г.Казань, 420008, (843) 2337155 golitsina@mail.ru, Irina.Golitsvna@gmailобразовательной среды современных специалистов по информационным технологиям. Описан опыт создания электронных образовательных ресурсов «Сетевая экономика», «Средство разработки веб-приложений Visual Studio на основе ASP.NET», «Мировые информационные ресурсы» с использованием технологии вики в сотрудничестве со студентами специальности «Прикладная информатика"
    },
    {
        "link": "https://cyberleninka.ru//article/n/issledovanie-noveyshih-veb-tehnologiy-i-algoritmov-prodvizheniya-saytov",
        "name": "Исследование новейших веб-технологий и алгоритмов продвижения сайтов",
        "author": "Егорова И. Н., Бондаренко Е. А.",
        "year": "2012",
        "branch": "Восточно-Европейский журнал передовых технологий",
        "description": "навчального поыбника «HTML5/CSS3, JavaScript/SEO. Розробка сучасних сайmiв»\r\nКлючовi слова: ттернет-технологи, динамiчна графша, ттерфейс, методи пошуковог оптимiзацiг, ранжування сай-тiв\r\n□-□\r\nПредставлено аналитическое исследование новейших технологий WEB-дизайна, анализ основных алгоритмов продвижения сайтов и их практическая реализация в виде интерактивногосовременных сайтов»\r\nКлючевые слова: интернет-технологии, динамическая графика, интерфейс, методы поисковой оптимизации, ранжирование сайтов -□ □-\r\nУДК 004.89\r\nИССЛЕДОВАНИЕ НОВЕЙШИХ ВЕБ-ТЕХНОЛОГИЙ И АЛГОРИТМОВ ПРОДВИЖЕНИЯ САЙТОВ\r\nИ.Н. Егорова\r\nКандидат технических наук, доцент Кафедра мультимедийных систем и технологий* Контактный тел.: (057) 702-13-78 E-mail:"
    },
    {
        "link": "https://cyberleninka.ru//article/n/proektirovanie-udalyonnogo-informatsionnogo-resursa-s-ispolzovaniem-veb-tehnologiy",
        "name": "ПРОЕКТИРОВАНИЕ УДАЛЁННОГО ИНФОРМАЦИОННОГО РЕСУРСА С ИСПОЛЬЗОВАНИЕМ ВЕБ-ТЕХНОЛОГИЙ",
        "author": "Ломовская Елена Владиславовна, Алешкова Елена Николаевна",
        "year": "2021",
        "branch": "Достижения науки и образования",
        "description": "﻿ТЕХНИЧЕСКИЕ НАУКИ\r\nПРОЕКТИРОВАНИЕ УДАЛЁННОГО ИНФОРМАЦИОННОГО\r\nРЕСУРСА С ИСПОЛЬЗОВАНИЕМ ВЕБ-ТЕХНОЛОГИЙ\r\n1 2 Ломовская Е.В. , Алешкова Е.Н.\r\n1Ломовская Елена Владиславовна - заведующая учебной частью;\r\n2Алешкова Елена Николаевна - заведующая отделением, отделение очного обучения, Государственное бюджетное профессиональное образовательное учреждение\rпрохождения обучения.\r\nДля решения задачи организации информационного ресурса с возможностью использования и редактирования базы данных студентов была спроектирована и реализована веб-страница на конкретном удалённом хостинге с использованием БД на mysql-server, phpmyadmin, языка php, которая позволяет не только хранить данные о студентах, но и редактировать"
    },
    {
        "link": "https://cyberleninka.ru//article/n/rol-veb-orientirovannyh-tehnologiy-v-sisteme-sovremennogo-innovatsionnogo-obucheniya",
        "name": "Роль веб-ориентированных технологий в системе современного инновационного обучения",
        "author": "Саидов И.Д.",
        "year": "2018",
        "branch": "Санкт-Петербургский образовательный вестник",
        "description": "377.8\r\nРОЛЬ ВЕБ-ОРИЕНТИРОВАННЫХ ТЕХНОЛОГИЙ В СИСТЕМЕ СОВРЕМЕННОГО\r\nИННОВАЦИОННОГО ОБУЧЕНИЯ\r\nСаидов И.Д., 2018\r\nАзербайджанский государственный экономический университет, соискатель, Баку\r\nАннотация: в данной статье охарактеризована группа категорий, отражающая социально-образовательный аспект использования, веб-ориентированных технологий и обоснованытехнические средства, с помощью которых функционирует сеть, что является основой для внедрения современного инновационного обучения.\r\nКлючевые слова: веб-технологии, интернет, сайт, облачные технологии, теги.\r\nTHE ROLE OF WEB-ORIENTED TECHNOLOGIES IN THE SYSTEM OF MODERN\r\nINNOVATION TRAINING\r\nSaidov I.D., 2018 Azerbaijan State Economic University, applicant"
    },
    {
        "link": "https://cyberleninka.ru//article/n/funktsii-informatsionnyh-tehnologiy-veb-2-0-v-obuchenii-inostrannomu-yazyku",
        "name": "Функции информационных технологий Веб 2. 0 в обучении иностранному языку",
        "author": "Юрова Ольга Авинеровна",
        "year": "2013",
        "branch": "Вестник Таганрогского института имени А.П. Чехова",
        "description": "Таганрог, 2012. - Часть II: Физика психоэкологии.\r\nУДК 373 ББК 74.261\r\nО. А. Юрова\r\nФУНКЦИИ ИНФОРМАЦИОННЫХ ТЕХНОЛОГИЙ ВЕБ 2.0 В ОБУЧЕНИИ ИНОСТРАННОМУ ЯЗЫКУ\r\nАннотация. В статье рассмотрены преимущества инновационных обучающих технологий поколения Веб 2.0 в процессе обучения иностранным языкам, обоснована возможность и целесообразность их практического примененияпримере международной социальной сети Busuu.com, предлагающей услуги в сфере иноязычного образования.\r\nКлючевые слова: традиционные компьютерные технологии, инновационные технологии веб 2.0, функции сервисов Веб 2.0 в обучении иностранному языку.\r\nO. A. Yurova\r\nWEB 2.0 FUNCTIONS IN THE PROCESS OF FOREIGN LANGUAGE TEACHING\r\nAbstract. The article deals with"
    },
    {
        "link": "https://cyberleninka.ru//article/n/retrospektiva-razvitiya-veb-tehnologiy-v-sozdanii-korporativnyh-informatsionnyh-sistem",
        "name": "РЕТРОСПЕКТИВА РАЗВИТИЯ ВЕБ-ТЕХНОЛОГИЙ В СОЗДАНИИ КОРПОРАТИВНЫХ ИНФОРМАЦИОННЫХ СИСТЕМ",
        "author": "Шинкарев Александр Андреевич",
        "year": "2020",
        "branch": "Вестник Южно-Уральского государственного университета. Серия: Компьютерные технологии, управление, радиоэлектроника",
        "description": "﻿УДК 62; 004; 007\r\nDOI: 10.14529/ctcr200402\r\nРЕТРОСПЕКТИВА РАЗВИТИЯ ВЕБ-ТЕХНОЛОГИЙ В СОЗДАНИИ КОРПОРАТИВНЫХ ИНФОРМАЦИОННЫХ СИСТЕМ\r\nА.А. Шинкарев\r\nООО «Софтмаст-ИТ», г. Челябинск, Россия\r\nВведение. Первые упоминания о корпоративных информационных системах появились в 60-х гг. XX в. Со временем эти системы развивались, становились более сложными, но прив. стали активно развиваться веб-технологии. Естественным образом они нашли свое применение и при разработке корпоративных информационных систем различного назначения. Цель исследования. Описание основных этапов развития веб-технологий, начиная от появления языка гипертекстовой разметки до современных одностраничных веб-приложений, а также их влияния"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-tehnologii-veb-kvest-v-professionalnom-samoopredelenii",
        "name": "Использование технологии \"веб-квест\" в профессиональном самоопределении",
        "author": "Царапкина Юлия Михайловна, Якубова Эльмира Юнировна",
        "year": "2018",
        "branch": "Вестник Российского университета дружбы народов. Серия: Информатизация образования",
        "description": "2\r\nИспользование технологии «веб-квест» в профессиональном самоопределении\r\nЮ.М. Царапкина, Э.Ю. Якубова\r\nРоссийский государственный аграрный университет — МСХА им. К.А. Тимирязева Российская Федерация, 127550, Москва, ул. Тимирязевская, 49\r\nЦель данной работы заключается в анализе теоретических исследований информационных технологий и опытно-экспериментальногоопытно-экспериментального исследования среди старшеклассников и студентов для изучения профориентационной направленности, выбора приоритетов в профессии и эффективности применения веб-квестов в профориентации молодежи.\r\nВ ходе выполнения работы были использованы следующие методы исследования: анализ научно-методической литературы, тестирование, анкетирование, интервьюирование"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-veb-kvesta-v-obuchenii-inostrannyh-stazherov",
        "name": "Технология веб-квеста в обучении иностранных стажеров",
        "author": "Мельникова Арина Юрьевна",
        "year": "2014",
        "branch": "Вестник Южно-Уральского государственного гуманитарно-педагогического университета",
        "description": "Ivanovo airinme@mail.ru Технология веб-квеста в обучении иностранных стажёров WebQuest technology in training of foreign trainees\r\nВ статье рассматривается актуальная проблема применения технологии веб-квеста в обучении иностранных стажёров с целью развития профессиональных компетенций. Автор описывает этапы создания и выполнения веб-квеста, варианты заданийзаданий, специфику работы иностранных стажёров с данной технологией и преимущества её использования в учебном процессе.\r\nThe paper considers the actual problem of application of WebQuest technology in training of foreign trainees for the purpose of development of information, communicative, sociocultural competences are considered. The author describes"
    },
    {
        "link": "https://cyberleninka.ru//article/n/sposoby-vnedreniya-tehnologiy-veb-2-0-v-uchebnyy-protsess",
        "name": "Способы внедрения технологий Веб 2. 0 в учебный процесс",
        "author": "Олефиренко Надежда Васильевна, Ольховский Евгений Александрович",
        "year": "2011",
        "branch": "Наукові записки Тернопільського національного педагогічного університету. Серія: педагогіка ",
        "description": "КлнментъевВ. Социальные сети: от реальности к веб-сервису / Владимир Климентъев [Електронний ресурс] //Режим доступу: http://tvoisoft.ru/sotsialnyie-seti-ot-realnosti-k-veb-servisu/\r\n7.\tПатаракинЕ. Д Характеристики социальных сервисов ВЕб 2.0 /Е.Д Пагаракин [Електронний ресурс]. — Информационные технологи в управлении образованием — IV ВсероссийскаяВсероссийская конференция— Псков-2007. —Режим доступу : http://cQnf2007.pskovedu.ru/files/thesis/628.doc\r\n8.\tПатаракин Е. Д Социальные сервисы Веб 2.0 в помощь учителю /Е.Д. Пагаракин. -М: Интуит.ру, 2006. —64 е.: ил —(Учебно-методическое пособие).\r\n9.\tТенденци метод1в електронного навчання / [Електронний ресурс]. — Режим доступу : http://elearningtech.blogspot"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-tehnologiy-zaschity-ot-identifikatsii-veb-brauzerov",
        "name": "Анализ технологий защиты от идентификации веб-браузеров",
        "author": "Московченко Валерий Михайлович, Столяров Данил Олегович, Горбунов Александр Андреевич, Белянин Владислав Игоревич",
        "year": "2018",
        "branch": "NBI-technologies",
        "description": "﻿www.volsu.ru\r\nDOI: https://doi.Org/10.15688/NBIT.jvolsu.2018.1.6\r\nУДК 003.26.7:004.09 ББК 32.973.202\r\nАНАЛИЗ ТЕХНОЛОГИИ ЗАЩИТЫ ОТ ИДЕНТИФИКАЦИИ ВЕБ-БРАУЗЕРОВ\r\nВалерий Михайлович Московченко\r\nДоктор экономических наук, кандидат военных наук, профессор, генерал-лейтенант, директор военного института,\r\nЮжно-Российский государственный политехнический университетОписаны основные технологии для отслеживания действия пользователей сайтов, принЦ\tцип их работы. Выделены преимущества и недостатки технологий cookies и fingerprints\r\n5\tи методы защиты от данных технологий.\r\n^\tКлючевые слова: анонимность, конфиденциальность, cookies, fingerprint, веб-\r\nffl браузер.\r\nSi и\r\n(D И\r\ng В век информационных технологий нимность в"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-semanticheskogo-veb-dostupa-k-multimediynym-aktivam",
        "name": "Технологии семантического Веб доступа к мультимедийным активам",
        "author": "Сытник А. А., Вагарина Н. С., Мельникова Н. И.",
        "year": "2011",
        "branch": "Вестник Саратовского государственного технического университета",
        "description": "﻿УДК 004.622\r\nА.А. Сытник, Н.С. Вагарина, Н.И. Мельникова ТЕХНОЛОГИИ СЕМАНТИЧЕСКОГО ВЕБ ДОСТУПА К МУЛЬТИМЕДИЙНЫМ АКТИВАМ\r\nПреодоление семантического разрыва в использовании мультимедийных активов возможно при использовании технологий семантического веба. Анноти-\r\nрование мультимедийных активов на основе предметно-независимых мультимедийных онтологийwill help providing multiple reuse of multimedia assets.\r\nMultimedia assets, semantic divide, multimedia ontology, thematic ontology\r\nБеспрецедентное развитие мультимедийных технологий в последнее десятилетие привело к появлению больших слабоструктурированных мультимедийных активов, в том числе образовательных. Становление онлайнового образования, т.е."
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-kvest-tehnologii-v-obuchenii-inostrannym-yazykam",
        "name": "ВЕБ-КВЕСТ ТЕХНОЛОГИИ В ОБУЧЕНИИ ИНОСТРАННЫМ ЯЗЫКАМ",
        "author": "Сагитова Римма Раисовна, Гайнуллина Айгуль",
        "year": "2019",
        "branch": "Казанский вестник молодых учёных",
        "description": "﻿УДК 378\r\nВЕБ-КВЕСТ ТЕХНОЛОГИИ В ОБУЧЕНИИ ИНОСТРАННЫМ ЯЗЫКАМ Сагитова Р.Р., Гайнуллина А.И.\r\nsag-rimma@yandex.ru Казанский (Приволжский) федеральный университет, г. Казань, Россия\r\nАннотация. В статье рассматриваются возможности использования веб-квест технологий при формировании иноязычной коммуникативной компетенции учащихся. Авторы выделяют основныеосновные методы, используемые при работе с данной технологией; определяют условия применения данной технологии на занятиях по иностранному языку; выделяют принципы классификации веб-квестов. Авторами представлена также структура веб-квеста. Авторы подчеркивают, что применение веб-квест технологий в образовательном процессе позволит мотивировать учащихся"
    },
    {
        "link": "https://cyberleninka.ru//article/n/personalizatsiya-obucheniya-na-osnove-tehnologii-veb-kvest",
        "name": "ПЕРСОНАЛИЗАЦИЯ ОБУЧЕНИЯ НА ОСНОВЕ ТЕХНОЛОГИИ ВЕБ-КВЕСТ",
        "author": "Чернявская Анна Павловна",
        "year": "2020",
        "branch": "Ярославский  педагогический вестник",
        "description": "﻿УДК 378\r\nА. П. Чернявская https://orcid.org/0000-0002-6882-3332\r\nПерсонализация обучения на основе технологии веб-квест\r\nДля цитирования: Чернявская А. П. Персонализация обучения на основе технологии веб-квест // Ярославский педагогический вестник. 2020. № 6 (117). С. 30-39. DOI 10.20323/1813-145X-2020-6-117-30-39\r\nРезультативность обучения определяетсяоснов персонализации обучения в статье рассматривается технология конструирования и решения веб-квестов. Веб-квест - исследовательский вид деятельности, который позволяет обучающимся получить новые знания и расширить понимание изучаемого вопроса. Обсуждаются результаты использования этой технологии при обучении студентов магистратуры в период дистанционного"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razrabotka-progressivnogo-veb-prilozheniya-s-pomoschyu-tehnologii-pwa",
        "name": "РАЗРАБОТКА ПРОГРЕССИВНОГО ВЕБ-ПРИЛОЖЕНИЯ С ПОМОЩЬЮ ТЕХНОЛОГИИ PWA",
        "author": "Газизуллин Нафис Инсафович, Плещинская Ирина Евгеньевна",
        "year": "2020",
        "branch": "StudNet",
        "description": "﻿РАЗРАБОТКА ПРОГРЕССИВНОГО ВЕБ-ПРИЛОЖЕНИЯ С ПОМОЩЬЮ ТЕХНОЛОГИИ PWA\r\nDEVELOPING A PROGRESSIVE WEB APPLICATION USING PWA\r\nTECHNOLOGY\r\nУДК-004\r\nГазизуллин Нафис Инсафович, студент, Казанского национального исследовательского технологического университета, Россия, г. Казань Плещинская Ирина Евгеньевна, к.ф.-м.н., доцент, Казанского национального исследовательскогопосвящена разработке прогрессивного веб-приложения с помощью технологии PWA (Progressive Web Application). Рассмотрены преимущества и недостатки данной технологии. Раскрыто понятие «прогрессивное веб-приложение». Приведена краткая история возникновения и развития данной технологии. В настоящее время несмотря на то, что технология PWA позволяет существенно облегчить"
    },
    {
        "link": "https://cyberleninka.ru//article/n/mezhdistsiplinarnaya-integratsiya-v-protsesse-izucheniya-veb-tehnologiy-i-kompyuternoy-grafiki",
        "name": "Междисциплинарная интеграция в процессе изучения веб-технологий и компьютерной графики",
        "author": "Колесников Андрей Витальевич, Сиренко Светлана Николаевна",
        "year": "2013",
        "branch": "Открытое образование",
        "description": "﻿УДК 3702\tА.В. Колесников, С.Н. Сиренко\r\nВАК 13.00.02\t'\tг\r\nРИНЦ 14.35.09\r\nМеждисциплинарная интеграция в процессе изучения веб-технологий и компьютерной графики\r\nВ статье обосновывается целесообразность междисциплинарной интеграции для повышения качества образовательного процесса в условиях широкого внедрения компетентностного подхода в вузе. На примересозданию и модернизации интернет-сайтов. Разработка и сопровождение современных веб-ресурсов предполагает знание языка гипертекстовой разметки HTML (включая его современные расширения), языковых средств веб-программирования, принципов создания статичных и динамических сайтов, основ веб-дизайна, растровой, векторной и трехмерной графики, анимации, средств работы"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-veb-tehnologiy-pri-razrabotke-raspredelennyh-sistem-monitoringa",
        "name": "Применение веб-технологий при разработке распределенных систем мониторинга",
        "author": "Фролова Марина Владимировна",
        "year": "2011",
        "branch": "Известия Южного федерального университета. Технические науки",
        "description": "﻿БИБЛИОГРАФИЧЕСКИЙ СПИСОК\r\n1.\tСигаев A. Embedded Internet // Компоненты и технологии. - 2000. - № 2.\r\n2.\tЗубинский А. МиKpoWeb // Компьютерное Обозрение. - 2000. - № 20.\r\nСтатью рекомендовал к опубликованию д.т.н., профессор АЖ. Белевцев. Тужилкин Олег Владимирович\r\nНаучно-исследовательский институт физических измерений.\r\nE-mail: niifi@sura.ru.\r\n440026объектов. Для ее реализации предлагается использовать интерфейс Ethernet и миниатюрные веб-серверы в каждом датчике системы мониторинга или блоке сбора данных для создания удаленных измерительных систем. Описан принцип удаленного доступа к данным при помощи веб-технологий. Данное решение позволит добиться увеличения скорости работы измерительных систем,"
    },
    {
        "link": "https://cyberleninka.ru//article/n/sistema-podderzhki-prinyatiya-resheniy-po-vodoraspredeleniyu-na-baze-veb-tehnologiy",
        "name": "СИСТЕМА ПОДДЕРЖКИ ПРИНЯТИЯ РЕШЕНИЙ ПО ВОДОРАСПРЕДЕЛЕНИЮ НА БАЗЕ ВЕБ-ТЕХНОЛОГИЙ",
        "author": "Юрченко Ирина Федоровна, Трунин Владимир Вячеславович",
        "year": "2014",
        "branch": "Мелиорация и гидротехника",
        "description": "Москва, Российская Федерация\r\nСИСТЕМА ПОДДЕРЖКИ ПРИНЯТИЯ РЕШЕНИЙ ПО ВОДОРАСПРЕДЕЛЕНИЮ НА БАЗЕ ВЕБ-ТЕХНОЛОГИЙ\r\nЦель работы - совершенствование и повышение эффективности оперативного управления водораспределением за счет использования информационных технологий в практике диспетчерской службы межхозяйственных оросительных систем. Рассмотрены вопросы модернизацииметодологии системного анализа, методах моделирования сложных систем; имитационного и математического моделирования; теории оптимальных решений, создания новых информационных технологий. Разработаны модели, алгоритмы и процедуры управления водораспределением на межхозяйственных оросительных системах, обеспечивающие: гарантированное равноправное вододеление"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-veb-tehnologiy-v-professionalnoy-deyatelnosti-prepodavatelya-inostrannogo-yazyka",
        "name": "Применение веб-технологий в профессиональной деятельности преподавателя иностранного языка",
        "author": "Вульфович Екатерина Витальевна",
        "year": "2015",
        "branch": "Вестник Томского государственного педагогического университета",
        "description": "372.881.111.1\r\nЕ. В. Вульфович\r\nПРИМЕНЕНИЕ ВЕБ-ТЕХНОЛОГИЙ В ПРОФЕССИОНАЛЬНОЙ ДЕЯТЕЛЬНОСТИ ПРЕПОДАВАТЕЛЯ\r\nИНОСТРАННОГО ЯЗЫКА\r\nРассматривается использование блогов, сервисов социальных закладок и технологии вики в профессиональной деятельности преподавателя иностранного языка. Описываются свойства технологий Web 2.0 и раскрывается методический потенциалпотенциал их применения для формирования коммуникативной компетенции. Поскольку свойства технологий Web 2.0 подразумевают групповое взаимодействие пользователей, то их применение для обучения иностранным языкам может способствовать формированию умений вести дискуссию, совершенствованию навыков письменной речи разных стилей, развитию рецептивных видов речевой"
    },
    {
        "link": "https://cyberleninka.ru//article/n/izbiratelnoe-rasprostranenie-informatsii-na-baze-veb-servisov-obzor-internet-resursov",
        "name": "Избирательное распространение информации НА БАЗЕ ВЕБ-СЕРВИСОВ: Обзор интернет-ресурсов",
        "author": "Юдина Инна Геннадиевна",
        "year": "2008",
        "branch": "Библиосфера",
        "description": "БАЗЕ ВЕБ-СЕРВИСОВ: ОБЗОР ИНТЕРНЕТ-РЕСУРСОВ\r\n© И.Г. Юдина, 2008\r\nГосударственная публичная научно-техническая библиотека Сибирского отделения Российской академии наук 630200, г. Новосибирск, ул. Восход, 15\r\nВ настоящее время за рубежом происходит динамичное развитие избирательного распространения информации (ИРИ) как сервиса на базе веб-технологий. Большоепредоставляющих интернет-сервис по идеологии ИРИ. Описана деятельность библиотек по организации использования данного сервиса в интересах читателей.\r\nКлючевые слова: ИРИ, веб-технологии, сервис, библиотеки.\r\nИзбирательное распространение информации (ИРИ) является одним из основных видов информационного обеспечения (ИО) научных исследований. Его развитие"
    },
    {
        "link": "https://cyberleninka.ru//article/n/individualnyy-dizayn-ili-ispolzovanie-shablonov",
        "name": "Индивидуальный дизайн или использование шаблонов",
        "author": "Григорьева Светлана Сергеевна",
        "year": "2018",
        "branch": "Достижения науки и образования",
        "description": "выявлено в каком случае можно прибегнуть к шаблонному проектированию, а когда лучше выбрать индивидуальный дизайн для сайта. Ключевые слова: веб-технологии, дизайн, индивидуальный, шаблон.\r\nВ век информационных технологий нередко возникает необходимость создания сайта, как для крупных корпораций, так и для совсем небольших фирм. На этапе постановки техническойдизайна будет на порядок выше, ведь она включает работу сразу нескольких специалистов, что уж говорить и о скорости исполнения. Даже команда профессионалов высококвалифицированной веб-студии не сможет реализовать масштабный проект в считанные часы, что позволяет сделать шаблонное проектирование.\r\nШаблонное проектирование [1], в отличие от индивидуального можно"
    },
    {
        "link": "https://cyberleninka.ru//article/n/o-ratsionalizatsii-kompleksnogo-kontrolya-sportsmenov-na-osnove-veb-tehnologiy-i-ekspertnyh-sistem",
        "name": "О рационализации комплексного контроля спортсменов на основе веб-технологий и экспертных систем",
        "author": "Цыбиков Анатолий Сергеевич, Балдаев Кирилл Владимирович, Тапхаров Михаил Викторович",
        "year": "2013",
        "branch": "Вестник Бурятского государственного университета. Философия",
        "description": "КОНТРОЛЯ СПОРТСМЕНОВ НА ОСНОВЕ ВЕБ-ТЕХНОЛОГИЙ И ЭКСПЕРТНЫХ СИСТЕМ\r\nВ статье рассматриваются задачи, подходы, принципы и методы разработки информационной системы комплексного контроля подготовленности спортсменов с применением веб-технологий и экспертных систем.\r\nКлючевые слова: Подготовка спортсменов комплексный контроль, веб-ориентированная информационнаяспорта требуется создание обучаемой экспертной системы с удобным инструментарием для сбора информации (веб-ориентированность).\r\nИдея решения проблемы\r\nИтак, мы полагаем, что для повышения эффективности комплексного контроля необходима разработка веб-ориентированной системы комплексного мониторинга подготовленности спортсменов с применением современных"
    },
    {
        "link": "https://cyberleninka.ru//article/n/organizatsiya-dostupa-k-tehnologicheskim-dannym-gazodobyvayuschih-predpriyatiy-posredstvom-veb-tehnologiy",
        "name": "Организация доступа к технологическим данным газодобывающих предприятий посредством веб-технологий",
        "author": "Финько Антон Игоревич",
        "year": "2014",
        "branch": "Векторы благополучия: экономика и социум",
        "description": "ГАЗОДОБЫВАЮЩИХ ПРЕДПРИЯТИЙ ПОСРЕДСТВОМ ВЕБ-ТЕХНОЛОГИЙ\r\nА.И. Финько\r\nТомский политехнический университет E-mail: finkoai@sibhtc.ru\r\nВ статье рассматриваются проблемы доступа к технологическим данным газодобывающих предприятий. Рассмотрены способы их решения посредством организации доступа с использованием веб-технологий. Изучены универсальные решения, а такжепредприятий. На основании изученного материала сделаны соответствующие выводы об актуальности использования подобного подхода.\r\nКлючевые слова:\r\nГазодобывающие предприятия, веб-технологии, OSIsoft, MES-система, доступ к данным.\r\nВведение\r\nВ управлении предприятием ведущая роль отводится контролю различных производственных показателей. Руководитель любого"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-tehnologiy-dlya-realizatsii-metodiki-otsenivaniya-ekologicheskih-problem",
        "name": "Использование веб-технологий для реализации методики оценивания экологических проблем",
        "author": "Митченков Игорь Григорьевич, Баумгартэн Михаил Ицекович, Михайлов Владимир Геннадьевич, Тайлакова Анна Александровна, Сарапулова Татьяна Викторовна",
        "year": "2013",
        "branch": "Вестник Кузбасского государственного технического университета",
        "description": "﻿УДК 004.42:519.688:332.05\r\nИ.Г. Митченков, М.И. Баумгартэн, В.Г. Михайлов,\r\nА.А. Тайлакова, Т.В. Сарапулова\r\nИСПОЛЬЗОВАНИЕ ВЕБ-ТЕХНОЛОГИЙ ДЛЯ РЕАЛИЗАЦИИ МЕТОДИКИ ОЦЕНИВАНИЯ ЭКОЛОГИЧЕСКИХ ПРОБЛЕМ\r\nВ условиях теоретической неясности научное прогнозирование политики в сфере взаимодействия общества и окружающей среды (экологической политики) существенновычислений в базе данных.\r\nВ качестве технологии разработки программного комплекса предлагается выбрать вебтехнологии.\r\nВажное значение в динамичном развитии информационных\tтехнологий\tимеют\tвеб-\r\nприложения. Сегодня приложения этого вида стали такими же сложными программными продуктами, как и обычные десктоп-приложения [1].\r\nВеб-приложения - это программы, предназначенные"
    },
    {
        "link": "https://cyberleninka.ru//article/n/adaptatsiya-zarubezhnogo-opyta-primeneniya-tehnologiy-semanticheskogo-veb-v-obrazovanii",
        "name": "Адаптация зарубежного опыта применения технологий семантического веб в образовании",
        "author": "Мельникова Нина Ивановна, Вагарина Наталия Сергеевна",
        "year": "2013",
        "branch": "Технические науки – от теории к практике",
        "description": "﻿АДАПТАЦИЯ ЗАРУБЕЖНОГО ОПЫТА ПРИМЕНЕНИЯ ТЕХНОЛОГИЙ СЕМАНТИЧЕСКОГО ВЕБ В ОБРАЗОВАНИИ\r\nМельникова Нина Ивановна\r\nд-р социолог. наук, профессор Саратовского государственного технического\r\nуниверситета им. Гагарина Ю.А., г. Саратов E-mail: melnikovani@gmail.ru Вагарина Наталия Сергеевна канд. ф. -мат. наук, доцент Саратовского государственного технического\rNinaMelnikova\r\ndoctor of Science, professor of Gagarin Saratov State Technical University,\r\nSaratov\r\nАННОТАЦИЯ\r\nВ статье рассматривается зарубежный опыт применения технологий семантического Веб в образовании на конкретных проектах Ensemble и Linked Education.org. Обосновывается необходимость выпуска серии информационно -аналитических материалов, представляющих"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-kvest-tehnologiy-v-obuchenii-inostrannym-yazykam",
        "name": "Использование веб-квест технологий в обучении иностранным языкам",
        "author": "Нурмиева Р.Р., Першина Н.О.",
        "year": "2018",
        "branch": "Казанский вестник молодых учёных",
        "description": "372\r\nИСПОЛЬЗОВАНИЕ ВЕБ-КВЕСТ ТЕХНОЛОГИЙ В ОБУЧЕНИИ ИНОСТРАННЫМ ЯЗЫКАМ\r\nР.Р. Нурмиева, Н.О. Першина\r\nАннотация. В статье рассматриваются возможности использования веб-квест технологий для развития иноязычной коммуникативной компетенции студентов. Подчеркивается необходимость внедрения в образовательные процессы информационных технологий. Авторы считаютприменение веб-квест техно-лолгий в образовательном процессе позволит совершенствовать информационную компетентность будущего профессионала, что, в свою очередь, позволит быть конкурентоспособным специалистом в быстро меняющемся информационном обществе.\r\nКлючевые слова: иноязычная коммуникативная компетенция, веб-квест, веб-квест технологии, интернет"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-veb-2-0-v-organizatsii-proektnoy-deyatelnosti-pedagogov-i-uchaschihsya",
        "name": "Технологии Веб 2. 0 в организации проектной деятельности педагогов и учащихся",
        "author": "Е. П. Круподерова",
        "year": "2009",
        "branch": "Вестник Марийского государственного университета",
        "description": "Иркутск: Иркут. гос. ун-т, 2006. - 200 с.\r\nТехнологии Веб 2.0 в организации\r\nпроектной деятельности педагогов и учащихся\r\nЕ.П. Круподерова (krupoderova@gmail.com)\r\nВолжский государственный инженернопедагогический университет, г. Нижний Новгород\r\nСтремительное развитие информационных и коммуникационных технологий приводит к значительной перестройке информационнойспособность формулировать, анализировать и решать проблемы; критическое мышление; навыки эффективной коммуникации; умение работать в команде; грамотность в области информационных технологий.\r\nСегодня в образовании осуществляется переход к компетентностному подходу, акцентирующему внимание на результате образования, причем в качестве результата рассматривается"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-tehnologiy-vzaimodeystviya-mobilnyh-prilozheniy-s-veb-servisami",
        "name": "Анализ технологий взаимодействия мобильных приложений с веб-сервисами",
        "author": "Кожомбаева А.Т., Щетилов А.В., Зотин А.Г.",
        "year": "2015",
        "branch": "Актуальные проблемы авиации и космонавтики",
        "description": "﻿УДК 004.91\r\nАНАЛИЗ ТЕХНОЛОГИЙ ВЗАИМОДЕЙСТВИЯ МОБИЛЬНЫХ ПРИЛОЖЕНИЙ\r\nС ВЕБ-СЕРВИСАМИ\r\nА. Т. Кожомбаева, А. В. Щетилов Научный руководитель - А. Г. Зотин\r\nСибирский государственный аэрокосмический университет имени академика М. Ф. Решетнева\r\nРоссийская Федерация, 660037, г. Красноярск, просп. им. газ. «Красноярский рабочий», 31 Е-mail: kojombaeva_a@mailkojombaeva_a@mail.ru, le713@mail.ru\r\nРассмотрены технологии взаимодействия мобильных приложений с веб-сервисами. Представлено описание условий проведения исследования технологий. Продемонстрированы полученные данные экспериментального исследования и результаты их анализа. Приведено обоснование выбора REST веб-сервера в качестве наилучшего решения для выбранной предметной"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-veb-2-0-i-mezhkulturnaya-kommunikatsiya-v-obuchenii-inostrannym-yazykam",
        "name": "Технологии Веб 2. 0 и межкультурная коммуникация в обучении иностранным языкам",
        "author": "Кащук Светлана Михайловна",
        "year": "2016",
        "branch": "Преподаватель ХХI век",
        "description": "﻿УДК 37.026.8 ББК 74\r\nТЕХНОЛОГИИ ВЕБ 2.0 И МЕЖКУЛЬТУРНАЯ КОММУНИКАЦИЯ В ОБУЧЕНИИ ИНОСТРАННЫМ ЯЗЫКАМ\r\nI С.М. Кащук\r\nАннотация. Актуальность статьи определяется стремительным развитием технологий Веб 2.0, появлением информационного цифрового пространства - наиболее доступной и удобной среды для организации иноязычной коммуникации, а также необходимостьюэтим, информатизации образования. Цель статьи - показать перспективы развития процесса интеграции современных цифровых технологий в систему языкового образования и представить практический опыт интеграции современных технологий Веб 2.0 в процесс обучения иностранному (французскому) языку в рамках создания и реализации международных сетевых учебных проектов"
    },
    {
        "link": "https://cyberleninka.ru//article/n/kommunikatsionnye-tehnologii-veb-2-0-v-prepodavanii-inostrannogo-yazyka",
        "name": "Коммуникационные ТЕХНОЛОГИИ ВЕБ-2.0 В ПРЕПОДАВАНИИ ИНОСТРАННОГО ЯЗЫКА",
        "author": "Садыкова Гульнара Василевна",
        "year": "2015",
        "branch": "Гуманитарные, социально-экономические и общественные науки",
        "description": "кандидат филологических наук, доцент, доцент кафедры германской филологии Казанского (Приволжского) федерального университета Gulnara.Sadykova@kpfu.ru\r\nКоммуникационные\r\nТЕХНОЛОГИИ ВЕБ-2.0 В ПРЕПОДАВАНИИ ИНОСТРАННОГО ЯЗЫКА\r\nGul’nara V. Sadykova\r\ncandidate of philological Sciences, associate professor.\r\nDepartment of Germanic Philology, Kazan Federal Universityкоммуникационные технологии веб-2.0 как средство обучения в целом и как эффективный инструмент обучения иностранному языку в частности. Основываясь на материалах зарубежных и российских исследователей, собственном опыте и кейс-исследовании кросс-культурного он-лайн-проекга, автор показывает особую важность интеграции информационно-коммуникационных технологий в систему"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-kvestov-v-protsesse-podgotovki-uchitelya-tehnologii",
        "name": "Использование веб-квестов в процессе подготовки учителя технологии",
        "author": "Кадемия М.Е.",
        "year": "2011",
        "branch": "Наукові записки Тернопільського національного педагогічного університету. Серія: педагогіка ",
        "description": "формирования его подготовки / Г. А. Карпова // Содержание подготовки инженеров-педагогов: сб. науч. Трудов - Свердловск: СИПИ, 1987. - С. 42-52.\r\n5.\tКоваленко О. Е. Методичш основи технологи навчання: теоретико-методичний та практичний аспект викладання дисциплш електроенергетичного циклу: монографiя / О. Е. Коваленко. -Харюв: Основа, 1996. - 184 с.\r\n6.\tШматков - Екатеринбург: Изд-во РГППУ, 2002. - 260 с.\r\n9.\tЯковенко Т. В. Методика навчання майбутшх iнженерiв-педагогiв проектуванню навчально-методичного забезпечення модульно! технологи: монографiя / Т. В. Яковенко. - Горлiвка: ПП «Видавництво Лiхтар», 2009. - 132 с.\r\nУДК 378.147\r\nР. М. ГОРБАТЮК, В. С. ФЕДОРЕЙКО\r\nЕКСПЕРИМЕНТАЛЬНЕ ДОСЛ1ДЖЕННЯ КОМПОНЕНТ1В ПРОФЕС1ЙНО1"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-integratsionnye-tehnologii-razvitiya-informatizatsii-selskogo-hozyaystva",
        "name": "Веб-интеграционные технологии развития информатизации сельского хозяйства",
        "author": "Меденников В. И.",
        "year": "2010",
        "branch": "Никоновские чтения",
        "description": "Управленческий персонал (менеджмент) всех предприятий системы должен иметь единый понятийный аппарат, говорить на понятном друг другу профессиональном языке, владеть современными технологиями управления, в том числе интегрированными системами управления.\r\nВ целях дальнейшего развития интеграционных процессов в АПК необходимо соблюдение следующих принципов: добровольностьисследований интеграционных процессов в агропродовольственном секторе\r\nВЕБ-ИНТЕГРАЦИОННЫЕ ТЕХНОЛОГИИ РАЗВИТИЯ ИНФОРМАТИЗАЦИИ\r\nСЕЛЬСКОГО ХОЗЯЙСТВА\r\nВ.И. Меденников, д.т.н., зав. отд., Всероссийского института аграрных проблем и\r\nинформатики им. А.А. Никонова\r\nПоскольку интернет-технологии самым тес-\tции, то и проблемы их произрастают из проблем\r\nным образом"
    },
    {
        "link": "https://cyberleninka.ru//article/n/formirovanie-inoyazychnoy-kommunikativnoy-kompetentsii-na-osnove-tehnologiy-veb-2-0",
        "name": "Формирование иноязычной коммуникативной компетенции на основе технологий Веб 2. 0",
        "author": "Мосина Маргарита Александровна, Кобелева Екатерина Сергеевна",
        "year": "2016",
        "branch": "Вестник Пермского государственного гуманитарно-педагогического университета. Серия № 1. Психологические и педагогические науки",
        "description": "﻿РАЗДЕЛ 2. СОВРЕМЕННЫЕ ОБРАЗОВАТЕЛЬНЫЕ ТЕХНОЛОГИИ\r\nУДК 004(07)\r\nМосина Маргарита Александровна\r\nдоктор пед. наук, профессор кафедры МПИЯ e-mail: margarita_67@inbox. ru\r\nКобелева Екатерина Сергеевна\r\nмагистрант второго курса факультета иностранных языков e-mail: KKkatyakobeleva@yandex. ru\r\nФГБОУ ВО «Пермский государственный гуманитарно-педагогический\rй\r\nуниверситет», Пермь, Россия 614990, Пермь, ул. Пушкина, 42, Б 309, +7 (342) 238 63 28\r\nФОРМИРОВАНИЕ ИНОЯЗЫЧНОЙ КОММУНИКАТИВНОЙ КОМПЕТЕНЦИИ НА ОСНОВЕ ТЕХНОЛОГИЙ ВЕБ 2.0\r\nMargarita A. Mosina\r\nDoctor of Pedagogic Sciences, Professor, Chair of Methods of Teaching Foreign Languages e-mail: margarita 67@inbox. ru\r\nEkaterina S. Kobeleva\r\nMaster of the Faculty"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-veb-kommunikatsii-v-rezhime-realnogo-vremeni-webrtc",
        "name": "Технология веб-коммуникации в режиме реального времени WebRTC",
        "author": "Худкина Е.А., Тимошина В.В.",
        "year": "2016",
        "branch": "Актуальные проблемы авиации и космонавтики",
        "description": "﻿УДК 004.4\r\nТЕХНОЛОГИЯ ВЕБ-КОММУНИКАЦИИ В РЕЖИМЕ РЕАЛЬНОГО ВРЕМЕНИ WEBRTC\r\nЕ. А. Худкина, В. В. Тимошина Научный руководитель - А. П. Багаева\r\nСибирский государственный аэрокосмический университет имени академика М. Ф. Решетнева\r\nРоссийская Федерация, 660037, г. Красноярск, просп. им. газ. «Красноярский рабочий», 31 E-mail: khudkina94@mail.ru, vlada-timoshina@mailvlada-timoshina@mail.ru\r\nИсследуется технологии веб-коммуникации в режиме реального времени WebRTC. Приводится описание данной технологии, принципов ее работы, рассматриваются преимущества и недостатки, а также перспективы развития.\r\nКлючевые слова: технология WebRTC, веб-коммуникация.\r\nTHE WEB REAL TIME COMMUNICATION TECHNOLOGY WEBRTC\r\nE. A. Khudkina,"
    },
    {
        "link": "https://cyberleninka.ru//article/n/fazzing-sovremennaya-tehnologiya-poiska-uyazvimostey-v-veb-prilozheniyah",
        "name": "Фаззинг – современная технология поиска уязвимостей в веб-приложениях",
        "author": "Полухин П. В.",
        "year": "2012",
        "branch": "Наука и современность",
        "description": "утверждены Госгортехнадзором России «14» декабря 1992 г.\r\nФАЗЗИНГ - СОВРЕМЕННАЯ ТЕХНОЛОГИЯ ПОИСКА УЯЗВИМОСТЕЙ В ВЕБ-ПРИЛОЖЕНИЯХ\r\n© Полухин П.В.*\r\nВоронежский государственный университет, г. Воронеж\r\nВ статье представлены результаты научного исследования сущности технологии фаззинга, проанализированы существующие этапы жизненного цикла, а также проведенасовременных приложений, которые можно обнаруживать с помощью данной технологии.\r\nВ настоящее время все больше и больше компаний переключаются на разработку и поставку программ веб-сервисов, которые в отличие от традиционных программных продуктов устанавливаются на локальный компьютер. Веб-приложения работают непосредственно на компьютере владельца или у"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-tehnologiy-veb-2-0-v-kompetentnostno-orientirovannom-bilingvalnom-obuchenii-bakalavrov",
        "name": "Использование технологий Веб 2. 0 в компетентностноориентированном билингвальном обучении бакалавров",
        "author": "Петрукович Любовь Андреевна, Кручинина Галина Александровна",
        "year": "2015",
        "branch": "Science Time",
        "description": "﻿SCIENCE TIME\r\nИСПОЛЬЗОВАНИЕ ТЕХНОЛОГИЙ ВЕБ 2.0 В КОМПЕТЕНТНОСТНО-\r\nОРИЕНТИРОВАННОМ БИЛИНГВАЛЬНОМ ОБУЧЕНИИ БАКАЛАВРОВ\r\nПетрукович Любовь Андреевна, Кручинина Галина Александровна, Национальный исследовательский университет Ни-жегородский государственный университет им. Н.И. Лобачевского, г. Нижний Новгород\r\nE-mail: daoro@yandex.ru\r\nАннотация. Рассматриваетсяинформатизации высшего профессионального образования. Описываются используемые средства информационных и коммуникационных технологий.\r\nКлючевые слова: компетентностный подход, билингвальная компетенция, средства информационных и коммуникационных технологий.\r\nОбщество постоянно повышает требования к уровню развития образования и личности. Современные общественные"
    },
    {
        "link": "https://cyberleninka.ru//article/n/organizatsiya-samostoyatelnoy-raboty-studentov-s-ispolzovaniem-veb-2-0-tehnologiy",
        "name": "Организация самостоятельной работы студентов с использованием Веб 2. 0 технологий",
        "author": "Щеголева А. В.",
        "year": "2014",
        "branch": "Психология и педагогика: методика и проблемы практического применения",
        "description": "педагогических технологий на основе разработки ЭОР повышает эффективность образовательного процесса. Однако она зависит, в первую очередь, от методической грамотности и умения педагогов организовывать и проводить учебные занятия, знания ими приемов и методов использования современных ИКТ, а так же учета требований, предъявляемых к педагогическим технологиям напроцесса в условиях применения этих технологий.\r\nСписок литературы:\r\n1.\tКрасильникова В.А. Информационные и коммуникационные технологии в образовании: учеб. пособ. / В.А. Красильникова. - М., 2006. - 231 с.\r\n2.\tКулагин В.П., Найханов В.В., Овезов Б.Б., Роберт И.В., Кольцова Г.В., Юрасов В.Г. Информационные технологии в сфере образования. - М.: Янус-К"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-veb-kvesta-v-sozdanii-pedagogami-mediaobrazovatelnoy-sredy",
        "name": "ТЕХНОЛОГИИ ВЕБ-КВЕСТА В СОЗДАНИИ ПЕДАГОГАМИ МЕДИАОБРАЗОВАТЕЛЬНОЙ СРЕДЫ",
        "author": "Д. В. Ларионова",
        "year": "2020",
        "branch": "Мир науки, культуры, образования",
        "description": "действует система профессионального воспитания, способствующая личностному развитию студентов. Помимо этого, в рассмотренных образовательных учреждениях широко применяются технологии, позволяющие строить и реализовывать индивидуальные траектории профессиональной подготовки и личностного развития обучающихся, создана система сетевого взаимодействия университетовг. Москва;\r\nпедагог дополнительного образования МБУДО ДЮЦ «Радуга», г. о. Пущино, E-mail: diana886@yandex.ru\r\nТЕХНОЛОГИИ ВЕБ-КВЕСТА В СОЗДАНИИ ПЕДАГОГАМИ МЕДИАОБРАЗОВАТЕЛЬНОЙ СРЕДЫ\r\nВ статье рассматривается роль использования технологии веб-квестов в развитии медиаобразовательной среды. Автор проанализировал исследования и публикации по тематике медиаобразования"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-razrabotki-odnostranichnogo-veb-prilozheniya-na-platforme-angular-8",
        "name": "ТЕХНОЛОГИЯ РАЗРАБОТКИ ОДНОСТРАНИЧНОГО ВЕБ-ПРИЛОЖЕНИЯ НА ПЛАТФОРМЕ ANGULAR 8",
        "author": "Сулыз А. В., Панфилов А. Н.",
        "year": "2020",
        "branch": "Молодой исследователь Дона",
        "description": "﻿\r\nУДК-004.422.81\r\nТЕХНОЛОГИЯ РАЗРАБОТКИ ОДНОСТРАНИЧНОГО ВЕБ-ПРИЛОЖЕНИЯ НА ПЛАТФОРМЕ ANGULAR 8\r\nА. В. Сулыз, А. Н. Панфилов\r\nЮжно-Российский государственный политехнический университет (НИИ) имени М. И. Платова (г. Новочеркасск, Российская Федерация)\r\nПриводится пример разработки одностраничного веб-приложения на платформе Angular 8. Рассмотрены различныеразличные аспекты в разработке одностраничных веб-приложений, а также преимущества и недостатки их применения. Описаны наиболее популярные JavaScript фреймворки для создания одностраничных веб-приложений. Разработана диаграмма развертывания приложения, разработанного по архитектуре REST с применением фреймворка Spring и СУБД Postgre SQL. На основании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-veb-kvest-v-podgotovke-aspirantov-k-prepodavatelskoy-deyatelnosti",
        "name": "ТЕХНОЛОГИЯ ВЕБ-КВЕСТ В ПОДГОТОВКЕ АСПИРАНТОВ К ПРЕПОДАВАТЕЛЬСКОЙ ДЕЯТЕЛЬНОСТИ",
        "author": "Кузнецова О.З.",
        "year": "2020",
        "branch": "Электронный научно-методический журнал Омского ГАУ",
        "description": "﻿Кузнецова О.З. Технология Веб-квест в подготовке аспирантов к преподавательской деятельности// Электронный научно-методический журнал Омского ГАУ. - 2020. - № 2 (21) апрель - июнь. - URL http://e-journal.omgau.ru/images/issues/2020/2/00846.pdf. - ISSN 2413-4066\r\nУДК 371\r\nКузнецова Ольга Зориктоевна\r\nкандидат педагогических наук, доцент ФГБОУ ВО Омскийorg\r\nТехнология Веб-квест в подготовке аспирантов к преподавательской\r\nдеятельности\r\nАннотация. В статье раскрывается дидактический потенциал технологии веб-квеста в подготовке аспирантов к педагогической деятельности. Анализируются подходы к пониманию данной категории. Представлено авторское определение понятия. Выделены особенности технологии, отличающие"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razvitie-kompetentnosti-studentov-pri-obuchenii-matematike-s-ispolzovaniem-veb-tehnologiy",
        "name": "Развитие компетентности студентов при обучении математике с использованием веб-технологий",
        "author": "Воронцова Ольга Романовна, Секованов Валерий Сергеевич, Катержина С. Ф.",
        "year": "2008",
        "branch": "Вестник Костромского государственного университета",
        "description": "психологические науки». - 2006. - Вып. 5. - С. 66-69.\r\nО.Р. Воронцова, В.С. Секованов, С.Ф. Катержина РАЗВИТИЕ КОМПЕТЕНТНОСТИ СТУДЕНТОВ ПРИ ОБУЧЕНИИ МАТЕМАТИКЕ С ИСПОЛЬЗОВАНИЕМ ВЕБ-ТЕХНОЛОГИЙ\r\nВ настоящее время актуальным является проект «Студент - молодой специалист - работодатель». Объектом исследования является качество подготовки специалистов, качество образовательныхневозможно представить образовательный процесс без использования современных информационных и коммуникационных технологий (ИКТ). В положении обучаемого находятся и преподаватель, и студент, т.к. вынуждены непрерывно осваивать новые идеи и технологии, термины и их определения, программное и аппаратное обеспечение ИКТ, чтобы получать нужную информацию, вырабатывать"
    },
    {
        "link": "https://cyberleninka.ru//article/n/programmnoe-obespechenie-na-osnove-veb-tehnologiy-dlya-geonavigatsii-neftegazovyh-skvazhin",
        "name": "ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ НА ОСНОВЕ ВЕБ-ТЕХНОЛОГИЙ ДЛЯ ГЕОНАВИГАЦИИ НЕФТЕГАЗОВЫХ СКВАЖИН",
        "author": "Даниловский Кирилл Николаевич, Дудаев Александр Русланович, Глинских Вячеслав Николаевич, Никитенко Марина Николаевна, Москаев Илья Алексеевич",
        "year": "2019",
        "branch": "Вестник Новосибирского государственного университета. Серия: Информационные технологии",
        "description": "﻿УДК 550.832\r\nDOI 10.25205/1818-7900-2019-17-2-5-17\r\nПрограммное обеспечение на основе веб-технологий для геонавигации нефтегазовых скважин\r\nК. Н. Даниловский \\ А. Р. Дудаев 1 2, В. Н. Глинских 1-3 М. Н. Никитенко 1, И. А. Москаев 1 2\r\n1 Институт нефтегазовой геологии и геофизики им. А. А. Трофимука СО РАН 2 Новосибирский государственный университеткаротажа. Разработанное новое программное приложение основано на веб-технологиях и имеет клиент-серверную архитектуру. Для оптимизации времени выполнения ресурсоемких расчетов используются высокопроизводительные облачные вычисления. Ключевые слова\r\nпрограммное обеспечение, веб-технологии, геонавигация, каротаж в процессе бурения, горизонтальная скважина"
    },
    {
        "link": "https://cyberleninka.ru//article/n/programmnaya-podsistema-monitoringa-polzovatelskoy-aktivnosti-veb-orientirovannoy-geoinformatsionnoy-sistemy",
        "name": "Программная подсистема мониторинга пользовательской активности веб-ориентированной геоинформационной системы",
        "author": "Милихин Михаил Михайлович",
        "year": "2012",
        "branch": "Доклады Томского государственного университета систем управления и радиоэлектроники",
        "description": "﻿УДК 004.023 М.М. Милихин\r\nПрограммная подсистема мониторинга пользовательской активности веб-ориентированной геоинформационной системы\r\nрассмотрены основные проблемы проектирования архитектуры Web-ориеm'ированных гео-информационных систем (ГИС) с точки зрения организации аудита пользовательской активности в системе. На основании проделанной работыединого веб-обработчика запросов.\r\nКлючевые слова: веб-технологии, геоинформационная система, информационная безопасность.\r\nНа современном этапе комплексной информатизации производства многие российские промышленные предприятия используют такой подход к автоматизации, при котором основными задачами, требующими внедрения компьютерных технологий, являются"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-web-tehnologiy-v-obrazovatelnyh-informatsionnyh-sistemah",
        "name": "ПРИМЕНЕНИЕ WEB ТЕХНОЛОГИЙ В ОБРАЗОВАТЕЛЬНЫХ ИНФОРМАЦИОННЫХ СИСТЕМАХ",
        "author": "Якунина Ирина Владимировна",
        "year": "2020",
        "branch": "StudNet",
        "description": "﻿ПРИМЕНЕНИЕ WEB ТЕХНОЛОГИЙ В ОБРАЗОВАТЕЛЬНЫХ ИНФОРМАЦИОННЫХ СИСТЕМАХ\r\nAPPLICATION OF WEB TECHNOLOGIES IN EDUCATIONAL INFORMATION SYSTEMS\r\nУДК 004\r\nЯкунина Ирина Владимировна, магистрант\r\nМИРЭА - Российский технологический университет, г. Москва\r\nYakunina Irina Vladimirovna, undergraduate, MIREA - Russian Technological\r\nUniversity, Moscow, mirina7895@mailновые возможности средств массовой коммуникации. В статье рассматривается роль современных информационных технологий в организации учебного процесса образовательных организаций. Рассматривается комплекс проблем, связанных с использованием Web технологий в образовательном пространстве. Определены требования к образовательному Web-ресурсу.\r\nS u m m a r y\r"
    },
    {
        "link": "https://cyberleninka.ru//article/n/voprosy-integratsii-informatsionno-kommunikatsionnyh-tehnologiy-v-praktiko-orientirovannoe-obuchenie-cherez-veb-tehnologii",
        "name": "Вопросы интеграции информационно-коммуникационных технологий в практико-ориентированное обучение через веб-технологии дистанционного образования (на примере веб-платформы обучения предпринимательству в ННГУ iGeneration)",
        "author": "Вылегжанина Надежда Владимировна",
        "year": "2016",
        "branch": "International scientific review",
        "description": "iGeneration for entrepreneurship learning) Vylegzhanina N. (Russian Federation) Вопросы интеграции информационно-коммуникационных технологий в практико-ориентированное обучение через веб-технологии дистанционного образования (на примере веб-платформы обучения предпринимательству в ННГУ iGeneration) Вылегжанина Н. В. (Российская Федерация)\r\nВылегжанина НадеждаНижегородский государственный университет им. Н. И. Лобачевского, г. Нижний Новгород\r\nАннотация: в статье анализируются новые технические средства и новые технологии обучения, их интеграция на примере веб-платформы обучения предпринимательству в ННГУ iGeneration.\r\nAbstract: new technical means, new learning technologies and their integration are analyzed"
    },
    {
        "link": "https://cyberleninka.ru//article/n/issledovanie-ustoychivosti-anonimnoy-seti-na-osnove-tehnologiy-veb-proksi",
        "name": "Исследование устойчивости анонимной сети на основе технологий веб-прокси",
        "author": "Маркин Дмитрий Олегович, Архипов Павел Андреевич, Галкин Алексей Сергеевич",
        "year": "2016",
        "branch": "Вопросы кибербезопасности",
        "description": "﻿■ ИССЛЕДОВАНИЕ УСТОЙЧИВОСТИ АНОНИМНОЙ СЕТИ НА ОСНОВЕ ТЕХНОЛОГИЙ ВЕБ-ПРОКСИ\r\nМаркин Д.О., Архипов П.А., Галкин А.С.'\r\nВ статье рассмотрена концепция построения системы анонимного доступа к удаленным ресурсам на базе веб-технологий с использованием языков программирования PHP/Perl. Проведен анализ типов прокси-серверов, на основе которых осуществляетсяприменение технологии веб-прокси-серверов для решения задачи построение анонимной сети. Выделены достоинства и недостатки данной технологии. Описаны принципы использования технологии терминальных программ и активных данных применительно к веб-прокси-серверам. Предложен перечень технических задач, которые могут быть решены при реализации технологии терминальных"
    },
    {
        "link": "https://cyberleninka.ru//article/n/vnedrenie-innovatsiy-v-tehnologicheskie-protsessy-nauchnoy-biblioteki-v-usloviyah-razvivayuscheysya-veb-sredy",
        "name": "Внедрение инноваций в технологические процессы научной библиотеки в условиях развивающейся веб-среды",
        "author": "Редькина Наталья Степановна, Драцкая Марина Евгеньевна",
        "year": "2012",
        "branch": "Библиосфера",
        "description": "﻿Информатика\r\nУДК [025+027.2]:004.738.5 ББК 78.023+78.347.53\r\nВНЕДРЕНИЕ ИННОВАЦИЙ В ТЕХНОЛОГИЧЕСКИЕ ПРОЦЕССЫ НАУЧНОЙ БИБЛИОТЕКИ В УСЛОВИЯХ РАЗВИВАЮЩЕЙСЯ ВЕБ-СРЕДЫ\r\n© Н. С. Редькина*, М. Ю. Драцкая**, 2012\r\nГосударственная публичная научно-техническая библиотека Сибирского отделения Российской академии наук 630200, г. Новосибирск, ул. Восход, 15\r\nИнститутКлючевые слова: библиотечная технология, Интернет, веб-сервисы.\r\nThe issues of improving the basic technological processes in scientific library via modern Internet facilities and services.\r\nKey words: library technology, Internet, web services.\r\nИнтенсивно развиваясь, расширяя свой функциональный потенциал, информационные технологии (ИТ) находят все более"
    },
    {
        "link": "https://cyberleninka.ru//article/n/novatsionnye-podhody-v-distantsionnom-obrazovanii",
        "name": "Новационные подходы в дистанционном образовании",
        "author": "Колдовский Николай Васильевич",
        "year": "2012",
        "branch": "Бизнес Информ",
        "description": "дозволяють в автоматичному режимі записувати відео-матеріали на канал youtube.com.\r\nТаким чином, наше бачення в сучасному підході до дистанційної освіти полягає у створенні веб-порталу, який міститиме курси визначеної структури за напрямками, додатково до курсів тестові завдання, та лабораторні. Крім того, по кожному з курсів обов'язково повинна бути"
    },
    {
        "link": "https://cyberleninka.ru//article/n/using-web-technologies-in-effective-teaching-of-mathematics-at-universities",
        "name": "USING WEB TECHNOLOGIES IN EFFECTIVE TEACHING OF MATHEMATICS AT UNIVERSITIES",
        "author": "Yakubova Umida, Parpieva Nodira, Mirhojaeva Najibakhon",
        "year": "2021",
        "branch": "Бюллетень науки и практики",
        "description": "Intersectoral Institute of Applied Technical Qualifications,\r\nTashkent, Uzbekistan ©Mirhojaeva N., Tashkent State University of Economics, Tashkent, Uzbekistan\r\nИСПОЛЬЗОВАНИЕ ВЕБ-ТЕХНОЛОГИЙ В ЭФФЕКТИВНОМ ОБУЧЕНИИ\r\nМАТЕМАТИКЕ В ВУЗЕ\r\n©Якубова У. Ш., Ташкентский государственный экономический университет,\r\nг. Ташкент, Узбекистан ©Парпиева Н. Т., Белорусско-УзбекскийВ статье рассмотрена роль веб-технологий в эффективном обучении математике в вузе. Выделены преимущества использования веб-квестов. Это исследование направлено на изучение влияния веб-квестов, используемых для достижения студентами запланированных академических результатов, а также на мнение студентов и преподавателей о веб-квестах.\r\nКлючевые слова:"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-orientirovannaya-sistema-podgotovki-tsifrovoy-modeli-reliefa-mestnosti",
        "name": "Веб-ориентированная система подготовки цифровой модели рельефа местности",
        "author": "Елисеева Мария Владимировна, Писарев Андрей Владимирович",
        "year": "2014",
        "branch": "Математическая физика и компьютерное моделирование",
        "description": "﻿© Елисеева М.В., Писарев А.В., 2014\r\nИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ\r\nУДК 004.9 ББК 32.973\r\nВЕБ-ОРИЕНТИРОВАННАЯ СИСТЕМА ПОДГОТОВКИ\r\nО\t_____\t_\t_\t_\t_\t_\t_\r\nцифровой модели рельефа местности 1\r\nЕлисеева Мария Владимировна\r\nАспирант кафедры фундаментальной информатики и оптимального управления Волгоградского государственного университета m.eliseeva.vlg@gmailкомпьютерных экспериментов. В основе цифрового рельефа местности лежат различные данные дистанционного зондирования Земли.\r\nКлючевые слова: геоинформационные технологии, дистанционное зондирование, веб-технологии, SRTM, цифровая модель рельефа.\r\nВведение\r\nСуществует широкий класс пространственных задач, связанных с рельефом местности (моделирование паводков,"
    },
    {
        "link": "https://cyberleninka.ru//article/n/didakticheskiy-potentsial-tehnologii-veb-kvest-v-formirovanii-inoyazychnoy-kommunikativnoy-kompetentsii-studentov-neyazykovyh",
        "name": "Дидактический потенциал технологии веб-квест в формировании иноязычной коммуникативной компетенции студентов неязыковых факультетов туристского профиля",
        "author": "Шульгина Елена Модестовна, Бовтенко Марина Анатольевна",
        "year": "2013",
        "branch": "Язык и культура",
        "description": "﻿дидактический потенциал технологии ВЕБ-КВЕСТ в формировании иноязычной коммуникативной компетенции студентов неязыковых факультетов туристского профиля\r\nЕ.М. шульгина, М.А. Бовтенко\r\nАннотация. Рассматривается вопрос формирования иноязычной коммуникативной компетенции студентов неязыкового вуза с помощью технологии веб-квест. Освещены актуальностьактуальность проблемы и пригодность применения данной технологии для формирования умений студентов коллективно решать профессионально значимые задачи с использованием иностранного языка.\r\nКлючевые слова: иноязычная коммуникативная компетенция; технология веб-квест; дидактический потенциал; апробирование технологии веб-квест.\r\nВ последние десятилетия в связи с глобальным"
    },
    {
        "link": "https://cyberleninka.ru//article/n/avtomatizirovannyy-analiz-nevozmuschennogo-geomagnitnogo-polya-na-osnove-tehnologii-kartograficheskih-veb-servisov",
        "name": "Автоматизированный анализ невозмущенного геомагнитного поля на основе технологии картографических веб-сервисов",
        "author": "Воробьев А. В., Шакирова Г. Р.",
        "year": "2013",
        "branch": "Вестник Уфимского государственного авиационного технического университета",
        "description": "﻿Уфа : УГАТУ, 2013\r\nЪыьмт QjrAQnQj\r\nТ. 17, № 5 (58). С. 177-187\r\nУДК 004.65\r\nАвтоматизированный анализ невозмущенного геомагнитного поля\r\nна основе технологии картографических веб-сервисов\r\n1 2 А. В. Воробьев , Г. Р. Шакирова\r\n1 cpu8bit@yandex.ru, 2 gulya_shakirova@mail.ru ФГБОУ ВПО «Уфимский государственный авиационный технический университет» (УГАТУ)\rавтоматическом режиме. Рассматривается реализация предложенной математической и методической базы на веб-платформе с помощью языка программирования JavaScript.\r\nКлючевые слова: геомагнитное поле; геомагнитный диполь; геомагнитосфера; веб-технологии.\r\nВВЕДЕНИЕ\r\nНа сегодняшний день задача оперативного определения и регистрации параметров невозмущенного"
    },
    {
        "link": "https://cyberleninka.ru//article/n/aktualnye-problemy-sovremennoy-veb-tipografiki-vzglyad-v-buduschee",
        "name": "Актуальные проблемы современной веб-типографики: взгляд в будущее",
        "author": "Беляев А.А.",
        "year": "2010",
        "branch": "Вестник Московского университета. Серия 10. Журналистика",
        "description": "sashabe@rambler.ru\r\nАКТУАЛЬНЫЕ ПРОБЛЕМЫ СОВРЕМЕННОЙ\r\nВЕБ-ТИПОГРАФИКИ: ВЗГЛЯД В БУДУЩЕЕ\r\nСтатья посвящена актуальным проблемам типографики в веб-дизайне. Автор подробно останавливается на использовании шрифтов во Всемирной сети Интернет, способах их внедрения в веб-страницу. Рассматривается роль веб-стандартов в реализации типографических правил оформленияоформления текста. Делается вывод о значении технологий в веб-типографике и том пути, который ей еще предстоит пройти.\r\nКлючевые слова: типографика, веб-дизайн, шрифт, веб-стандарты, веб-технологии, CSS.\r\nThe article is devoted to the actual problems of typographics in web design. The author extensively covers the using of fonts on the Net, methods of their"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razrabotka-bezopasnoy-zdoroviesberegayuschey-lingvoinformatsionnoy-sredy-podgotovki-buduschego-uchitelya-v-vide-veb-portala-na-osnove",
        "name": "Разработка безопасной здоровьесберегающей лингвоинформационной среды подготовки будущего учителя в виде веб-портала на основе технологий веб 2. 0-3. 0",
        "author": "Крузе Борис Александрович",
        "year": "2013",
        "branch": "Вестник Пермского государственного гуманитарно-педагогического университета. Серия № 1. Психологические и педагогические науки",
        "description": "﻿3. СОВРЕМЕННЫЕ ТЕХНОЛОГИИ ПОДГОТОВКИ ПЕДАГОГИЧЕСКИХ КАДРОВ\r\nУДК 371.134\r\nБ.А. Крузе\r\nПермский государственный гуманитарно-педагогический университет, г. Пермь\r\nРАЗРАБОТКА БЕЗОПАСНОЙ ЗДОРОВЬЕСБЕРЕГАЮЩЕЙ ЛИНГВОИНФОРМАЦИОННОЙ СРЕДЫ ПОДГОТОВКИ БУДУЩЕГО УЧИТЕЛЯ В ВИДЕ ВЕБ-ПОРТАЛА НА ОСНОВЕ ТЕХНОЛОГИЙ ВЕБ 2.0-3.0*\r\nB.A. Kruse\r\nPerm State Humanitarian Pedagogicalявился анализ здоровьесберегающих образовательных технологий, в результате которого и была построена лингвоинформационная платформа в логике требований компетентностного подхода к высшему профессиональному образованию.\r\nКлючевые\tслова:\tздоровьесберегающие\tтехнологии,\r\nлингвоинформационные технологии, веб-платформа, компетентностный подход, лингвоинформационная"
    },
    {
        "link": "https://cyberleninka.ru//article/n/o-veberizatsii-gosudarstvennogo-upravleniya",
        "name": "О веберизации государственного управления",
        "author": "Ганчеренок Игорь Иванович",
        "year": "2012",
        "branch": "Вестник Московского университета. Серия 21. Управление (государство и общество)",
        "description": "в государственном управлении, гармонизирующие устойчивое развитие современного национального государства и общества.\r\nКлючевые слова: государственное управление, Вебер, веб-технологии, диалектика, синергетика.\r\nDevelopment of public administration is presented as a synergetic process. Variant and invariants components, which are correlated with innovationsиерархической организационной структурой управления, включая и государственный уровень. С другой стороны, каждый школьник знает о возможностях Интернета и соответственно о веб-технологиях, подразумевающих развитие «сетевых» неиерархических подходов в управлении. Таким образом, с одной стороны, налицо совпадение в лингвистическом плане (или закодированная"
    },
    {
        "link": "https://cyberleninka.ru//article/n/kombinirovannyy-metod-vizualizatsii-kartograficheskih-dannyh-veb-orientirovannoy-geoinformatsionnoy-sistemy",
        "name": "Комбинированный метод визуализации картографических данных веб-ориентированной геоинформационной системы",
        "author": "Милихин Михайил Михайлович, Гриценко Юрий Борисович, Рычагов Михаил Михайлович",
        "year": "2015",
        "branch": "Доклады Томского государственного университета систем управления и радиоэлектроники",
        "description": "визуализации картографических данных веб-ориентированной геоинформационной системы\r\nРассмотрены методы визуализации геоданных, использующиеся при разработке веб-ориентированных геоинформационных систем. Разработан комбинированный метод визуализации картографических данных, применение которого позволит построить новую архитектуру веб-ориентированной ГИС, обладающейобладающей возможностями десктопных ГИС.\r\nКлючевые слова: веб-технологии, геоинформационная система, методы визуализации данных.\r\nНа сегодняшний день геоинформационные системы (ГИС) являются неотъемлемой частью общественной жизни. ГИС используются для решения все большего числа задач, таких как навигация и определение местоположения в пространстве, обеспечение"
    },
    {
        "link": "https://cyberleninka.ru//article/n/arhitektura-raspredelennyh-servis-orientirovannyh-sistem-avtomatizirovannogo-proektirovaniya",
        "name": "Архитектура распределенных сервис-ориентированных систем автоматизированного проектирования",
        "author": "Гридин Владимир Николаевич, Дмитревич Геннадий Даниилович, Анисимов Денис Андреевич",
        "year": "2014",
        "branch": "Известия Южного федерального университета. Технические науки",
        "description": "СЕРВИС-ОРИЕНТИРОВАННЫХ СИСТЕМ АВТОМАТИЗИРОВАННОГО ПРОЕКТИРОВАНИЯ\r\nАктуальной проблемой в области информационных технологий является децентрализация архитектуры САПР путем перехода к распределенным системам проектирования, построенным на основе Интернет-технологий, реализующих задачи коммуникации и информационного обмена между приложениями. Такие независимо управляемыеуправляемые приложения являются автономными и могут взаимодействовать друг с другом в процессе выполнения общей задачи. Протоколы Интернет-технологий представляют надежную базу для связывания подсистем и не требуют согласованного использования ресурсов, находящихся в разных узлах сети, что существенно упрощает процесс построения и эксплуатации распределенной"
    },
    {
        "link": "https://cyberleninka.ru//article/n/sozdanie-sistemy-razgranicheniya-dostupa-i-izolyatsii-smezhnyh-dochernih-protsessov-http-servera-apache-s-modulem-preventivnoy-zaschity",
        "name": "Создание системы разграничения доступа и изоляции смежных дочерних процессов http сервера Apache с модулем превентивной защиты",
        "author": "Бондарев А. А., Чернышов А. К.",
        "year": "2008",
        "branch": "Известия Южного федерального университета. Технические науки",
        "description": "﻿21.\tТрофимов С. CASE-технологии: практическая работа в Rational Rose. - М.: Бином,\r\n2002.\r\n22.\tРубцов С. Сравнительный анализ известных инструментов организационного проектирования. - http://www.vemikov.ru/content/view/461/126/.\r\nУДК 004.056.53\r\nА.А. Бондарев, А.К. Чернышов\r\nСОЗДАНИЕ СИСТЕМЫ РАЗГРАНИЧЕНИЯ ДОСТУПА И ИЗОЛЯЦИИ\r\nСМЕЖНЫХ ДОЧЕРНИХ ПРОЦЕССОВприроды (биржевой рынок, Интернет-магазины и т.д.).\r\nИспользование сетевых технологий даёт значительное преимущество в сравнении с более традиционными методами распространения информации. Единственной глобальной сетью, являющей собой глобальное информационное пространство, является веб.\r\nБезусловно, самыми распространенными являются интерфейсы, работающие"
    },
    {
        "link": "https://cyberleninka.ru//article/n/podderzhka-brauzerami-tehnologiy-html5-i-css3",
        "name": "Поддержка браузерами технологий HTML5 и CSS3",
        "author": "Новожилов Андрей Вячеславович, Акулов Геннадий Сергеевич",
        "year": "2014",
        "branch": "Вестник российских университетов. Математика",
        "description": "﻿УДК 004.442\r\nПОДДЕРЖКА БРАУЗЕРАМИ ТЕХНОЛОГИЙ HTML5 И CSS3\r\n© А.В. Новожилов, Г.С. Акулов\r\nКлючевые слова: HTML5; CSS3; стандарты; технологии веб-программирования.\r\nИсследованы вопросы перехода на новые технологии веб-программирования HTML5 и CSS3, которые упрощают процесс создания интерактивных веб-сайтов за счет внедрения новых элементов и атрибутовподдержки браузерами указанных технологий, выявлено, что не все браузеры на данный момент в полной мере поддерживают HTML5 и CSS3. Рассмотрены такие браузеры, как Google Chrome, Opera, Safari, Firefox, Internet Explorer.\r\nВ течение последних лет в сети Интернет наблюдается бум развития и популяризации интерактивных веб-сайтов [1]. Серьезным шагом в этом"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-tehnologiy-veb-2-0-dlya-podgotovki-kadrov-v-finansovo-nalogovoy-sfere",
        "name": "Применение технологий Веб 2. 0 для подготовки кадров в финансово-налоговой сфере",
        "author": "Евстигнеев Евгений Николаевич, Викторова Наталья Геннадьевна",
        "year": "2016",
        "branch": "Управленец",
        "description": "297-96-03 E-mail: viknata@mail.ru\r\nКлючевые слова\r\nКАДРЫ\r\nФИНАНСОВО-НАЛОГОВАЯ ДЕЯТЕЛЬНОСТЬ\r\nСЛОЖНАЯ СИСТЕМА\r\nКОНЦЕПЦИЯ ВЕБ 2.0\r\nМАССОВЫЕ ОТКРЫТЫЕ ОНЛАЙН-КУРСЫ\r\nВЕБ-СЕРВИС\r\nПЕРСОНАЛЬНАЯ ОБРАЗОВАТЕЛЬНАЯ СФЕРА\r\nПрименение технологий Веб 2.0 для подготовки кадров в финансово-налоговой сфере\r\n^ ЕВСТИГНЕЕВ Евгений Николаевич\r\nКандидат экономических наук, профессоргромадны, однако недостаточно осмыслены, а современные технологии часто используются в учебном процессе самопроизвольно по усмотрению педагога. Необходим комплексный подход к реализации огромного потенциала Глобальной сети, но в первую очередь к пониманию сущности и формам проявления феномена Веб 2.0. Для решения проблемы предложена модель, с помощью"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-gns-i-veb-tehnologiy-dlya-sozdaniya-integrirovannyh-informatsionno-analiticheskih-sistem",
        "name": "Применение ГНС- и веб-технологий для создания интегрированных информационно-аналитических систем",
        "author": "Бычков И. В., Гаченко А. С., Попова А. К., Ружников Г. М., Фереферов Е. С., и др.",
        "year": "2007",
        "branch": "Вычислительные технологии",
        "description": "﻿Вычислительные технологии\r\nТом 12, Специальный выпуск 3, 2007\r\nПРИМЕНЕНИЕ Г И С- И ВЕБ-ТЕХПОЛОГИЙ ДЛЯ СОЗДАНИЯ ИНТЕГРИРОВАННЫХ ИНФОРМАЦИОННОЕ I АЛИТИЧЕСКИХ\r\nСИСТЕМ\r\nИ. В. Бычков, А. С. Гаченко, А. К. Попова, Г. М. Ружников, Е. С. Фереферов, А.Е. Хмельнов Институт динамики систем и теории управления СО РАН,\r\nИркутск, Россия e-mail: bychkov@icc.ru, gachenko@iccиспользования ГИС-технологий и высокоскоростных каналов связи для цифровой интеграции физически разделенных, но тематически согласованных баз геопространственных данных. Специфика формирования геоинформационных ресурсов усилила актуальность создания проблемно-ориентированных программных средств, интегрирующих универсальные сетевые технологии с ГИС-техно-логиями"
    },
    {
        "link": "https://cyberleninka.ru//article/n/oblachnaya-veb-tehnologiya-provedeniya-konkursnyh-protsedur-otsenki-kachestva-obrazovatelnyh-resursov",
        "name": "Облачная веб-технология проведения конкурсных процедур оценки качества образовательных ресурсов",
        "author": "Киргизова Елена Викторовна, Нарчуганов Кирилл Николаевич, Пак Николай Инсебович, Хегай Людмила Борисовна",
        "year": "2019",
        "branch": "Вестник Российского университета дружбы народов. Серия: Информатизация образования",
        "description": "Education\t2019 Vol. 16 No. 1 35—45\r\nВестник РУДН. Серия: Информатизация образования\trtW^m^.m^.rn^fon^ i zat юп-^ юп\r\nDOI 10.22363/2312-8631-2019-16-1-35-45 УДК 377\r\nОблачная веб-технология проведения конкурсных процедур оценки качества образовательных ресурсов\r\nЕ.В. Киргизова1, К.Н. Нарчуганов2, Н.И. Пак3, Л.Б. Хегай3\r\n1 Лесосибирский педагогический институтпроцедуры и не пригодны к использованию в других целях, другими организаторами.\r\nКонцепция облачной веб-технологии организации сбора, накопления и проведения оценочных процедур качества образовательных ресурсов опирается на проективно-рекурсивную технологию создания сложных интеллектуальных систем [1]. Для оценки конкурсных и отчетных мероприятий используется"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-gis-i-veb-tehnologiy-dlya-sozdaniya-integrirovannyh-informatsionno-analiticheskih-sistem",
        "name": "Применение ГИС и веб-технологий для создания интегрированных информационно-аналитических систем",
        "author": "Гаченко Андрей Сергеевич, Маджара Тарас Игоревич, Ружников Геннадий Михайлович, Хмельнов Алексей Евгеньевич",
        "year": "2014",
        "branch": "Вестник Бурятского государственного университета. Математика, информатика",
        "description": "﻿А.С. Гаченко, Т.И. Маджара, Г.М. Ружников, А.Е. Хмельнов. Применение ГИС- и веб-технологий для создания интегрированных информационно-аналитических систем\r\nOsipchuk Evgeny Nickolaevich, candidate of engineering sciences, junior researcher, Melentyev Energy Systems Institute, SB RAS, Irkutsk; e-mail: evgeny-osipchuk@yandex.ru\r\nУДК 004.75\r\n© A.C. ГаченкоГаченко, Т.И. Маджара, Г.М. Ружников, А.Е. Хмельнов\r\nПРИМЕНЕНИЕ ГИС- И ВЕБ-ТЕХНОЛОГИЙ ДЛЯ СОЗДАНИЯ ИНТЕГРИРОВАННЫХ ИНФОРМАЦИОННО-АНАЛИТИЧЕСКИХ СИСТЕМ\r\nСтатья посвящена актуальным проблемам разработки региональной информационно-аналитической системы.\r\nКлючевые слова: инфраструктура пространственных данных, базовые пространственные данные, каталоги метаданных"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ontologicheskoe-opisanie-multimediynyh-resursov-v-kontekste-tehnologiy-semanticheskogo-veb",
        "name": "Онтологическое описание мультимедийных ресурсов в контексте технологий семантического веб",
        "author": "Сытник А. А., Вагарина Н. С., Мельникова Н. И.",
        "year": "2011",
        "branch": "Вестник Саратовского государственного технического университета",
        "description": "Н.И. Мельникова ОНТОЛОГИЧЕСКОЕ ОПИСАНИЕ МУЛЬТИМЕДИЙНЫХ РЕСУРСОВ В КОНТЕКСТЕ ТЕХНОЛОГИЙ СЕМАНТИЧЕСКОГО ВЕБ\r\nРассматриваются формальные представления некоторых существующих подходов к описанию моделей метаданных мультимедиа информации в контексте технологий семантического Веб. Рассмотрены примеры мультимедийных онтологий всех трех уровней - верхнего уровняРазработчики различных форматов мультимедиа информации предлагают различные разметки для описания и осуществления поиска медиаинформации по различным критериям. Например, технология MusicDNA использует MPEG-7 и предусматривает наличие у музыкального файла 14 дескрипторов, которые могут хранить атрибуты такого характера, как темп, инструментовка, тональность"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razrabotka-servernoy-chasti-veb-prilozheniy-s-ispolzovaniem-sovremennyh-tehnologiy",
        "name": "Разработка серверной части веб-приложений с использованием современных технологий",
        "author": "Долженко Андрей Николаевич",
        "year": "2018",
        "branch": "Вестник науки и образования",
        "description": "﻿РАЗРАБОТКА СЕРВЕРНОЙ ЧАСТИ ВЕБ-ПРИЛОЖЕНИЙ С ИСПОЛЬЗОВАНИЕМ СОВРЕМЕННЫХ ТЕХНОЛОГИЙ Долженко А.Н. Email: Dolzhenko644@scientifictext.ru\r\nДолженко Андрей Николаевич - студент, кафедра информационных технологий, Государственное бюджетное образовательное учреждение высшего образования Московской области Университет «Дубна», г. Дубна\r\nАннотация: статья посвященасовременных технологий разработки серверной части клиент-серверных веб-приложений. Переход бизнеса сферы услуг из офф-лайн области взаимодействия с клиентами в он-лайн -распространённая тенденция, особенно, если к моменту перехода услуги уже предоставлялись различными цифровыми методами. Дан обзор предметной области, изложенный в разрезе технологий, которые"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-kvest-kak-effektivnaya-tehnologiya-professionalizatsii-buduschih-zhurnalistov",
        "name": "Веб-квест как эффективная технология профессионализации будущих журналистов",
        "author": "Иванищева О.Н.",
        "year": "2019",
        "branch": "Человек. Культура. Образование",
        "description": "﻿УДК 377.131.14; 37.022\r\nО. Н. Иванищева\r\nВеб-квест как эффективная технология профессионализации будущих журналистов\r\nВ статье рассматривается спефицика использования веб-квест технологий в журналистском образовании. Отмечается, что веб-квест, активно применяемый в филологическом образовании, в частности при изучении иностранных языков и русского языкаязыка как иностранного, в методическом плане не отличается от веб-квеста, применяемого в журналистском образовании, но методологически является иным способом активизации способностей студентов и имеет своей целью развитие прежде всего их критического мышления. Указывается, что использование веб-квеста в журналистском образовании не столько и не сколько"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-kvest-tehnologii-v-organizatsii-samostoyatelnoy-raboty-studentov",
        "name": "Использование веб-квест-технологии в организации самостоятельной работы студентов",
        "author": "Хлупина Надежда Олеговна",
        "year": "2016",
        "branch": "Сибирский педагогический журнал",
        "description": "Киселёвский педагогический колледжи, nokhlupina@mail,ru Киселёвск, Кемеровская область\r\nИСПОЛЬЗОВАНИЕ ВЕБ-КВЕСТ-ТЕХНОЛОГИИ В ОРГАНИЗАЦИИ САМОСТОЯТЕЛЬНОЙ РАБОТЫ СТУДЕНТОВ\r\nАннотация. В статье поднимаются проблемы использования информационных и коммуникационных технологий в образовательном процессе. Автор акцентирует внимание на необходимости овладения ИКТ-компетентностямигосударства проводится анализ преимуществ и недостатков организации самостоятельной работы студентов с использованием дистанционной образовательной технологии веб-квеста. Использование веб-квест-технологии позволяет изменить отношение студентов к самостоятельной работе, совершенствовать общие компетенции (осуществлять поиск, анализ и оценку информации"
    },
    {
        "link": "https://cyberleninka.ru//article/n/professionalnaya-podgotovka-veb-dizaynerov-s-ispolzovaniem-distantsionnyh-obrazovatelnyh-tehnologiy",
        "name": "Профессиональная подготовка веб-дизайнеров с использованием дистанционных образовательных технологий",
        "author": "Шишлина Наталья Васильевна",
        "year": "2011",
        "branch": "Знание. Понимание. Умение",
        "description": "﻿Профессиональная подготовка веб-дизайнеров с использованием дистанционных образовательных технологий\r\nН. В. Шишлина\r\n(Ижевский государственный технический университет)*\r\nВ статье предлагается технология формирования профессиональной компетентности веб-дизайнера, которая может быть использована для разработки дистанционных курсов в системе дополнительногодополнительного профессионального образования.\r\nКлючевые слова: дополнительное профессиональное образование, дистанционные образовательные технологии, веб-дизайн.\r\nVocational Training of Web Designers with the Use of Distance Education Technologies\r\nN. V. Shishlina\r\n(Izhevsk State Technical University)\r\nIn the article a technology of web designer’s professional"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-kvest-kak-novaya-obrazovatelnaya-tehnologiya-v-vysshey-shkole",
        "name": "Веб-квест как новая образовательная технология в высшей школе",
        "author": "Шестакова Антонина Юрьевна",
        "year": "2012",
        "branch": "Общество. Коммуникация. Образование",
        "description": "линг-водидактики в контексте современных подходов». Комрат, 24 ноября 2011. - Комрат: Изд-во Комрат. гос. ун-та, 2011. - С. 210-213.\r\nУДК 37:372.8\r\nА.Ю. Шестакова\r\nВЕБ-КВЕСТ КАК НОВАЯ ОБРАЗОВАТЕЛьНАЯ ТЕХНОЛОГИЯ\r\nв высшей ШКОЛЕ\r\nВ настоящее время образовательный процесс в вузах России определяется интеграцией компетентностного, системного подхода с использованиемобразовательных технологий: новые способы организации теоретического и практического материала, интегра-\r\nционные межпредметные программы, методы оценки результата обучения. Педагогические технологии — это «детально (технологически) разработанные методы и организационные формы обучения» [6, с. 112]. Следовательно, данные технологии понимаются как оптимальные"
    },
    {
        "link": "https://cyberleninka.ru//article/n/metodologiya-obucheniya-v-ramkah-kognitivnogo-podhoda-s-ispolzovaniem-veb-2-tehnologiy",
        "name": "Методология обучения в рамках когнитивного подхода с использованием Веб-2 технологий",
        "author": "Блинова Татьяна Леонидовна, Подчиненов Игорь Евгеньевич",
        "year": "2016",
        "branch": "Педагогическое образование в России",
        "description": "Институт математики, информатики и информационных технологий, Уральский государственный педагогический университет; 620075, г. Екатеринбург, ул. К. Либкнехта, 9; e-mail: t.l.blinova@mail.ru.\r\nПодчиненов Игорь Евгеньевич,\r\nкандидат физико-математических наук, профессор кафедры информатики, информационых технологий и методики обучения информатике, Институт математикиматематики, информатики и информационных технологий, Уральский государственный педагогический университет; 620075, г. Екатеринбург, ул. К. Либкнехта, 9; e-mail: igor@uspu.ru.\r\nКЛЮЧЕВЫЕ СЛОВА: методология обучения, система, когнитивизм, сетевые технологии, коннекти-визм, модель субъекта обучения, технология Веб-2.0.\r\nАННОТАЦИЯ. В работе ставится вопрос"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-kvest-kak-innovatsionnaya-tehnologiya-v-sisteme-realizatsii-fgos",
        "name": "Веб-квест - как инновационная технология в системе реализации ФГОС",
        "author": "Щербина А.Н.",
        "year": "2016",
        "branch": "Наука и перспективы",
        "description": "МБОУ СОШ №4, г. Нижний Тагил, Россия\r\nВЕБ-КВЕСТ - КАК ИННОВАЦИОННАЯ ТЕХНОЛОГИЯ В СИСТЕМЕ РЕАЛИЗАЦИИ ФГОС\r\nАннотация\r\nВ статье раскрывается суть новой инновационной технологии - веб-квеста и особенностей ее реализации в условиях ФГОС. Кроме того, рассматривается веб-конструктор Wix, как эффективное средство создания веб-квеста и приводится пример созданногосозданного с помощью этого конструктора веб-квеста по информатике.\r\nКлючевые слова: веб-квест, инновационные образовательные технологии, самостоятельная работа учащихся, поиск информации, цифровой образовательный ресурс.\r\nShcherbina A. N.,\r\nschool №4, Nizhny Tagil, Russia\r\nTHE WEB QUEST AS AN INNOVATIVE TECHNOLOGY IN THE SYSTEM OF IMPLEMENTATION OF THE FSES\r"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ob-effektivnom-ispolzovanii-sovremennyh-tehnologiy-sozdaniya-interaktivnyh-veb-dokumentov-1",
        "name": "Об эффективном использовании современных технологий создания интерактивных веб-документов",
        "author": "Одинокая Мария Александровна",
        "year": "2017",
        "branch": "Интерактивная наука",
        "description": "использовании современных технологий создания интерактивных веб-документов\r\nАннотация\r\nВ статье анализируются вопросы, связанные с технологиями использования интерактивных веб-документов, таких как canvas, CSS, SVG, WebGL, WebSocket. Рассмотрены их возможности и области применения для создания различных видов интерактивных веб-документов.\r\nI КлючевыеКлючевые слова: web-приложение, веб-документ, разработка, HTML5, svg, canvas, CSS, WebGL, интерактивность, графика.\r\nM.A. Odinokaya\r\nAbout the effective usage of modern technologies of the creation of interactive web-documents\r\nAbstract\r\nThe article focuses on the issues on usage of such interactive web-documents as canvas, CSS, SVG, WebGL, WebSocket. Special"
    },
    {
        "link": "https://cyberleninka.ru//article/n/motivatsiya-poznavatelnoy-deyatelnosti-studentov-posredstvom-tehnologii-veb-kvest",
        "name": "Мотивация познавательной деятельности студентов посредством технологии веб-квест",
        "author": "Шульгина Елена Модестовна",
        "year": "2016",
        "branch": "Вестник Тамбовского университета. Серия: Гуманитарные науки",
        "description": "﻿УДК 378.147\r\nМОТИВАЦИЯ ПОЗНАВАТЕЛЬНОЙ ДЕЯТЕЛЬНОСТИ СТУДЕНТОВ ПОСРЕДСТВОМ ТЕХНОЛОГИИ ВЕБ-КВЕСТ\r\n© Елена Модестовна ШУЛЬГИНА\r\nНациональный исследовательский Томский государственный университет, г. Томск, Российская Федерация, кандидат педагогических наук, доцент кафедры естественнонаучных и физико-математических факультетов, e-mail: modestovna2@gmailпрофессиональные задачи в соответствующей области деятельности. Используя ряд педагогических инноваций, основанных на методологии проблемного и личностно-ориентированного методов, технология веб-квест является одним из наиболее эффективных педагогических средств при развитии иноязычной коммуникативной компетенции обучающихся. Ее дидактический потенциал способствует"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-novyh-vozmozhnostey-tehnologii-html5-po-sozdaniyu-veb-prilozheniy",
        "name": "Анализ новых возможностей технологии html5 по созданию веб-приложений",
        "author": "Свентицкий П.И.",
        "year": "2014",
        "branch": "Фундаментальные и прикладные исследования: проблемы и результаты",
        "description": "53-54.\r\nАНАЛИЗ НОВЫХ ВОЗМОЖНОСТЕЙ технологии HTML5 ПО СОЗДАНИЮ ВЕБ-ПРИЛОЖЕНИЙ\r\n© Свентицкий П.И.*\r\nБрянский государственный университет имени академика И.Г. Петровского, г. Брянск\r\nВ статье проводится анализ основных возможностей технологии HTML5 по созданию веб-приложений.\r\nКлючевые слова: HTML5, веб-приложение, технология, сайт, разработка.\r\nСегодня Интернетпрограммной (веб-сервисы, веб-приложения, а также технологии по их созданию и разработки). Поэтому технологии создания веб-приложений играют важную роль в развитии всей глобальной сети.\r\nМагистрант (направление «Прикладные Интернет-технологии»).\r\n148\r\nФУНДАМЕНТАЛЬНЫЕ И ПРИКЛАДНЫЕ ИССЛЕДОВАНИЯ\r\nПо мере развития сети технологии создания веб-приложений постоянно"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ob-effektivnom-ispolzovanii-sovremennyh-tehnologiy-sozdaniya-interaktivnyh-veb-dokumentov",
        "name": "Об эффективном использовании современных технологий создания интерактивных веб-документов",
        "author": "Егорова И. Н., Трофименко А. С.",
        "year": "2014",
        "branch": "ScienceRise",
        "description": "ЭФФЕКТИВНОМ ИСПОЛЬЗОВАНИИ СОВРЕМЕННЫХ ТЕХНОЛОГИЙ СОЗДАНИЯ ИНТЕРАКТИВНЫХ ВЕБ-ДОКУМЕНТОВ\r\n© И. Н. Егорова, А. С. Трофименко\r\nСтатья посвящена исследованию наиболее востребованных современных технологий разработки вебдокументов, таких как: API Canvas, WebGL, SVG и CSS3. Рассмотрены достоинства и недостатки каждой из технологий в визуальном представлении информации:графике. Проведен анализ областей их применения, разработаны рекомендации по наиболее эффективному их использованию для разработки интерактивных WEB-документов\r\nКлючевые слова: веб-документ, интернет, интерактивность, разработка, спецификация, HTML5, SVG, векторная графика, WebGL\r\n73\r\nТехнічні науки\r\nScientific Journal «ScienceRise» №5/2(4)2014\r\nThis article"
    },
    {
        "link": "https://cyberleninka.ru//article/n/model-effektivnosti-tehnologii-e-marketinga-na-primere-veb-studii-it-sfera",
        "name": "МОДЕЛЬ ЭФФЕКТИВНОСТИ ТЕХНОЛОГИИ Е-МАРКЕТИНГА НА ПРИМЕРЕ ВЕБ-СТУДИИ \"ИТ-СФЕРА\"",
        "author": "Назаров А.Д.",
        "year": "2019",
        "branch": "Вестник Академии знаний",
        "description": "Economics.\r\nМОДЕЛЬ ЭФФЕКТИВНОСТИ ТЕХНОЛОГИИ Е-МАРКЕТИНГА НА ПРИМЕРЕ ВЕБ-СТУДИИ «ИТ-СФЕРА» MODEL OF THE EFFECTIVENESS OF E-MARKETING TECHNOLOGY ON THE EXAMPLE OF THE WEB-STUDIO \"IT-SPHERE\"\r\nАннотация. В период трансформации цифровой экономики неотъемлемой частью любых коммерческих услуг становится не только наличие веб-сайта, но и эффективное его оптимизацияоптимизация и продвижение с помощью инструментов веб-аналитики и интернет-маркетинга. Сейчас, когда информационный поиск вышел на новый уровень и большинство веб-сайтов выглядит современными, необходимо постоянно обновлять веб-сайт и поддерживать актуальной информацию, а также делать сайт удобным и полезным. Однако, возникает вопрос, каким образом можно"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-kvest-tehnologii-v-podgotovke-buduschego-uchitelya-matematiki",
        "name": "Использование веб-квест технологии в подготовке будущего учителя математики",
        "author": "Владыкина И.В.",
        "year": "2014",
        "branch": "Обучение и воспитание: методики и практика",
        "description": "﻿ИСПОЛЬЗОВАНИЕ ВЕБ-КВЕСТ ТЕХНОЛОГИИ В ПОДГОТОВКЕ БУДУЩЕГО УЧИТЕЛЯ МАТЕМАТИКИ\r\n© Владыкина И.В.*\r\nГлазовский государственный педагогический институт им. В.Г. Короленко,\r\nг. Глазов\r\nВ статье рассказывается об использовании веб-квест технологии как одной из форм исследовательской деятельности при обучении будущих учителей математики.\r\nКлючевые слова: информатизацияинформатизация образования, веб-квест технология, обучение.\r\nРабота выполнена в рамках программы научных исследований Российского гуманитарного научного фонда, проект 14-16-18002 «Web-квест технологии как средство формирования поликультурной компетентности учащихся основной школы при обучении математике».\r\nИнформатизация современного общества предполагает"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razrabotka-klientskoy-chasti-veb-prilozheniya-s-ispolzovaniem-tehnologiy-spa",
        "name": "РАЗРАБОТКА КЛИЕНТСКОЙ ЧАСТИ ВЕБ-ПРИЛОЖЕНИЯ С ИСПОЛЬЗОВАНИЕМ ТЕХНОЛОГИЙ SPA",
        "author": "Газизуллин Нафис Инсафович, Плещинская Ирина Евгеньевна",
        "year": "2020",
        "branch": "StudNet",
        "description": "﻿РАЗРАБОТКА КЛИЕНТСКОЙ ЧАСТИ ВЕБ-ПРИЛОЖЕНИЯ С ИСПОЛЬЗОВАНИЕМ ТЕХНОЛОГИЙ SPA\r\nDEVELOPMENT OF THE CLIENT SIDE OF A WEB APPLICATION USING\r\nSPA TECHNOLOGIES\r\nУДК-004\r\nГазизуллин Нафис Инсафович, студент Казанского национального исследовательского технологического университета, Россия, г. Казань Плещинская Ирина Евгеньевна, к.ф.-м.н., доцент Казанского национальногоru Pleshchinskaya Irina Evgen'evna\r\nАННОТАЦИЯ\r\nСтатья посвящена разработке клиентской части веб-приложения с помощью технологии SPA (Single Page Application). Приведена краткая информация о двух крупнейших компаниях, Google и Facebook, предоставляющих технологии в области SPA. Рассмотрены программные продукты данных компаний, перечислены основные преимущества"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-prilozhenie-dlya-turistov-s-polzovatelskim-kontentom-tehnologii-razrabotki",
        "name": "ВЕБ-ПРИЛОЖЕНИЕ ДЛЯ ТУРИСТОВ С ПОЛЬЗОВАТЕЛЬСКИМ КОНТЕНТОМ: ТЕХНОЛОГИИ РАЗРАБОТКИ",
        "author": "Васева Е.С., Шутько А.В.",
        "year": "2019",
        "branch": "Наука и перспективы",
        "description": "Нижний Тагил, Россия\r\nВЕБ-ПРИЛОЖЕНИЕ ДЛЯ ТУРИСТОВ С ПОЛЬЗОВАТЕЛЬСКИМ КОНТЕНТОМ: ТЕХНОЛОГИИ РАЗРАБОТКИ\r\nАннотация\r\nВ статье рассматриваются технологии разработки веб-приложения для туристов, с помощью которого можно делиться отзывами о посещенных местах, находить себе единомышленников и выбирать туристические маршруты по критериям. Веб-приложение было созданореляционной системы управления базами данных MySQL. Приводится структура базы данных, показаны основные листинги форм веб-интерфейса и обрабатывающие данные скрипты.\r\nКлючевые слова: веб-приложение с пользовательским контентом, база данных, веб-интерфейс, листинг.\r\nVaseva E.S.\r\nPh. D., associate Professor of the Department of it Rgppu branch in Nizhny Tagil"
    },
    {
        "link": "https://cyberleninka.ru//article/n/preimuschestva-ispolzovaniya-tehnologii-veb-kvest-na-uroke-inostrannogo-yazyka",
        "name": "ПРЕИМУЩЕСТВА ИСПОЛЬЗОВАНИЯ ТЕХНОЛОГИИ ВЕБ-КВЕСТ НА УРОКЕ ИНОСТРАННОГО ЯЗЫКА",
        "author": "Павлюкевич Любовь Владиславовна, Батыкова Анна Сергеевна",
        "year": "2019",
        "branch": "Проблемы романо-германской филологии, педагогики и методики преподавания иностранных языков",
        "description": "﻿ПРЕИМУЩЕСТВА ИСПОЛЬЗОВАНИЯ ТЕХНОЛОГИИ ВЕБ-КВЕСТ НА УРОКЕ ИНОСТРАННОГО ЯЗЫКА\r\nПавлюкевич Любовь Владиславовна к.п.н., доцент кафедры английского языка, филологии и перевода Пермский государственный гуманитарно-педагогический университет, г. Пермь\r\nE-mail: pavlovely@yandex. ru\r\nБатыкова Анна Сергеевна\r\nстудентка 741/2 гр. факультета иностранных языковчастности технология Веб-квест как вид проектной деятельности.\r\nПриводится краткая история данной технологии, раскрыта ее сущность и проанализированы преимущества ее использования на уроке иностранного языка, среди которых высокая мотивационная обеспеченность, использование ИКТ, развитие самостоятельности учащихся и др.\r\nКлючевые слова: Веб-квест, мотивация"
    },
    {
        "link": "https://cyberleninka.ru//article/n/prodvinutoe-keshirovanie-i-optimizatsiya-veb-prilozheniy-s-pomoschyu-tehnologii-swr",
        "name": "ПРОДВИНУТОЕ КЕШИРОВАНИЕ И ОПТИМИЗАЦИЯ ВЕБ-ПРИЛОЖЕНИЙ С ПОМОЩЬЮ ТЕХНОЛОГИИ SWR",
        "author": "Князев И.В.",
        "year": "2021",
        "branch": "Sciences of Europe",
        "description": "﻿ПРОДВИНУТОЕ КЕШИРОВАНИЕ И ОПТИМИЗАЦИЯ ВЕБ-ПРИЛОЖЕНИЙ С ПОМОЩЬЮ\r\nТЕХНОЛОГИИ SWR\r\nКнязев И.В.\r\nСтарший разработчик программного обеспечения в June Homes\r\nБелгород, Россия\r\nTHE ADVANCED WEB APPLICATIONS CACHING AND OPTIMIZATION USING SWR\r\nKniazev I.\r\nSenior Software Developer at June Homes Belgorod, Russia\r\nАННОТАЦИЯ\r\nThe article analyzes the advancedметодики для хеширования запросов данных и оптимизации веб-приложений, а также практические примеры для веб-приложений, написанных на таких технологиях как React.JS и NextJS.\r\nКлючевые слова: swr, javascript, reactjs, nextjs.\r\nKeywords: swr, javascript, reactjs, nextjs.\r\nКеширование данных и оптимизация веб-приложений являются самыми актуальными темами последних"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-veb-kvesta-v-obuchenii-inostrannym-yazykam-sovremennyy-etap",
        "name": "ТЕХНОЛОГИЯ ВЕБ-КВЕСТА В ОБУЧЕНИИ ИНОСТРАННЫМ ЯЗЫКАМ: СОВРЕМЕННЫЙ ЭТАП",
        "author": "Агеенко Наталья Владимировна, Старцева Наталья Валерьевна",
        "year": "2020",
        "branch": "Проблемы современного педагогического образования",
        "description": "образовательных технологий для повышения эффективности учебного процесса. Отмечается, что использование инновационных компьютерных технологий является не только средством получения знаний, но и средством формирования профессиональных компетенций на современном этапе. Выделен ряд современных методик обучения иностранному языку и подробно описаны задачи веб-технологическоговеб-технологического квеста. Авторы приходят к выводу о целесообразности использования веб-квестов как одной из разновидностей инновационных технологий в образовательном процессе, эффективность которых подтверждается растущей познавательной активностью студентов, возможностью индивидуализации учебного процесса, повышением уровня социализации будущих специалистов"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-sovremennyh-informatsionnyh-tehnologiy-v-sisteme-nepreryvnogo-obrazovaniya",
        "name": "Использование современных информационных технологий в системе непрерывного образования",
        "author": "Ниматулаев Магомедхан Магомедович, Магомедов Рамазан Магомедович",
        "year": "2012",
        "branch": "Вестник Российского университета дружбы народов. Серия: Информатизация образования",
        "description": "﻿ИСПОЛЬЗОВАНИЕ СОВРЕМЕННЫХ ИНФОРМАЦИОННЫХ ТЕХНОЛОГИЙ В СИСТЕМЕ НЕПРЕРЫВНОГО ОБРАЗОВАНИЯ\r\nМ.М. Ниматулаев, Р.М. Магомедов\r\nКафедра информатики и программирования Финансовый университет при Правительстве Российской Федерации Ленинградский просп., 49, Москва, Россия, 125993\r\nВ статье раскрываются проблемы формирования системы непрерывного образования иэффективной реализации профессиональной деятельности педагога в условиях использования современных информационных технологий. Рассматриваются возможность и необходимость использования информационно-коммуникационных технологий, веб-технологий для интенсификации и придания дополнительной динамики образовательному процессу. В связи с этим определяются новые"
    }
]