[
    {
        "link": "https://cyberleninka.ru//article/n/mobilnoe-obuchenie-veb-tehnologiyam-i-veb-programmirovaniyu",
        "name": "Мобильное обучение веб-технологиям и веб-программированию",
        "year": "2014",
        "journalName": "Образовательные технологии и общество",
        "author": [
            "Государев Илья Борисович"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Государев Илья Борисович\nВ статье описывается электронный учебно-методический комплекс по обучению веб-технологиям и веб-программированию, включающий онлайн-редактор кода на языках HTML, CSS, Javascript «Кодактор», и развертывание мобильной электронной информационно-образовательной среды на его основе. В статье также предложены варианты интеграции Кодактора с другими решениями (на примере систем электронного обучения и облачных ресурсов), образцы уже реализованных заданий и построения образовательных маршрутов, фрагменты сценариев деятельности обучающихся и преподавателей. Статья состоит из описания методологической основы обучения на базе системно-деятельностного и компетентностного подхода, описания примеров формируемых компетенций, описания экспериментального обучения, практической реализации приложения, анализа текущей и перспективной функциональности Кодактора. В статье обосновывается вывод о повышении эффективности обучения клиентскому веб-программированию при использовании бордкастинга, то есть вещания интерпретируемого кода с разделяемым доступом.\n",
        "keywords": [
            "МОБИЛЬНОЕ ОБУЧЕНИЕ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "ВЕБ-ПРОГРАММИРОВАНИЕ",
            "БОРДКАСТИНГ",
            "ОН-ЛАЙН КУРС",
            "M-LEARNING",
            "WEB TECHNOLOGY",
            "WEB DEVELOPMENT",
            "BOARDCASTING",
            "ON-LINE COURSE"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-tehnologiya-pedagogicheskogo-vzaimodeystviya",
        "name": "Веб-технология педагогического взаимодействия",
        "year": "2007",
        "journalName": "Образовательные технологии и общество",
        "author": [
            "Буханцева Н.В."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Буханцева Н. В.\nСтатья посвящена проблеме разработки адаптивной технологии для интерактивной коммуникации участников образовательного процесса, использующих вэб-ресурсы. Автор предлагает описание структуры научнообразовательного портала, который сочетает функцию интеграции научно-образовательных и методических вэб-ресурсов в образовательный процесс и функцию взаимодействия его участников на базе этих ресурсов. Адаптивная технология позволяет структурировать вэб-ресурсы под конкретный образовательный процесс, способствует развитию творческих способностей его участников, учит культуре подбора и применения веб-ресурсов для педагогических целей.\n",
        "keywords": [
            "ВЕБ-РЕСУРСЫ",
            "ИНТЕРНЕТ",
            "КОММУНИКАТИВНЫЕ ТЕХНОЛОГИИ",
            "ОБРАЗОВАТЕЛЬНОЕ ПРОСТРАНСТВО",
            "ПЕДАГОГИЧЕСКОЕ ВЗАИМОДЕЙСТВИЕ",
            "ПОРТАЛ",
            "ТЕЛЕКОММУНИКАЦИОННЫЕ ТЕХНОЛОГИИ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-yazyka-veb-ontologii-owl-i-semanticheskaya-veb-tehnologiya",
        "name": "Анализ языка Веб онтологии (owl) и семантическая веб-технология",
        "year": "2017",
        "journalName": "Auditorium",
        "author": [
            "Каунг Мьят Хту"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Каунг Мьят Хту\nВ этой статье рассмотрен и проанализирован ряд категорий OWL: OWL-Lite, OWL-DL и OWL-Full. Отмечается, что язык онтологии OWL отличается от XML-схемы, так как предназначен для представления знаний. XML и RDF-форматы являются частью стандарта OWL. OWL полезен для различных приложений, таких как поиск информации, фотографий и т.д.\n",
        "keywords": [
            "ОНТОЛОГИЯ",
            "СЕМАНТИЧЕСКАЯ СЕТЬ",
            "OWL",
            "ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ",
            "XML",
            "RDF"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-servisov-i-tehnologiy-veba-v-bibliotekah-tendentsii-i-perspektivy",
        "name": "Использование сервисов и технологий веба в библиотеках. Тенденции и перспективы",
        "year": "2012",
        "journalName": "Библиосфера",
        "author": [
            "Драцкая Марина Евгеньевна"
        ],
        "description": "\nАннотация научной статьи по СМИ (медиа) и массовым коммуникациям, автор научной работы — Драцкая Марина Евгеньевна\nРассматриваются факторы, которые влияют на применение веб-технологий в библиотеках. Обосновывается необходимость создания модели стратегического развития технологических процессов библиотеки с учетом их конвергенции с технологиями веба.\n",
        "keywords": [
            "БИБЛИОТЕЧНАЯ ТЕХНОЛОГИЯ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "ВЕБ-СЕРВИСЫ",
            "ИНТЕРНЕТ",
            "LIBRARY TECHNOLOGY",
            "WEB TECHNOLOGIES",
            "WEB SERVICES",
            "INTERNET"
        ],
        "branch": "СМИ (медиа) и массовые коммуникации"
    },
    {
        "link": "https://cyberleninka.ru//article/n/novyy-podhod-k-obespecheniyu-veb-dostupnosti-dlya-nezryachih-polzovateley-na-osnove-uluchsheniya-navigatsionnyh-harakteristik-veb",
        "name": "Новый подход к обеспечению веб-доступности для незрячих пользователей на основе улучшения навигационных характеристик веб-страниц",
        "year": "2012",
        "journalName": "Инженерный вестник Дона",
        "author": [
            "Файзрахманов Руслан Рустамович"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Файзрахманов Руслан Рустамович\nБольшинство веб-страниц современной Всемирной паутины оказывается недоступным для незрячих пользователей. Основными причинами этого являются недостаток смысловой нагрузки в исходном коде веб-страниц, а также отсутствие навигационной компоненты для перемещения по логическим элементам. В данной работе предлагается новое представление веб-страницы, многоосевая навигационная модель, представляющая веб-документы в форме, удобной для \"просмотра\" незрячим пользователям. Также предложенны методы навигации по данной модели, обеспечивающие эффективность перемещения и высокую мобильность. Автоматическое преобразование веб-страницы в доступное представление и предоставление средств навигации реализовано в программном комплексе Blindzilla. Эффективность предложенной концепции подтверждена экспериментально относительно современных экранных дикторов, таких как JAWS, Window-Eyes, и Fire Vox.\n",
        "keywords": [
            "ВЕБ-ДОСТУПНОСТЬ",
            "НАВИГАЦИЯ",
            "ВЕБ-СТРАНИЦА",
            "ВЕБ-ТЕХНОЛОГИИ",
            "WEB ACCESSIBILITY",
            "NAVIGATION",
            "WEB PAGE",
            "WEB TECHNOLOGIES"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/opyt-sozdaniya-3d-gis-posredstvom-veb-tehnologiy",
        "name": "Опыт создания 3D ГИС посредством веб-технологий",
        "year": "2016",
        "journalName": "Интерэкспо Гео-Сибирь",
        "author": [
            "Федоренко Александр Владимирович"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Федоренко Александр Владимирович\nНа примере реализованного проекта демонстрируется система визуализации трехмерных пространственных данных посредством веб-технологий.\n",
        "keywords": [
            "3D",
            "ВЕБ",
            "ГИС",
            "WEBGL",
            "WEB",
            "GIS"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/integratsiya-pedagogicheskih-i-veb-tehnologiy-v-obrazovatelnyy-protsess",
        "name": "ИНТЕГРАЦИЯ ПЕДАГОГИЧЕСКИХ И ВЕБ-ТЕХНОЛОГИЙ В ОБРАЗОВАТЕЛЬНЫЙ ПРОЦЕСС",
        "year": "2020",
        "journalName": "Вестник науки и образования",
        "author": [
            "Гизатулина Ольга Ивановна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Гизатулина Ольга Ивановна\nСтатья посвящена изучению особенностей интернета как информационно-образовательной среды, интеграции и проблемам использования веб-технологий в образовательном процессе. Актуальность темы заключается в использовании инновационных образовательных технологий в образовательном процессе. Отмечается, что одним из наиболее перспективных направлений развития современных информационных технологий в образовании является использование веб-технологий. В статье выделены и обоснованы развивающие возможности веб-технологий, которые состоят в предоставлении пользователям широких возможностей для развития навыков новых видов исследовательской, самообразовательной, интеллектуальной деятельности и форм цифровой грамотности. Выявлены дидактические возможности использования ИКТ, способствующие созданию новых версий эффективного использования интернет-ресурсов в образовании, моделей интеграции педагогических и информационных технологий, в основе которых лежит активное взаимодействие педагогов и студентов.\n",
        "keywords": [
            "ОБРАЗОВАТЕЛЬНАЯ ИНФОРМАЦИЯ",
            "ОБРАЗОВАТЕЛЬНАЯ СРЕДА",
            "ИНТЕРНЕТ-РЕСУРСЫ",
            "ИНТЕГРАЦИЯ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "EDUCATIONAL INFORMATION",
            "EDUCATIONAL ENVIRONMENT",
            "INTERNET RESOURCES",
            "INTEGRATION",
            "WEB TECHNOLOGIES"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/optimizatsiya-upravleniya-korporatsiey-s-ispolzovaniem-veb-tehnologiy",
        "name": "Оптимизация управления корпорацией с использованием веб-технологий",
        "year": "2011",
        "journalName": "Сервис plus",
        "author": [
            "Крюкова Елена Михайловна"
        ],
        "description": "\nАннотация научной статьи по экономике и бизнесу, автор научной работы — Крюкова Елена Михайловна\nВ современных условиях высококонкурентных рынков компании должны быстро реагировать на изменения внешней бизнес-среды. Гибкость компаний в значительной степени зависит от того, насколько эффективно и быстро ее сотрудники справляются с ежедневными задачами. Информационные и коммуникационные технологии трансформируют образ компаний и функции сотрудников точно так же, как они изменяют средства массовой информации, культуру и экономику. Соответствующие программные инструменты могут способствовать поддержанию коммуникационных процессов, в особенности в территориально разобщенных компаниях с филиальной структурой. Одним из наиболее популярных инструментов социального компьютинга является вики. Изучение практик зарубежных компаний позволяет выделить основные возможные области применения корпоративных вики на российском рынке, где социальное программное обеспечение явление достаточно новое.\n",
        "keywords": [
            "ИНФОРМАЦИОННЫЕ И КОММУНИКАЦИОННЫЕ ТЕХНОЛОГИИ",
            "ВИКИ",
            "ЦЕЛИ ИСПОЛЬЗОВАНИЯ",
            "ОБЛАСТИ ПРИМЕНЕНИЯ",
            "КОРПОРАЦИЯ",
            "КОМПАНИЯ",
            "INFORMATION AND COMMUNICATION TECHNOLOGIES",
            "WIKI",
            "PURPOSES OF USE",
            "APPLICATION AREAS",
            "CORPORATION",
            "COMPANY"
        ],
        "branch": "Экономика и бизнес"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-tehnologii-iskusstvennyy-intellekt-i-kognitivnoe-pravitelstvo",
        "name": "Веб-технологии, искусственный интеллект и когнитивное правительство",
        "year": "2017",
        "journalName": "Современные информационные технологии и ИТ-образование",
        "author": [
            "Дрожжинов Владимир Иванович",
            "Райков Александр Николаевич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Дрожжинов Владимир Иванович, Райков Александр Николаевич\nПока остается открытым вопрос: смогут ли децентрализованные экосистемы, распределенные в мобильной среде системы туманных вычислений, в конечном счете вытеснить более централизованные системы разработки данных, подобные Knowledge Vault, и догнать доминирующую распространенность семантических веб-систем? В настоящее время база знаний Freebase не исчезла, она передана в проект общедоступной базы знаний Wikidata, которая может стать более важным хранилищем открытых знаний в будущем. Предпринята попытка ответить на этот вопрос. Исследованы 4 этапа развития веб-технологий. Показано, что развитие веб-индустрии идет в направлении стандартизации и последующей реализации стопки компонентов Web 3.0 и компонентов Web 4.0. По стопке стандартов Web 3.0 еще предстоит большая работа, а по стопке стандартов Web 4.0 работы еще практически и не начинались. Технологии Web 1.0-4.0 служат платформами, соответственно, для электронного правительства, открытого цифрового правительства, умного правительства и когнитивного правительства.\n",
        "keywords": [
            "ПОКОЛЕНИЯ ВЕБ",
            "ВЕБ-ПЛАТФОРМА ЭЛЕКТРОННОГО ПРАВИТЕЛЬСТВА",
            "ЭЛЕКТРОННОЕ ПРАВИТЕЛЬСТВО",
            "ОТКРЫТОЕ ЦИФРОВОЕ ПРАВИТЕЛЬСТВО",
            "УМНОЕ ПРАВИТЕЛЬСТВО",
            "КОГНИТИВНОЕ ПРАВИТЕЛЬСТВО",
            "НОВА СПИВАК",
            "WEB GENERATIONS",
            "E-GOVERNMENT'S WEB PLATFORM",
            "E-GOVERNMENT",
            "OPEN DIGITAL GOVERNMENT",
            "SMART GOVERNMENT",
            "COGNITIVE GOVERNMENT",
            "NOVA SPIVACK"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-sovremennogo-napravleniya-razvitiya-veb-tehnologiy",
        "name": "Анализ современного направления развития веб-технологий",
        "year": "2018",
        "journalName": "European science",
        "author": [
            "Кветкин Павел Валерьевич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Кветкин Павел Валерьевич\nВ статье отражены основные направления развития технологий, используемых при разработке сайтов. Рассмотрены наиболее актуальные для пользователя проблемы и методы борьбы с ними, позволяющие раскрыть возможности сайта. Описываются наиболее важные направления развития веб-технологий в современном мире: применение минимализма в дизайне сайта, технологии HTML5, технологии CSS3, параллакс-эффект, выведение окна меню при рассмотрении контента для удобства пользователя, разработка актуального мобильного приложения, повышение социальной защиты.\n",
        "keywords": [
            "ВЕБ-ТЕХНОЛОГИИ",
            "WEB TECHNOLOGIES",
            "ТЕНДЕНЦИИ РАЗВИТИЯ",
            "DEVELOPMENT TRENDS",
            "ИНФОРМАЦИЯ",
            "INFORMATION",
            "ВЕБ-ДИЗАЙН",
            "WEB DESIGN"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/nekotorye-aspekty-obucheniya-studentov-osnovam-kontseptsii-semanticheskiy-veb",
        "name": "Некоторые аспекты обучения студентов основам концепции семантический веб",
        "year": "2016",
        "journalName": "Машиностроение и компьютерные технологии",
        "author": [
            "Климов В.В.",
            "Чернышов А.А.",
            "Баландина А.И.",
            "Косткина А.Д."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Климов В.В., Чернышов А.А., Баландина А.И., Косткина А.Д.\nДанная статья содержит описание современных технологий в области семантического веба. Описываются текущие проблемы в данной области и предлагается возможное решение некоторых из них. Поставлена проблема обучения студентов семантическим технологиям и указываются предпосылки для создания обучающего курса по этим областям. Описываются основные задания для самостоятельной работы по этому курсу, а также навыки, которыми овладевает студент после прохождения всего курса.\n",
        "keywords": [
            "СЕМАНТИЧЕСКИЙ ВЕБ",
            "ВЕБ-СЕРВИСЫ",
            "ОБУЧАЮЩИЙ КУРС",
            "ВЕБ-ТЕХНОЛОГИИ"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-tehnologiy-veb-analitiki-v-marketingivoy-strategii",
        "name": "ИСПОЛЬЗОВАНИЕ ТЕХНОЛОГИЙ ВЕБ-АНАЛИТИКИ В МАРКЕТИНГИВОЙ СТРАТЕГИИ",
        "year": "2020",
        "journalName": "StudNet",
        "author": [
            "Пак Елена Дмитриевна"
        ],
        "description": "\nАннотация научной статьи по СМИ (медиа) и массовым коммуникациям, автор научной работы — Пак Елена Дмитриевна\nНа сегодняшний день одним из самых прогрессивных и эффективных методов повышения эффективности маркетинговой деятельности компании являются интернет-технологии. Устанавливая счётчики аналитических систем на свои сайты, маркетологи получают возможность отслеживать клиентов на всех этапах, от клика по рекламному объявлению до оплаты заказа в интернет-магазине. В данной статье описаны системы веб-аналитики Google analytics, Яндекс.Метрика, LiveInternet, пиксели соцсетей Facebook и ВКонтакте и их возможности. Для принятия решения о покупке человеку обычно требуется время и актуальная информация; инструменты веб-аналитики позволяют обеспечить информационное взаимодействие между потенциальными участниками рынка, а также оценивать эффективность мероприятий по интернет-маркетингу в случае перехода пользователей на сайт.Today, one of the most progressive and effective methods of increasing the effectiveness of the company's marketing activities is Internet technology. By installing Analytics counters on their sites, marketers can track customers at all stages, from clicking on an ad to paying for an order in an online store. This article describes the system web Analytics Google analytics, Yandex.Metrika, LiveInternet, the pixels of social networks Facebook and Vkontakte and their capabilities. A person usually needs time and up-to-date information to make a purchase decision; web Analytics tools allow you to ensure information interaction between potential market participants, as well as evaluate the effectiveness of Internet marketing activities if users click through to the site.\n",
        "keywords": [
            "ВЕБ-АНАЛИТИКА",
            "ИНТЕРНЕТ-МАРКЕТИНГ",
            "ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ",
            "ИССЛЕДОВАНИЕ АУДИТОРИИ",
            "МОНИТОРИНГ САЙТА",
            "МАРКЕТИНГОВАЯ СТРАТЕГИЯ",
            "WEB ANALYTICS",
            "INTERNET MARKETING",
            "INFORMATION TECHNOLOGY",
            "AUDIENCE RESEARCH",
            "SITE MONITORING",
            "MARKETING STRATEGY"
        ],
        "branch": "СМИ (медиа) и массовые коммуникации"
    },
    {
        "link": "https://cyberleninka.ru//article/n/uchebnye-tehnologii-primenyaemye-v-obuchenii-vidam-natsionalnoy-borby-kurash",
        "name": "Учебные технологии, применяемые в обучении видам национальной борьбы кураш",
        "year": "2019",
        "journalName": "Научный журнал",
        "author": [
            "Муниров Нурали Алишерович",
            "Раджабов Эргаш Нуриддинович"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Муниров Нурали Алишерович, Раджабов Эргаш Нуриддинович\nВ состоянии анализируются понятия инструментов программирования и возможности использования учебного веб-контента в учебном процессе.\n",
        "keywords": [
            "ВЕБ-САЙТ",
            "НАБОР",
            "ИНФОРМАЦИЯ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "ВЕБ-СЕРВИС",
            "ПЛАТФОРМА",
            "ВЕБ-ИНФРАСТРУКТУРА"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-veb-2-0-v-sisteme-upravleniya-kachestvom",
        "name": "Технологии веб 2. 0 в системе управления качеством",
        "year": "2014",
        "journalName": "Международный научно-исследовательский журнал",
        "author": [
            "Минаков В.Ф.",
            "Макарчук Т.А.",
            "Щугорева В.А."
        ],
        "description": "\nАннотация научной статьи по экономике и бизнесу, автор научной работы — Минаков В. Ф., Макарчук Т. А., Щугорева В. А.\nПредставлен авторский вариант веб–сервиса поиска и выбора модели смартфона в зависимости от цены и качества. Показано, что информация базы данных сервиса может быть использована для планирования производства и продаж изделий разного уровня качества.\n",
        "keywords": [
            "ВЕБ–СЕРВИС",
            "УПРАВЛЕНИЕ КАЧЕСТВОМ",
            "ИННОВАЦИИ",
            "WEB SERVICE",
            "QUALITY MANAGEMENT",
            "INNOVATIONS"
        ],
        "branch": "Экономика и бизнес"
    },
    {
        "link": "https://cyberleninka.ru//article/n/sovremennye-veb-tehnologii-v-obrazovatelnom-protsesse-i-ih-rol-v-obuchenii",
        "name": "СОВРЕМЕННЫЕ ВЕБ-ТЕХНОЛОГИИ В ОБРАЗОВАТЕЛЬНОМ ПРОЦЕССЕ И ИХ РОЛЬ В ОБУЧЕНИИ",
        "year": "2018",
        "journalName": "Вестник Таганрогского института имени А.П. Чехова",
        "author": [
            "Белоконова С.С.",
            "Назарова В.В."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Белоконова С.С., Назарова В.В.\nВ статье представлены современные образовательные веб-технологии их классификации. Также рассмотрены возможности их использования, достоинства и недостатки.\n",
        "keywords": [
            "ВЕБ-ТЕХНОЛОГИИ",
            "INTERNET TECHNOLOGIES",
            "ОБЛАЧНЫЕ ТЕХНОЛОГИИ",
            "CLOUD COMPUTING",
            "ВИРТУАЛЬНАЯ ЛАБОРАТОРИЯ",
            "VIRTUAL LABORATORY",
            "ВЕБ-КВЕСТ",
            "WEB QUEST",
            "ВЕБИНАР",
            "WEBINAR",
            "ОНЛАЙН-ПЛАТФОРМА",
            "ONLINE PLATFORM",
            "ЭЛЕКТРОННЫЙ УЧЕБНИК",
            "ELECTRONIC TEXTBOOKS",
            "ИНТЕРНЕТ-СЕРВИС",
            "INTERNET SERVICE",
            "ELECTRONIC LIBRARY"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-veb-tehnologiy-na-saytah-legalnyh-rossiyskih-bukmekerov",
        "name": "Анализ веб-технологий на сайтах легальных российских букмекеров",
        "year": "2019",
        "journalName": "Наука, техника и образование",
        "author": [
            "Солозобов Олег Анатольевич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Солозобов Олег Анатольевич\nВ статье представлены результаты исследований веб-технологий, которые применяются на сайтах легальных российских букмекеров. Установлено, что на сайтах букмекерских контор применяются не самые передовые веб-технологии, некоторые сайты работают даже без использования безопасного протокола передачи гипертекста (https). Популярными технологиями являются веб-сервер Nginx, библиотека jQuery, js-фреймворки React и Angular. Часть сайтов вообще никак не оптимизированы для использования на мобильных устройствах. Большая часть сайтов букмекеров имеют отдельную мобильную версию сайта вместо адаптивного дизайна.\n",
        "keywords": [
            "БУКМЕКЕРЫ",
            "БУКМЕКЕРСКИЕ КОНТОРЫ",
            "ВЕБ-САЙТЫ",
            "САЙТЫ",
            "ТЕХНОЛОГИИ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "BOOKMAKERS",
            "WEBSITES",
            "TECHNOLOGIES",
            "WEB TECHNOLOGIES"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/integratsiya-veb-tehnologiy-v-protsess-obucheniya-arhitekturnomu-proektirovaniyu",
        "name": "ИНТЕГРАЦИЯ ВЕБ-ТЕХНОЛОГИЙ В ПРОЦЕСС ОБУЧЕНИЯ АРХИТЕКТУРНОМУ ПРОЕКТИРОВАНИЮ",
        "year": "2018",
        "journalName": "Вестник Московского информационно-технологического университета – Московского архитектурно-строительного института",
        "author": [
            "Дьячкова Е.А."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Дьячкова Е.А.\nВ статье анализируется опыт применения социальных сетей, мессенджеров и файлооб-менников в учебном процессе по направлению подготовки «Архитектура» на кафедре архитектуры МИТУ-МАСИ. Рассматриваются возможности и перспективы развития электронного обучения в кон-тексте использования образовательного потенциала веб-технологий\n",
        "keywords": [
            "ВЕБ-ТЕХНОЛОГИИ",
            "СОЦИАЛЬНЫЕ СЕТИ",
            "МЕССЕНДЖЕРЫ",
            "АРХИТЕКТУРНОЕ ОБРАЗОВАНИЕ",
            "СЕТЕВОЕ ОБУЧЕНИЕ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-tehnologii-sbora-dannyh-klinicheskih-i-populyatsionnyh-issledovaniy",
        "name": "Веб-технологии сбора данных клинических и популяционных исследований",
        "year": "2012",
        "journalName": "Гематология и трансфузиология",
        "author": [
            "Русинов М.А.",
            "Чабаева Ю.А.",
            "Куликов С.М."
        ],
        "description": "",
        "keywords": []
    },
    {
        "link": "https://cyberleninka.ru//article/n/formirovanie-obrazovatelnoy-sredy-it-spetsialistov-na-osnove-veb-tehnologiy",
        "name": "Формирование образовательной среды ИТ-специалистов на основе веб-технологий",
        "year": "2012",
        "journalName": "Образовательные технологии и общество",
        "author": [
            "Голицына Ирина Николаевна",
            "Афзалова Альфия Николаевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Голицына Ирина Николаевна, Афзалова Альфия Николаевна\nВ статье сформулированы особенности образовательной среды современных специалистов по информационным технологиям. Описан опыт создания электронных образовательных ресурсов «Сетевая экономика», «Средство разработки веб-приложений Visual Studio на основе ASP.NET», «Мировые информационные ресурсы» с использованием технологии вики в сотрудничестве со студентами специальности «Прикладная информатика (в экономике)».\n",
        "keywords": [
            "ИТ-СПЕЦИАЛИСТЫ",
            "ИНФОРМАЦИОННАЯ ОБРАЗОВАТЕЛЬНАЯ СРЕДА",
            "ЭЛЕКТРОННЫЕ УЧЕБНЫЕ РЕСУРСЫ",
            "ТЕХНОЛОГИЯ ВИКИ",
            "ВИКИУЧЕБНИК",
            "IT PROFESSIONALS",
            "INFORMATIONAL EDUCATIONAL ENVIRONMENT",
            "E-LEARNING RESOURCES",
            "WIKI",
            "WIKIBOOKS"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/issledovanie-noveyshih-veb-tehnologiy-i-algoritmov-prodvizheniya-saytov",
        "name": "Исследование новейших веб-технологий и алгоритмов продвижения сайтов",
        "year": "2012",
        "journalName": "Восточно-Европейский журнал передовых технологий",
        "author": [
            "Егорова И.Н.",
            "Бондаренко Е.А."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Егорова И. Н., Бондаренко Е. А.\nПредставлено аналитическое исследование новейших технологий WEB-дизайна, анализ основных алгоритмов продвижения сайтов и их практическая реализация в виде интерактивного мультимедийного обучающего пособия «HTML5/CSS3, JavaScript/SEO. Разработка современных сайтов»\n",
        "keywords": [
            "ИНТЕРНЕТ-ТЕХНОЛОГИИ",
            "ДИНАМИЧЕСКАЯ ГРАФИКА",
            "ИНТЕРФЕЙС",
            "МЕТОДЫ ПОИСКОВОЙ ОПТИМИЗАЦИИ",
            "РАНЖИРОВАНИЕ САЙТОВ",
            "INTERNET TECHNOLOGY",
            "DYNAMIC GRAPHICS",
            "USER INTERFACE",
            "SEARCH ENGINE OPTIMIZATION",
            "RANKING SITES"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/proektirovanie-udalyonnogo-informatsionnogo-resursa-s-ispolzovaniem-veb-tehnologiy",
        "name": "ПРОЕКТИРОВАНИЕ УДАЛЁННОГО ИНФОРМАЦИОННОГО РЕСУРСА С ИСПОЛЬЗОВАНИЕМ ВЕБ-ТЕХНОЛОГИЙ",
        "year": "2021",
        "journalName": "Достижения науки и образования",
        "author": [
            "Ломовская Елена Владиславовна",
            "Алешкова Елена Николаевна"
        ],
        "description": "",
        "keywords": []
    },
    {
        "link": "https://cyberleninka.ru//article/n/rol-veb-orientirovannyh-tehnologiy-v-sisteme-sovremennogo-innovatsionnogo-obucheniya",
        "name": "Роль веб-ориентированных технологий в системе современного инновационного обучения",
        "year": "2018",
        "journalName": "Санкт-Петербургский образовательный вестник",
        "author": [
            "Саидов И.Д."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Саидов И.Д.\nВ данной статье охарактеризована группа категорий, отражающая социально-образовательный аспект использования, веб-ориентированных технологий и обоснованы технические средства, с помощью которых функционирует сеть, что является основой для внедрения современного инновационного обучения.\n",
        "keywords": [
            "ВЕБ-ТЕХНОЛОГИИ",
            "ИНТЕРНЕТ",
            "САЙТ",
            "ОБЛАЧНЫЕ ТЕХНОЛОГИИ",
            "ТЕГИ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/funktsii-informatsionnyh-tehnologiy-veb-2-0-v-obuchenii-inostrannomu-yazyku",
        "name": "Функции информационных технологий Веб 2. 0 в обучении иностранному языку",
        "year": "2013",
        "journalName": "Вестник Таганрогского института имени А.П. Чехова",
        "author": [
            "Юрова Ольга Авинеровна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Юрова Ольга Авинеровна\nВ статье рассмотрены преимущества инновационных обучающих технологий поколения Веб 2.0 в процессе обучения иностранным языкам, обоснована возможность и целесообразность их практического применения в традиционном учебном процессе на примере международной социальной сети Busuu.com, предлагающей услуги в сфере иноязычного образования.\n",
        "keywords": [
            "ТРАДИЦИОННЫЕ КОМПЬЮТЕРНЫЕ ТЕХНОЛОГИИ",
            "ИННОВАЦИОННЫЕ ТЕХНОЛОГИИ ВЕБ 2.0",
            "ФУНКЦИИ СЕРВИСОВ ВЕБ 2.0 В ОБУЧЕНИИ ИНОСТРАННОМУ ЯЗЫКУ",
            "TRADITIONAL COMPUTER TECHNOLOGIES",
            "WEB 2.0 INNOVATIVE TECHNOLOGIES",
            "WEB 2.0 SERVICE FUNCTIONS IN THE PROCESS OF FOREIGN LANGUAGE TEACHING"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/retrospektiva-razvitiya-veb-tehnologiy-v-sozdanii-korporativnyh-informatsionnyh-sistem",
        "name": "РЕТРОСПЕКТИВА РАЗВИТИЯ ВЕБ-ТЕХНОЛОГИЙ В СОЗДАНИИ КОРПОРАТИВНЫХ ИНФОРМАЦИОННЫХ СИСТЕМ",
        "year": "2020",
        "journalName": "Вестник Южно-Уральского государственного университета. Серия: Компьютерные технологии, управление, радиоэлектроника",
        "author": [
            "Шинкарев Александр Андреевич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Шинкарев Александр Андреевич\nВведение. Первые упоминания о корпоративных информационных системах появились в 60-х гг. XX в. Со временем эти системы развивались, становились более сложными, но при этом позволяли решать широкий круг задач. Начиная с 90-х гг. XX в. стали активно развиваться веб-технологии. Естественным образом они нашли свое применение и при разработке корпоративных информационных систем различного назначения. Цель исследования. Описание основных этапов развития веб-технологий, начиная от появления языка гипертекстовой разметки до современных одностраничных веб-приложений, а также их влияния на подходы к созданию корпоративных информационных систем. Выявление перспективных направлений развития решений на базе веб-технологий, которые могут успешно использоваться при построении корпоративных информационных систем. Материалы и методы. Рассматриваются современные веб-технологии, анализируется процесс их развития от этапа появления до настоящего времени, рассматриваются примеры инструментов, которые были признаны устаревшими, и причины невозможности дальнейшего развития этих технологий. Результаты. В статье приводится история появления различных технологий, описывается их влияние на подходы к реализации корпоративных систем, а также приводится способ перехода от настольной версии системы к ее онлайн-версии. В том числе дается оценка перспективности отдельных технологических направлений, которые имеют хорошие шансы успешно развиваться в дальнейшем. Дается оценка растущей сложности веб-приложений, их сращивания с подходами и инструментами разработки серверной части. Выявляется актуальность разработчиков программного обеспечения, которые могут разрабатывать как серверную, так и клиентскую часть приложения.\n",
        "keywords": [
            "ВЕБ-ТЕХНОЛОГИИ",
            "КОРПОРАТИВНЫЕ ИНФОРМАЦИОННЫЕ СИСТЕМЫ",
            "БРАУЗЕР",
            "ВЕБ-СЕРВЕР",
            "ОДНОСТРАНИЧНЫЕ ПРИЛОЖЕНИЯ",
            "WEB TECHNOLOGIES",
            "ENTERPRISE INFORMATION SYSTEMS",
            "BROWSER",
            "WEB SERVER",
            "SINGLE PAGE APPLICATION",
            "JAVASCRIPT",
            "ERP"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-tehnologii-veb-kvest-v-professionalnom-samoopredelenii",
        "name": "Использование технологии \"веб-квест\" в профессиональном самоопределении",
        "year": "2018",
        "journalName": "Вестник Российского университета дружбы народов. Серия: Информатизация образования",
        "author": [
            "Царапкина Юлия Михайловна",
            "Якубова Эльмира Юнировна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Царапкина Юлия Михайловна, Якубова Эльмира Юнировна\nЦель данной работы заключается в анализе теоретических исследований информационных технологий и опытно-экспериментального исследования среди старшеклассников и студентов для изучения профориентационной направленности, выбора приоритетов в профессии и эффективности применения веб-квестов в профориентации молодежи. В ходе выполнения работы были использованы следующие методы исследования: анализ научно-методической литературы, тестирование, анкетирование, интервьюирование, эксперимент, теоретический и практический анализ педагогических идей. На основе результатов проведенных исследований был разработан профориентационный информационно-практический веб-квест «В мире IT-профессий». Использование предложенного веб-квеста позволит сформировать у молодых людей представление о профессиях сферы IT, требованиях, предъявляемых к человеку в данной профессии, поможет ориентировочно выявить их личные и профессиональные интересы и склонности, а также будет способствовать формированию готовности школьников и студентов самостоятельно и осознанно подходить к решению вопроса своего профессионального развития.\n",
        "keywords": [
            "ПРОФЕССИОНАЛЬНАЯ ОРИЕНТАЦИЯ",
            "ПРОФЕССИОНАЛЬНОЕ САМООПРЕДЕЛЕНИЕ",
            "ВЕБ-КВЕСТ",
            "ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ",
            "PROFESSIONAL ORIENTATION",
            "PROFESSIONAL SELF-DETERMINATION",
            "WEB-QUEST",
            "INFORMATION TECHNOLOGIES"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-veb-kvesta-v-obuchenii-inostrannyh-stazherov",
        "name": "Технология веб-квеста в обучении иностранных стажеров",
        "year": "2014",
        "journalName": "Вестник Южно-Уральского государственного гуманитарно-педагогического университета",
        "author": [
            "Мельникова Арина Юрьевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Мельникова Арина Юрьевна\nВ статье рассматривается актуальная проблема применения технологии веб-квеста в обучении иностранных стажёров с целью развития профессиональных компетенций. Автор описывает этапы создания и выполнения веб-квеста, варианты заданий, специфику работы иностранных стажёров с данной технологией и преимущества её использования в учебном процессе.\n",
        "keywords": [
            "АКАДЕМИЧЕСКАЯ МОБИЛЬНОСТЬ",
            "КОММУНИКАТИВНАЯ КОМПЕТЕНЦИЯ",
            "ИНТЕРНЕТ",
            "ТЕХНОЛОГИЯ",
            "ВЕБ-КВЕСТ",
            "АРТЕФАКТ",
            "ACADEMIC MOBILITY",
            "COMMUNICATIVE COMPETENCE",
            "INTERNET",
            "TECHNOLOGY",
            "WEBQUEST",
            "ARTEFACT"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/sposoby-vnedreniya-tehnologiy-veb-2-0-v-uchebnyy-protsess",
        "name": "Способы внедрения технологий Веб 2. 0 в учебный процесс",
        "year": "2011",
        "journalName": "Наукові записки Тернопільського національного педагогічного університету. Серія: педагогіка ",
        "author": [
            "Олефиренко Надежда Васильевна",
            "Ольховский Евгений Александрович"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Олефиренко Надежда Васильевна, Ольховский Евгений Александрович\nРассмотрены возможности сервисов Веб 2.0 для учебного процесса, а также проанализированы способы их использования. Выяснено, что сервисы Веб 2.0 могут применяться как источник учебных материалов, хранилища ссылок на веб-ресурсы, платформы для организации совместной деятельности школьников, а также в качестве удобного способа опубликования и показа результатов работы. Приведены примеры применения в обучении школьников ресурсов, созданных по технологии Веб 2.0.\n",
        "keywords": [
            "ТЕХНОЛОГИИ ВЕБ 2.0",
            "ВИКИ-СРЕДЫ",
            "КАРТЫ ЗНАНИЙ",
            "KNOWLEDGE MAP",
            "WEB 2.0 SERVICES",
            "THE WIKI-ENVIRONMENT"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-tehnologiy-zaschity-ot-identifikatsii-veb-brauzerov",
        "name": "Анализ технологий защиты от идентификации веб-браузеров",
        "year": "2018",
        "journalName": "NBI-technologies",
        "author": [
            "Московченко Валерий Михайлович",
            "Столяров Данил Олегович",
            "Горбунов Александр Андреевич",
            "Белянин Владислав Игоревич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Московченко Валерий Михайлович, Столяров Данил Олегович, Горбунов Александр Андреевич, Белянин Владислав Игоревич\nВ статье рассмотрена проблема сохранения анонимности в сети. Описаны основные технологии для отслеживания действия пользователей сайтов, принцип их работы. Выделены преимущества и недостатки технологий cookies и fingerprints и методы защиты от данных технологий.\n",
        "keywords": [
            "АНОНИМНОСТЬ",
            "КОНФИДЕНЦИАЛЬНОСТЬ",
            "COOKIES",
            "FINGERPRINT",
            "ВЕББРАУЗЕР",
            "ANONYMITY",
            "CONFIDENTIALITY",
            "WEB BROWSER"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-semanticheskogo-veb-dostupa-k-multimediynym-aktivam",
        "name": "Технологии семантического Веб доступа к мультимедийным активам",
        "year": "2011",
        "journalName": "Вестник Саратовского государственного технического университета",
        "author": [
            "Сытник А.А.",
            "Вагарина Н.С.",
            "Мельникова Н.И."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Сытник А. А., Вагарина Н. С., Мельникова Н. И.\nПреодоление семантического разрыва в использовании мультимедийных активов возможно при использовании технологий семантического веба. Аннотирование мультимедийных активов на основе предметно-независимых мультимедийных онтологий и предметных онтологий сможет обеспечить их многократное долгосрочное использование.\n",
        "keywords": [
            "МУЛЬТИМЕДИЙНЫЕ АКТИВЫ",
            "СЕМАНТИЧЕСКИЙ РАЗРЫВ",
            "МУЛЬТИМЕДИЙНЫЕ ОНТОЛОГИИ",
            "ПРЕДМЕТНЫЕ ОНТОЛОГИИ",
            "MULTIMEDIA ASSETS",
            "SEMANTIC DIVIDE",
            "MULTIMEDIA ONTOLOGY",
            "THEMATIC ONTOLOGY"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-kvest-tehnologii-v-obuchenii-inostrannym-yazykam",
        "name": "ВЕБ-КВЕСТ ТЕХНОЛОГИИ В ОБУЧЕНИИ ИНОСТРАННЫМ ЯЗЫКАМ",
        "year": "2019",
        "journalName": "Казанский вестник молодых учёных",
        "author": [
            "Сагитова Римма Раисовна",
            "Гайнуллина Айгуль"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Сагитова Римма Раисовна, Гайнуллина Айгуль\nстатье рассматриваются возможности использования веб-квест технологий при формировании иноязычной коммуникативной компетенции учащихся. Авторы выделяют основные мето-ды, используемые при работе с данной технологией; определяют условия применения данной технологии на занятиях по иностранному языку; выделяют принципы классификации веб-квестов. Авторами пред-ставлена также структура веб-квеста. Авторы подчеркивают, что применение веб-квест технологий в образовательном процессе позволит мотивировать учащихся на уроке и повысить уровень владения ино-странным языком. В статье описан один из примеров данной технологии «A Tour Around London», разра-ботанный для учащихся 5 класса на платформе Google.\n",
        "keywords": [
            "иностранный язык",
            "современные технологии",
            "веб-квест технология",
            "интернет",
            "образование",
            "web quest technologies",
            "foreign language",
            "authentic resources",
            "education"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/personalizatsiya-obucheniya-na-osnove-tehnologii-veb-kvest",
        "name": "ПЕРСОНАЛИЗАЦИЯ ОБУЧЕНИЯ НА ОСНОВЕ ТЕХНОЛОГИИ ВЕБ-КВЕСТ",
        "year": "2020",
        "journalName": "Ярославский  педагогический вестник",
        "author": [
            "Чернявская Анна Павловна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Чернявская Анна Павловна\nРезультативность обучения определяется многими факторами. Исследовали все чаще обращают внимание на соответствие условий содержания обучения индивидуальным особенностям и запросам обучающихся. Тезис о том, что студент (ученик) должен являться субъектом собственного обучения, наконец-то получает реальное воплощение. В статье обсуждаются аспекты персонализированного подхода в обучении, связанные с изменением деятельности преподавателя. В условиях персонализации образовательный процессе проектируется и реализуется таким образом, что учащийся выступает субъектом учебной деятельности. В статье обсуждаются принципы, условия, формы и методы работы, необходимые для персонализации. В педагогическом процессе всегда участвуют две стороны - педагог и обучающийся. Обучающийся достигнет более высоких результатов, если деятельность по обучению будет для него комфортной с точки зрения психологических и педагогических условий. Роль преподавателя в этих условиях меняется с информационной и дисциплинирующей на организационную, координационную, консультационную. Иным образом ставятся и реализуются задачи (1) отбора содержания и методов обучения; (2) организации взаимодействия со студентами; (3) восприятия преподавателем учебной деятельности студентов. В статье обсуждаются требования к отбору содержания обучения: предпоолагается, что обучение имеет личностный смысл и индивидуализированный эталон; учебный материал стимулирует развитие рефлексии собственного опыта студентов; студенты в процессе работы с учебным содержанием имею возможность формулировать собственные цели; учебное содержание сконструировано таким образом, чтобы стимулировать бесконечный процесс познания у студентов. Особое внимание уделяется конструированию содержания обучения. В качестве одной из основ персонализации обучения в статье рассматривается технология конструирования и решения веб-квестов. Веб-квест - исследовательский вид деятельности, который позволяет обучающимся получить новые знания и расширить понимание изучаемого вопроса. Обсуждаются результаты использования этой технологии при обучении студентов магистратуры в период дистанционного обучения.\n",
        "keywords": [
            "ОБУЧЕНИЕ",
            "ПЕРСОНАЛИЗАЦИЯ",
            "ОБРАЗОВАТЕЛЬНЫЕ ТЕХНОЛОГИИ",
            "ВЕБ-КВЕСТ",
            "СТУДЕНТЫ",
            "TRAINING",
            "PERSONALIZATION",
            "EDUCATIONAL TECHNOLOGIES",
            "WEB QUEST",
            "STUDENTS"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razrabotka-progressivnogo-veb-prilozheniya-s-pomoschyu-tehnologii-pwa",
        "name": "РАЗРАБОТКА ПРОГРЕССИВНОГО ВЕБ-ПРИЛОЖЕНИЯ С ПОМОЩЬЮ ТЕХНОЛОГИИ PWA",
        "year": "2020",
        "journalName": "StudNet",
        "author": [
            "Газизуллин Нафис Инсафович",
            "Плещинская Ирина Евгеньевна"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Газизуллин Нафис Инсафович, Плещинская Ирина Евгеньевна\nСтатья посвящена разработке прогрессивного веб-приложения с помощью технологии PWA (Progressive Web Application). Рассмотрены преимущества и недостатки данной технологии. Раскрыто понятие «прогрессивное веб-приложение». Приведена краткая история возникновения и развития данной технологии. В настоящее время несмотря на то, что технология PWA позволяет существенно облегчить разработку в сфере веб-приложений, немного разработчиков готовы использовать данную технологию в своих проектах. Цель данной работы – краткое описание технологии PWA, анализ преимуществ и недостатков технологии.\n",
        "keywords": [
            "PWA",
            "Service Worker",
            "прогрессивное веб-приложение",
            "PWA",
            "Service Worker",
            "progressive web application"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/mezhdistsiplinarnaya-integratsiya-v-protsesse-izucheniya-veb-tehnologiy-i-kompyuternoy-grafiki",
        "name": "Междисциплинарная интеграция в процессе изучения веб-технологий и компьютерной графики",
        "year": "2013",
        "journalName": "Открытое образование",
        "author": [
            "Колесников Андрей Витальевич",
            "Сиренко Светлана Николаевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Колесников Андрей Витальевич, Сиренко Светлана Николаевна\nВ статье обосновывается целесообразность междисциплинарной интеграции для повышения качества образовательного процесса в условиях широкого внедрения компетентностного подхода в вузе. На примере двух дисциплин: «Разработка и сопровождение информационных web-ресурсов» и «Компьютерная графика и мультимедиа» рассматривается методика реализации междисциплинарной интеграции и специальной подготовки в процессе выполнений комплексных лабораторных заданий проектного типа.\n",
        "keywords": [
            "МЕЖДИСЦИПЛИНАРНАЯ ИНТЕГРАЦИЯ",
            "КОМПЕТЕНТНОСТНЫЙ ПОДХОД",
            "КОМПЬЮТЕРНАЯ ГРАФИКА",
            "ФРАКТАЛЫ",
            "СИНЕРГЕТИКА",
            "МЕТОДИКА ПРЕПОДАВАНИЯ ИНФОРМАТИКИ",
            "INTERDISCIPLINARY INTEGRATION",
            "COMPETENCE-BASED APPROACH",
            "COMPUTER GRAPHICS",
            "FRACTALS",
            "SYNERGETICS",
            "TECHNIQUE OF TEACHING OF INFORMATICS"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-veb-tehnologiy-pri-razrabotke-raspredelennyh-sistem-monitoringa",
        "name": "Применение веб-технологий при разработке распределенных систем мониторинга",
        "year": "2011",
        "journalName": "Известия Южного федерального университета. Технические науки",
        "author": [
            "Фролова Марина Владимировна"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Фролова Марина Владимировна\nПредложена структура построения распределенной системы мониторинга для контроля параметров технически сложных объектов. Для ее реализации предлагается использовать интерфейс Ethernet и миниатюрные веб-серверы в каждом датчике системы мониторинга или блоке сбора данных для создания удаленных измерительных систем. Описан принцип удаленного доступа к данным при помощи веб-технологий. Данное решение позволит добиться увеличения скорости работы измерительных систем, уменьшения их стоимости, размеров и времени, затрачиваемого на настройку систем, а также повышения роли программного обеспечения. Выбраны средства разработки и разработан проект программного обеспечения системы. Предложено несколько вариантов развития данного проекта.\n",
        "keywords": [
            "СИСТЕМА МОНИТОРИНГА",
            "ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ",
            "ВЕБ-СЕРВЕР",
            "ПРОТОКОЛ СВЯЗИ",
            "MONITORING SYSTEM",
            "SOFTWARE",
            "WEB-SERVER",
            "COMMUNICATION PROTOCOL"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/sistema-podderzhki-prinyatiya-resheniy-po-vodoraspredeleniyu-na-baze-veb-tehnologiy",
        "name": "СИСТЕМА ПОДДЕРЖКИ ПРИНЯТИЯ РЕШЕНИЙ ПО ВОДОРАСПРЕДЕЛЕНИЮ НА БАЗЕ ВЕБ-ТЕХНОЛОГИЙ",
        "year": "2014",
        "journalName": "Мелиорация и гидротехника",
        "author": [
            "Юрченко Ирина Федоровна",
            "Трунин Владимир Вячеславович"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Юрченко Ирина Федоровна, Трунин Владимир Вячеславович\nЦель работы совершенствование и повышение эффективности оперативного управления водораспределением за счет использования информационных технологий в практике диспетчерской службы межхозяйственных оросительных систем. Рассмотрены вопросы модернизации системы управления водораспределением на межхозяйственных оросительных системах, базирующиеся на методологии системного анализа, методах моделирования сложных систем; имитационного и математического моделирования; теории оптимальных решений, создания новых информационных технологий. Разработаны модели, алгоритмы и процедуры управления водораспределением на межхозяйственных оросительных системах, обеспечивающие: гарантированное равноправное вододеление на основе принципов стабильности и равномерности водоподачи; минимизацию непродуктивных затрат воды; ведение объективной статистики по широкому ряду показателей качества управления и ориентированные на унификацию оросительных систем, использующих методическое и программное обеспечение системы поддержки управленческих решений (СППР). Выполнен анализ актуальных тенденций и применяемых подходов к разработке информационных управляющих систем и установлено преимущество использования в качестве программно-технологической платформы СППР веб-технологий, реализованных в формате «облачных технологий», предоставляющих Интернет-пользователю компьютерные ресурсы в режиме «онлайн-сервиса». По результатам анализа предложений от ведущих компаний в части сервисов «облачных технологий» разработана СППР по водораспределению на основе продукта Google. Таким образом, применение инновационных технологий в сфере обработки информации обеспечит высокий потенциал созданного приложения управления водопользованием на межхозяйственных оросительных системах.\n",
        "keywords": [
            "ВОДОРАСПРЕДЕЛЕНИЕ",
            "WATER DISTRIBUTION",
            "ОПЕРАТИВНОЕ УПРАВЛЕНИЕ",
            "OPERATIONAL MANAGEMENT",
            "КОНТРОЛЬ",
            "MONITORING",
            "АНАЛИЗ",
            "ANALYSIS",
            "КАЧЕСТВО УПРАВЛЕНИЯ",
            "QUALITY CONTROL",
            "ОЦЕНКА ЭФФЕКТИВНОСТИ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "ОБЛАЧНЫЕ ТЕХНОЛОГИИ",
            "CLOUD COMPUTING",
            "ESTIMATE OF EFFICIENCY",
            "WEB TECHNOLOGY"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-veb-tehnologiy-v-professionalnoy-deyatelnosti-prepodavatelya-inostrannogo-yazyka",
        "name": "Применение веб-технологий в профессиональной деятельности преподавателя иностранного языка",
        "year": "2015",
        "journalName": "Вестник Томского государственного педагогического университета",
        "author": [
            "Вульфович Екатерина Витальевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Вульфович Екатерина Витальевна\nРассматривается использование блогов, сервисов социальных закладок и технологии вики в профессиональной деятельности преподавателя иностранного языка. Описываются свойства технологий Web 2.0 и раскрывается методический потенциал их применения для формирования коммуникативной компетенции. Поскольку свойства технологий Web 2.0 подразумевают групповое взаимодействие пользователей, то их применение для обучения иностранным языкам может способствовать формированию умений вести дискуссию, совершенствованию навыков письменной речи разных стилей, развитию рецептивных видов речевой деятельности за счет чтения аутентичных текстов, а также сообщений, комментариев, оставленных другими пользователями.\n",
        "keywords": [
            "WEB 2.0",
            "ВЕБ-ТЕХНОЛОГИИ",
            "БЛОГ",
            "СЕРВИС СОЦИАЛЬНЫХ ЗАКЛАДОК",
            "ТЕХНОЛОГИЯ ВИКИ",
            "WEB TECHNOLOGY",
            "BLOG",
            "SOCIAL BOOKMARKING",
            "WIKI",
            "SOCIOCULTURAL COMPETENCE",
            "PROJECT-BASED LEARNING",
            "WRITING SKILLS"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/izbiratelnoe-rasprostranenie-informatsii-na-baze-veb-servisov-obzor-internet-resursov",
        "name": "Избирательное распространение информации НА БАЗЕ ВЕБ-СЕРВИСОВ: Обзор интернет-ресурсов",
        "year": "2008",
        "journalName": "Библиосфера",
        "author": [
            "Юдина Инна Геннадиевна"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Юдина Инна Геннадиевна\nВ настоящее время за рубежом происходит динамичное развитие избирательного распространения информации (ИРИ) как сервиса на базе веб-технологий. Большое количество информационных ресурсов баз данных, коллекций электронных журналов, доступных через Интернет, оснащены подпиской на рассылку оповещений о новых поступлениях по заранее сформированным тематическим профилям. Предлагается обзор наиболее крупных зарубежных поставщиков информации, предоставляющих интернет-сервис по идеологии ИРИ. Описана деятельность библиотек по организации использования данного сервиса в интересах читателей.\n",
        "keywords": [
            "ИРИ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "СЕРВИС",
            "БИБЛИОТЕКИ"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/individualnyy-dizayn-ili-ispolzovanie-shablonov",
        "name": "Индивидуальный дизайн или использование шаблонов",
        "year": "2018",
        "journalName": "Достижения науки и образования",
        "author": [
            "Григорьева Светлана Сергеевна"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Григорьева Светлана Сергеевна\nВ данной статье рассмотрены два типа дизайна и проанализированы их плюсы и минусы, а также выявлено в каком случае можно прибегнуть к шаблонному проектированию, а когда лучше выбрать индивидуальный дизайн для сайта.\n",
        "keywords": [
            "ВЕБ-ТЕХНОЛОГИИ",
            "ДИЗАЙН",
            "ИНДИВИДУАЛЬНЫЙ",
            "ШАБЛОН"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/o-ratsionalizatsii-kompleksnogo-kontrolya-sportsmenov-na-osnove-veb-tehnologiy-i-ekspertnyh-sistem",
        "name": "О рационализации комплексного контроля спортсменов на основе веб-технологий и экспертных систем",
        "year": "2013",
        "journalName": "Вестник Бурятского государственного университета. Философия",
        "author": [
            "Цыбиков Анатолий Сергеевич",
            "Балдаев Кирилл Владимирович",
            "Тапхаров Михаил Викторович"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Цыбиков Анатолий Сергеевич, Балдаев Кирилл Владимирович, Тапхаров Михаил Викторович\nВ статье рассматриваются задачи, подходы, принципы и методы разработки информационной системы комплексного контроля подготовленности спортсменов с применением веб-технологий и экспертных систем.\n",
        "keywords": [
            "ПОДГОТОВКА СПОРТСМЕНОВ КОМПЛЕКСНЫЙ КОНТРОЛЬ",
            "ВЕБ-ОРИЕНТИРОВАННАЯ ИНФОРМАЦИОННАЯ СИСТЕМА",
            "ЭКСПЕРТНЫЕ СИСТЕМЫ",
            "COMPLEX (INTEGRATED) CONTROL",
            "TRAINING OF ATHLETES",
            "WEB-BASED INFORMATION SYSTEM",
            "EXPERT SYSTEMS"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/organizatsiya-dostupa-k-tehnologicheskim-dannym-gazodobyvayuschih-predpriyatiy-posredstvom-veb-tehnologiy",
        "name": "Организация доступа к технологическим данным газодобывающих предприятий посредством веб-технологий",
        "year": "2014",
        "journalName": "Векторы благополучия: экономика и социум",
        "author": [
            "Финько Антон Игоревич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Финько Антон Игоревич\nВ статье рассматриваются проблемы доступа к технологическим данным газодобывающих предприятий. Рассмотрены способы их решения посредством организации доступа с использованием веб-технологий. Изучены универсальные решения, а также решения, разрабатываемые для определённых предприятий. На основании изученного материала сделаны соответствующие выводы об актуальности использования подобного подхода.\n",
        "keywords": [
            "ГАЗОДОБЫВАЮЩИЕ ПРЕДПРИЯТИЯ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "MES-СИСТЕМА",
            "ДОСТУП К ДАННЫМ",
            "OSISOFT",
            "GAS PRODUCING ENTERPRISES",
            "WEB-TECHNOLOGIES",
            "OSI SOFT",
            "MES-SYSTEM",
            "DATA ACCESS"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-tehnologiy-dlya-realizatsii-metodiki-otsenivaniya-ekologicheskih-problem",
        "name": "Использование веб-технологий для реализации методики оценивания экологических проблем",
        "year": "2013",
        "journalName": "Вестник Кузбасского государственного технического университета",
        "author": [
            "Митченков Игорь Григорьевич",
            "Баумгартэн Михаил Ицекович",
            "Михайлов Владимир Геннадьевич",
            "Тайлакова Анна Александровна",
            "Сарапулова Татьяна Викторовна"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Митченков Игорь Григорьевич, Баумгартэн Михаил Ицекович, Михайлов Владимир Геннадьевич, Тайлакова Анна Александровна, Сарапулова Татьяна Викторовна\nОписана модель регионального экологического мониторинга. Обоснована целесообразность использование современных информационных технологий для реализации описанной модели. Определены требования к разрабатываеммому программному комплексу, описаны современные веб-технологии для реализации программного продукта.\n",
        "keywords": [
            "РЕГИОНАЛЬНЫЕ ЭКОЛОГИЧЕСКИЕ ПРОБЛЕМЫ",
            "СИСТЕМА РЕГИОНАЛЬНОГО ЭКОЛОГИЧЕСКОГО МОНИТОРИНГА",
            "ВЕБ-ТЕХНОЛОГИИ",
            "REGIONAL ENVIRONMENTAL PROBLEMS",
            "THE SYSTEM OF REGIONAL ENVIRONMENTAL MONITORING",
            "WEB TECHNOLOGY"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/adaptatsiya-zarubezhnogo-opyta-primeneniya-tehnologiy-semanticheskogo-veb-v-obrazovanii",
        "name": "Адаптация зарубежного опыта применения технологий семантического веб в образовании",
        "year": "2013",
        "journalName": "Технические науки – от теории к практике",
        "author": [
            "Мельникова Нина Ивановна",
            "Вагарина Наталия Сергеевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Мельникова Нина Ивановна, Вагарина Наталия Сергеевна\nВ статье рассматривается зарубежный опыт применения технологий семантического Веб в образовании на конкретных проектах Ensemble и Linked Education.org. Обосновывается необходимость выпуска серии информационно-аналитических материалов, представляющих и обобщающих зарубежный опыт в этой области. Продуктивно использованный зарубежный опыт позволит актуализировать университетские учебные планы, создавать рабочие программы дисциплин по выбору, и в конечном итоге формировать профессиональные компетенции в области семантических технологий.\n",
        "keywords": [
            "СЕМАНТИЧЕСКИЕ ТЕХНОЛОГИИ",
            "СВЯЗАННЫЕ ДАННЫЕ",
            "СЛОВАРИ",
            "ОНТОЛОГИИ",
            "SEMANTIC TECHNOLOGIES",
            "LINKED DATA",
            "VOCABULARIES",
            "ONTOLOGIES"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-kvest-tehnologiy-v-obuchenii-inostrannym-yazykam",
        "name": "Использование веб-квест технологий в обучении иностранным языкам",
        "year": "2018",
        "journalName": "Казанский вестник молодых учёных",
        "author": [
            "Нурмиева Р.Р.",
            "Першина Н.О."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Нурмиева Р.Р., Першина Н.О.\nВ статье рассматриваются возможности использования веб-квест технологий для развития иноязычной коммуникативной компетенции студентов. Подчеркивается необходимость внедрения в образовательные процессы информационных технологий. Авторы считают, что, что применение веб-квест технололгий в образовательном процессе позволит совершенствовать информационную компетентность будущего профессионала, что, в свою очередь, позволит быть конкурентоспособным специалистом в быстро меняющемся информационном обществе.\n",
        "keywords": [
            "ИНОЯЗЫЧНАЯ КОММУНИКАТИВНАЯ КОМПЕТЕНЦИЯ",
            "ВЕБ-КВЕСТ",
            "ВЕБ-КВЕСТ ТЕХНОЛОГИИ",
            "ИНТЕРНЕТ",
            "СТУДЕНТ",
            "ОБРАЗОВАНИЕ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-veb-2-0-v-organizatsii-proektnoy-deyatelnosti-pedagogov-i-uchaschihsya",
        "name": "Технологии Веб 2. 0 в организации проектной деятельности педагогов и учащихся",
        "year": "2009",
        "journalName": "Вестник Марийского государственного университета",
        "author": [
            "Е. П. Круподерова"
        ],
        "description": "",
        "keywords": []
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-tehnologiy-vzaimodeystviya-mobilnyh-prilozheniy-s-veb-servisami",
        "name": "Анализ технологий взаимодействия мобильных приложений с веб-сервисами",
        "year": "2015",
        "journalName": "Актуальные проблемы авиации и космонавтики",
        "author": [
            "Кожомбаева А.Т.",
            "Щетилов А.В.",
            "Зотин А.Г."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Кожомбаева А.Т., Щетилов А.В., Зотин А.Г.\nРассмотрены технологии взаимодействия мобильных приложений с веб-сервисами. Представлено описание условий проведения исследования технологий. Продемонстрированы полученные данные экспериментального исследования и результаты их анализа. Приведено обоснование выбора REST веб-сервера в качестве наилучшего решения для выбранной предметной области.\n",
        "keywords": [
            "SOAP ВЕБ-СЕРВЕР",
            "REST ВЕБ-СЕРВЕР",
            "SOAP WEB-SERVICE",
            "REST WEB-SERVICE"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-veb-2-0-i-mezhkulturnaya-kommunikatsiya-v-obuchenii-inostrannym-yazykam",
        "name": "Технологии Веб 2. 0 и межкультурная коммуникация в обучении иностранным языкам",
        "year": "2016",
        "journalName": "Преподаватель ХХI век",
        "author": [
            "Кащук Светлана Михайловна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Кащук Светлана Михайловна\nАктуальность статьи определяется стремительным развитием технологий Веб 2.0, появлением информационного цифрового пространства наиболее доступной и удобной среды для организации иноязычной коммуникации, а также необходимостью, в связи с этим, информатизации образования. Цель статьи показать перспективы развития процесса интеграции современных цифровых технологий в систему языкового образования и представить практический опыт интеграции современных технологий Веб 2.0 в процесс обучения иностранному (французскому) языку в рамках создания и реализации международных сетевых учебных проектов. Структура статьи отражает ее содержание. Во вступлении автор определяет основные составляющие успешной коммуникации на иностранным языке согласно документу «Общеевропейские компетенции владения иностранным языком». В основной части представлены три сетевые учебные проекта, в рамках которых было организовано успешное иноязычное общение учащихся и студентов российских высших и средних учебных заведений, использовавших иностранный (французский) язык в качестве инструмента для коммуникации как с носителями языка, так и с зарубежными учащимися, изучающими французский язык как иностранный. В заключение автор делает вывод о том, что реализация сетевых международных проектов в средних и высших российских учебных заведениях не только возможна, но и крайне эффективна.\n",
        "keywords": [
            "ОБУЧЕНИЕ ИНОСТРАННЫМ ЯЗЫКАМ",
            "ЦИФРОВЫЕ ТЕХНОЛОГИИ В ЛИНГВОДИДАКТИКЕ",
            "СОВРЕМЕННАЯ СТРАТЕГИЯ ОБУЧЕНИЯ ИНОСТРАННЫМ ЯЗЫКАМ",
            "СЕТЕВЫЕ УЧЕБНЫЕ ПРОЕКТЫ",
            "МЕЖКУЛЬТУРНАЯ КОММУНИКАЦИЯ В ЦИФРОВОМ ПРОСТРАНСТВЕ",
            "FOREIGN LANGUAGES TEACHING",
            "DIGITAL TECHNOLOGIES IN LINGUODIDAC-TICS",
            "MODERN STRATEGY OF FOREIGN LANGUAGES TEACHING",
            "NETWORK EDUCATION PROJECTS",
            "CROSS-CULTURAL COMMUNICATION IN DIGITAL SPACE"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/kommunikatsionnye-tehnologii-veb-2-0-v-prepodavanii-inostrannogo-yazyka",
        "name": "Коммуникационные ТЕХНОЛОГИИ ВЕБ-2.0 В ПРЕПОДАВАНИИ ИНОСТРАННОГО ЯЗЫКА",
        "year": "2015",
        "journalName": "Гуманитарные, социально-экономические и общественные науки",
        "author": [
            "Садыкова Гульнара Василевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Садыкова Гульнара Василевна\nВ данной статье автор рассматривает коммуникационные технологии веб-2.0 как средство обучения в целом и как эффективный инструмент обучения иностранному языку в частности. Основываясь на материалах зарубежных и российских исследователей, собственном опыте и кейс-исследовании кросс-культурного он- лайн-проекга, автор показывает особую важность интеграции информационно-коммуникационных технологий в систему образования, описывает особенности коммуникации посредством компьютера и показывает возможности использования современных электронных форм общения для создания эффективной и аутентичной среды общения на иностранном языке.\n",
        "keywords": [
            "веб-2.0",
            "ИКТ",
            "коммуникация посредством компьютера",
            "преподавание иностранного языка",
            "кейс-исследование",
            "онлайн обучение",
            "web 2.0",
            "ICT",
            "computer-mediated communication",
            "foreign language learning",
            "computer-assisted language learning",
            "case study",
            "online learning"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-kvestov-v-protsesse-podgotovki-uchitelya-tehnologii",
        "name": "Использование веб-квестов в процессе подготовки учителя технологии",
        "year": "2011",
        "journalName": "Наукові записки Тернопільського національного педагогічного університету. Серія: педагогіка ",
        "author": [
            "Кадемия М.Е."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Кадемия М.Е.\nРассматривается характеристика и методика использования интерактивной методики веб-квестов в интеграции с традиционным обучением в подготовке будущего учителя технологии в учебном процессе высшей школы, приводится классификация и типы образовательных веб-квестов.\n",
        "keywords": [
            "ВЕБ-КВЕСТ",
            "ИНТЕРАКТИВНАЯ МЕТОДИКА ОБУЧЕНИЯ",
            "ИНФОРМАЦИОННО-КОММУНИКАЦИОННЫЕ ТЕХНОЛОГИИ",
            "ИНТЕРНЕТ",
            "ПРОЕКТ",
            "УЧЕБНЫЙ ПРОЦЕСС",
            "WEB-QUEST",
            "INTERACTIVE METHODS OF TRAINING",
            "INFORMATION AND COMMUNICATION TECHNOLOGY",
            "INTERNET",
            "DESIGN",
            "LEARNING PROCESS",
            "іНТЕРАКТИВНА МЕТОДИКА НАВЧАННЯ",
            "іНФОРМАЦіЙНО-КОМУНіКАЦіЙНі ТЕХНОЛОГії",
            "іНТЕРНЕТ",
            "НАВЧАЛЬНИЙ ПРОЦЕС"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-integratsionnye-tehnologii-razvitiya-informatizatsii-selskogo-hozyaystva",
        "name": "Веб-интеграционные технологии развития информатизации сельского хозяйства",
        "year": "2010",
        "journalName": "Никоновские чтения",
        "author": [
            "Меденников В.И."
        ],
        "description": "",
        "keywords": []
    },
    {
        "link": "https://cyberleninka.ru//article/n/formirovanie-inoyazychnoy-kommunikativnoy-kompetentsii-na-osnove-tehnologiy-veb-2-0",
        "name": "Формирование иноязычной коммуникативной компетенции на основе технологий Веб 2. 0",
        "year": "2016",
        "journalName": "Вестник Пермского государственного гуманитарно-педагогического университета. Серия № 1. Психологические и педагогические науки",
        "author": [
            "Мосина Маргарита Александровна",
            "Кобелева Екатерина Сергеевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Мосина Маргарита Александровна, Кобелева Екатерина Сергеевна\nВ статье рассматривается методика формирования иноязычной коммуникативной компетенции на основе современных интернет-технологий. Актуальность проблемы, раскрываемой в статье, объясняется возрастающей потребностью в использовании в процессе обучения более эффективных и разнообразных средств. Обосновывается необходимость использования новых видов электронных технологий второго поколения ВЕБ 2.0 на примере технологии «\n",
        "keywords": [
            "ИНОЯЗЫЧНАЯ КОММУНИКАТИВНАЯ КОМПЕТЕНЦИЯ",
            "ИНТЕРНЕТ-ТЕХНОЛОГИИ",
            "ТЕХНОЛОГИИ ВЕБ 2.0",
            "\"ТРЕЖА ХАНТ\"",
            "FOREIGN LANGUAGE COMMUNICATION COMPETENCE",
            "INTERNET TECHNOLOGIES",
            "WEB 2.0",
            "TREASURE HUNT"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-veb-kommunikatsii-v-rezhime-realnogo-vremeni-webrtc",
        "name": "Технология веб-коммуникации в режиме реального времени WebRTC",
        "year": "2016",
        "journalName": "Актуальные проблемы авиации и космонавтики",
        "author": [
            "Худкина Е.А.",
            "Тимошина В.В."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Худкина Е.А., Тимошина В.В.\nИсследуется технологии веб-коммуникации в режиме реального времени WebRTC. Приводится описание данной технологии, принципов ее работы, рассматриваются преимущества и недостатки, а также перспективы развития.\n",
        "keywords": [
            "ТЕХНОЛОГИЯ WEBRTC",
            "ВЕБ-КОММУНИКАЦИЯ",
            "WEBRTC TECHNOLOGY",
            "WEB COMMUNICATION"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/fazzing-sovremennaya-tehnologiya-poiska-uyazvimostey-v-veb-prilozheniyah",
        "name": "Фаззинг – современная технология поиска уязвимостей в веб-приложениях",
        "year": "2012",
        "journalName": "Наука и современность",
        "author": [
            "Полухин П.В."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Полухин П. В.\nВ статье представлены результаты научного исследования сущности технологии фаззинга, проанализированы существующие этапы жизненного цикла, а также проведена оценка уязвимостей современных приложений, которые можно обнаруживать с помощью данной технологии.\n",
        "keywords": []
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-tehnologiy-veb-2-0-v-kompetentnostno-orientirovannom-bilingvalnom-obuchenii-bakalavrov",
        "name": "Использование технологий Веб 2. 0 в компетентностноориентированном билингвальном обучении бакалавров",
        "year": "2015",
        "journalName": "Science Time",
        "author": [
            "Петрукович Любовь Андреевна",
            "Кручинина Галина Александровна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Петрукович Любовь Андреевна, Кручинина Галина Александровна\nРассматривается проблема формирования билингвальной коммуникативной компетенции будущих бакалавров направления подготовки международные отношения как составной части их профессиональной компетентности в условиях информатизации высшего профессионального образования. Описываются используемые средства информационных и коммуникационных технологий.\n",
        "keywords": [
            "КОМПЕТЕНТНОСТНЫЙ ПОДХОД",
            "БИЛИНГВАЛЬНАЯ КОМПЕТЕНЦИЯ",
            "СРЕДСТВА ИНФОРМАЦИОННЫХ И КОММУНИКАЦИОННЫХ ТЕХНОЛОГИЙ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/organizatsiya-samostoyatelnoy-raboty-studentov-s-ispolzovaniem-veb-2-0-tehnologiy",
        "name": "Организация самостоятельной работы студентов с использованием Веб 2. 0 технологий",
        "year": "2014",
        "journalName": "Психология и педагогика: методика и проблемы практического применения",
        "author": [
            "Щеголева А.В."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Щеголева А. В.\nИспользование Веб 2.0 технологий позволяет студентам самостоятельно совершенствовать знания языка, осуществлять обучение в автономном режиме и дает будущим специалистам современного информационного общества дополнительные профессионально ориентированные и качественно новые умения. С помощью Веб 2.0 можно совместно работать и размещать текстовую и медиа информацию в сети Интернет.\n",
        "keywords": [
            "ТЕХНОЛОГИИ ВЕБ 2.0",
            "САМОСТОЯТЕЛЬНАЯ РАБОТА СТУДЕНТОВ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologii-veb-kvesta-v-sozdanii-pedagogami-mediaobrazovatelnoy-sredy",
        "name": "ТЕХНОЛОГИИ ВЕБ-КВЕСТА В СОЗДАНИИ ПЕДАГОГАМИ МЕДИАОБРАЗОВАТЕЛЬНОЙ СРЕДЫ",
        "year": "2020",
        "journalName": "Мир науки, культуры, образования",
        "author": [
            "Д. В. Ларионова"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Д. В. Ларионова\nВ статье рассматривается роль использования технологии веб-квестов в развитии медиаобразовательной среды. Автор проанализировал исследования и публикации по тематике медиаобразования, рассмотрел понятие медиаобразовательной среды и ее структурные элементы. В их числе определены электронные образовательные ресурсы, которые включают актуальные на сегодняшний день веб-квесты. В статье рассмотрены компоненты, тематика, формы, этапы создания веб-квеста. Приведен пример разработанного веб-квеста по тематике медиаобразования педагогов. Он содержит этапы подготовки проекта участниками, а также традиционные критерии оценки. Рассмотрены инструменты, показавшие себя как наиболее эффективные при работе, нацеленной на развитие медиаобразовательной среды.\n",
        "keywords": [
            "веб-квест",
            "медиаобразовательная среда",
            "медиаобразование",
            "медиа",
            "творческие способности",
            "web quest",
            "media education environment",
            "media education",
            "media",
            "creative abilities."
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-razrabotki-odnostranichnogo-veb-prilozheniya-na-platforme-angular-8",
        "name": "ТЕХНОЛОГИЯ РАЗРАБОТКИ ОДНОСТРАНИЧНОГО ВЕБ-ПРИЛОЖЕНИЯ НА ПЛАТФОРМЕ ANGULAR 8",
        "year": "2020",
        "journalName": "Молодой исследователь Дона",
        "author": [
            "Сулыз А. В.",
            "Панфилов А. Н."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Сулыз А. В., Панфилов А. Н.\nПриводится пример разработки одностраничного веб-приложения на платформе Angular 8. Рассмотрены различные аспекты в разработке одностраничных веб-приложений, а также преимущества и недостатки их применения. Описаны наиболее популярные JavaScript фреймворки для создания одностраничных веб-приложений. Разработана диаграмма развертывания приложения, разработанного по архитектуре REST с применением фреймворка Spring и СУБД PostgreSQL. На основании проведенной работы сделаны выводы о целесообразности применения рассматриваемой технологии.\n",
        "keywords": [
            "ВЕБ-ПРОГРАММИРОВАНИЕ",
            "UML",
            "ДИАГРАММА РАЗВЕРТЫВАНИЯ",
            "WEB DEVELOPMENT",
            "DEPLOYMENT DIAGRAM"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-veb-kvest-v-podgotovke-aspirantov-k-prepodavatelskoy-deyatelnosti",
        "name": "ТЕХНОЛОГИЯ ВЕБ-КВЕСТ В ПОДГОТОВКЕ АСПИРАНТОВ К ПРЕПОДАВАТЕЛЬСКОЙ ДЕЯТЕЛЬНОСТИ",
        "year": "2020",
        "journalName": "Электронный научно-методический журнал Омского ГАУ",
        "author": [
            "Кузнецова О.З."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Кузнецова О.З.\nВ статье раскрывается дидактический потенциал технологии веб-квеста в подготовке аспирантов к педагогической деятельности. Анализируются подходы к пониманию данной категории. Представлено авторское определение понятия. Выделены особенности технологии, отличающие ее от других. Представлен алгоритм работы по освоению данной технологии.\n",
        "keywords": [
            "ФГОС ВО",
            "ВЕБ-КВЕСТ",
            "КОМПЕТЕНЦИИ",
            "УНИВЕРСАЛЬНЫЕ КОМПЕТЕНЦИИ",
            "ПОДГОТОВКА КАДРОВ ВЫСШЕЙ КВАЛИФИКАЦИИ",
            "АСПИРАНТЫ",
            "РЕЗУЛЬТАТЫ ОБУЧЕНИЯ",
            "FEDERAL STATE STANDARD OF HIGHER EDUCATION",
            "WEB QUEST",
            "COMPETENCIES",
            "UNIVERSAL COMPETENCIES",
            "GRADUATE STUDENTS",
            "RESULTS OF TRAINING"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razvitie-kompetentnosti-studentov-pri-obuchenii-matematike-s-ispolzovaniem-veb-tehnologiy",
        "name": "Развитие компетентности студентов при обучении математике с использованием веб-технологий",
        "year": "2008",
        "journalName": "Вестник Костромского государственного университета",
        "author": [
            "Воронцова Ольга Романовна",
            "Секованов Валерий Сергеевич",
            "Катержина С.Ф."
        ],
        "description": "",
        "keywords": []
    },
    {
        "link": "https://cyberleninka.ru//article/n/programmnoe-obespechenie-na-osnove-veb-tehnologiy-dlya-geonavigatsii-neftegazovyh-skvazhin",
        "name": "ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ НА ОСНОВЕ ВЕБ-ТЕХНОЛОГИЙ ДЛЯ ГЕОНАВИГАЦИИ НЕФТЕГАЗОВЫХ СКВАЖИН",
        "year": "2019",
        "journalName": "Вестник Новосибирского государственного университета. Серия: Информационные технологии",
        "author": [
            "Даниловский Кирилл Николаевич",
            "Дудаев Александр Русланович",
            "Глинских Вячеслав Николаевич",
            "Никитенко Марина Николаевна",
            "Москаев Илья Алексеевич"
        ],
        "description": "\nАннотация научной статьи по энергетике и рациональному природопользованию, автор научной работы — Даниловский Кирилл Николаевич, Дудаев Александр Русланович, Глинских Вячеслав Николаевич, Никитенко Марина Николаевна, Москаев Илья Алексеевич\nДля эффективного освоения залежей углеводородов чрезвычайно важной становится высокая точность проводки горизонтальных скважин в целевых пластах-коллекторах. В процессе бурения геонавигация скважины со сложной траекторией выполняется по геофизическим данным в реальном масштабе времени. Представленная работа посвящена разработке нового программного обеспечения для геонавигации нефтегазовых скважин с горизонтальным завершением. Для решения задач геонавигации используются алгоритмы, основанные на методах корреляции каротажных данных и численной инверсии измерений электромагнитного каротажа. Разработанное новое программное приложение основано на веб-технологиях и имеет клиент-серверную архитектуру. Для оптимизации времени выполнения ресурсоемких расчетов используются высокопроизводительные облачные вычисления.\n",
        "keywords": [
            "ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "ГЕОНАВИГАЦИЯ",
            "КАРОТАЖ В ПРОЦЕССЕ БУРЕНИЯ",
            "ГОРИЗОНТАЛЬНАЯ СКВАЖИНА",
            "ЧИСЛЕННАЯ ИНВЕРСИЯ",
            "ВЫСОКОПРОИЗВОДИТЕЛЬНЫЕ ВЫЧИСЛЕНИЯ",
            "КЛИЕНТ-СЕРВЕРНАЯ АРХИТЕКТУРА",
            "ОБЛАЧНЫЕ ВЫЧИСЛЕНИЯ",
            "SOFTWARE",
            "WEB-TECHNOLOGIES",
            "GEOSTEERING",
            "LOGGING WHILE DRILLING",
            "HORIZONTAL WELL",
            "NUMERICAL INVERSION",
            "HIGH-PERFORMANCE COMPUTATIONS",
            "CLIENT-SERVER ARCHITECTURE",
            "CLOUD COMPUTATIONS"
        ],
        "branch": "Энергетика и рациональное природопользование"
    },
    {
        "link": "https://cyberleninka.ru//article/n/programmnaya-podsistema-monitoringa-polzovatelskoy-aktivnosti-veb-orientirovannoy-geoinformatsionnoy-sistemy",
        "name": "Программная подсистема мониторинга пользовательской активности веб-ориентированной геоинформационной системы",
        "year": "2012",
        "journalName": "Доклады Томского государственного университета систем управления и радиоэлектроники",
        "author": [
            "Милихин Михаил Михайлович"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Милихин Михаил Михайлович\nРассмотрены основные проблемы проектирования архитектуры web-ориентированных геоинформационных систем (ГИС) с точки зрения организации аудита пользовательской активности в системе. На основании проделанной работы автором предложено архитектурное решение для программной реализации подсистемы мониторинга пользовательской активности с учетом расширяемой модульной структуры ГИС и вопросов оптимизации быстродействия системы на основе единого веб-обработчика запросов.\n",
        "keywords": [
            "ВЕБ-ТЕХНОЛОГИИ",
            "ГЕОИНФОРМАЦИОННАЯ СИСТЕМА",
            "ИНФОРМАЦИОННАЯ БЕЗОПАСНОСТЬ",
            "INFORMATION SECURITY",
            "GEOGRAPHIC INFORMATION SYSTEMS",
            "WEB-TECHNOLOGIES"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-web-tehnologiy-v-obrazovatelnyh-informatsionnyh-sistemah",
        "name": "ПРИМЕНЕНИЕ WEB ТЕХНОЛОГИЙ В ОБРАЗОВАТЕЛЬНЫХ ИНФОРМАЦИОННЫХ СИСТЕМАХ",
        "year": "2020",
        "journalName": "StudNet",
        "author": [
            "Якунина Ирина Владимировна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Якунина Ирина Владимировна\nСовременный мир настолько изменчив в настоящее время. Раскрываются новые возможности средств массовой коммуникации. В статье рассматривается роль современных информационных технологий в организации учебного процесса образовательных организаций. Рассматривается комплекс проблем, связанных с использованием Web технологий в образовательном пространстве. Определены требования к образовательному Web-ресурсу.\n",
        "keywords": [
            "веб‐технологии",
            "образование",
            "Moodle",
            "образовательная среда.",
            "web technology",
            "education",
            "moodle",
            "educational environment"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/voprosy-integratsii-informatsionno-kommunikatsionnyh-tehnologiy-v-praktiko-orientirovannoe-obuchenie-cherez-veb-tehnologii",
        "name": "Вопросы интеграции информационно-коммуникационных технологий в практико-ориентированное обучение через веб-технологии дистанционного образования (на примере веб-платформы обучения предпринимательству в ННГУ iGeneration)",
        "year": "2016",
        "journalName": "International scientific review",
        "author": [
            "Вылегжанина Надежда Владимировна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Вылегжанина Надежда Владимировна\nВ статье анализируются новые технические средства и новые технологии обучения, их интеграция на примере веб-платформы обучения предпринимательству в ННГУ iGeneration.\n",
        "keywords": [
            "ОБРАЗОВАТЕЛЬНЫЕ ТРЕНДЫ",
            "EDUCATIONAL TRENDS",
            "ОБРАЗОВАТЕЛЬНЫЕ ПЛАТФОРМЫ",
            "EDUCATIONAL PLATFORM",
            "ДИСТАНЦИОННОЕ ОБУЧЕНИЕ",
            "DISTANCE LEARNING"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/issledovanie-ustoychivosti-anonimnoy-seti-na-osnove-tehnologiy-veb-proksi",
        "name": "Исследование устойчивости анонимной сети на основе технологий веб-прокси",
        "year": "2016",
        "journalName": "Вопросы кибербезопасности",
        "author": [
            "Маркин Дмитрий Олегович",
            "Архипов Павел Андреевич",
            "Галкин Алексей Сергеевич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Маркин Дмитрий Олегович, Архипов Павел Андреевич, Галкин Алексей Сергеевич\nВ статье рассмотрена концепция построения системы анонимного доступа к удаленным ресурсам на базе веб-технологий с использованием языков программирования PHP/Perl. Проведен анализ типов прокси-серверов, на основе которых осуществляется построение анонимных сетей. Обосновано применение технологии веб-прокси-серверов для решения задачи построение анонимной сети. Выделены достоинства и недостатки данной технологии. Описаны принципы использования технологии терминальных программ и активных данных применительно к веб-прокси-серверам. Предложен перечень технических задач, которые могут быть решены при реализации технологии терминальных программ и активных данных на основе веб-прокси-серверов. Представлена структура прототипа анонимной сети на базе веб-прокси-серверов, на основе которой проведена серия экспериментов по исследованию устойчивости. Проведен анализ устойчивости программно-аппаратного обеспечения при нагрузочном тестировании с использованием веб-прокси-серверов. Описание и результаты экспериментов приведены в работе. Представлены выводы о перспективах применения технологии вебпрокси для реализации системы анонимного доступа. Показано, что анонимные сети на базе веб-прокси серверов являются уязвимыми к повышенной нагрузке, связанной с ограниченными вычислительными возможностями аппаратной платформы, однако в то же время, являются потенциальными источниками такой нагрузки в отношении сторонних ресурсов.\n",
        "keywords": [
            "АНОНИМНАЯ СЕТЬ",
            "ВЕБ-ПРОКСИ",
            "САМОМАРШРУТИЗАЦИЯ",
            "АКТИВНЫЕ ДАННЫЕ",
            "ТЕРМИНАЛЬНЫЕ ПРОГРАММЫ",
            "ЛУКОВАЯ МАРШРУТИЗАЦИЯ",
            "ЧЕСНОЧНАЯ МАРШРУТИЗАЦИЯ",
            "ANONYMOUS NETWORK",
            "ANONYMOUS ACCESS",
            "WEB-PROXY",
            "PROXY-SERVER"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/vnedrenie-innovatsiy-v-tehnologicheskie-protsessy-nauchnoy-biblioteki-v-usloviyah-razvivayuscheysya-veb-sredy",
        "name": "Внедрение инноваций в технологические процессы научной библиотеки в условиях развивающейся веб-среды",
        "year": "2012",
        "journalName": "Библиосфера",
        "author": [
            "Редькина Наталья Степановна",
            "Драцкая Марина Евгеньевна"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Редькина Наталья Степановна, Драцкая Марина Евгеньевна\nРассматриваются вопросы совершенствования основных технологических процессов научной библиотеки с помощью современных средств и сервисов Интернета.\n",
        "keywords": [
            "БИБЛИОТЕЧНАЯ ТЕХНОЛОГИЯ",
            "ИНТЕРНЕТ",
            "ВЕБ-СЕРВИСЫ",
            "LIBRARY TECHNOLOGY",
            "INTERNET",
            "WEB SERVICES"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/novatsionnye-podhody-v-distantsionnom-obrazovanii",
        "name": "Новационные подходы в дистанционном образовании",
        "year": "2012",
        "journalName": "Бизнес Информ",
        "author": [
            "Колдовский Николай Васильевич"
        ],
        "description": "\nАннотация научной статьи по экономике и бизнесу, автор научной работы — Колдовский Николай Васильевич\nВ статье рассмотрены современные информационные технологии, которые могут быть использованы при внедрении дистанционной формы электронного образования, также предложены направления интеграции данных решений в единый образовательный комплекс.\n",
        "keywords": [
            "ЕЛЕКТРОННА ОСВіТА",
            "іНФОРМАЦіЙНі ТЕХНОЛОГії",
            "ДИСТАНЦіЙНЕ НАВЧАННЯ",
            "ВЕБ-ТЕХНОЛОГії",
            "ЭЛЕКТРОННОЕ ОБРАЗОВАНИЕ",
            "ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ",
            "ДИСТАНЦИОННОЕ ОБУЧЕНИЕ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "E-EDUCATION",
            "INFORMATION TECHNOLOGY",
            "DISTANCE LEARNING",
            "WEB-BASED TECHNOLOGIES"
        ],
        "branch": "Экономика и бизнес"
    },
    {
        "link": "https://cyberleninka.ru//article/n/using-web-technologies-in-effective-teaching-of-mathematics-at-universities",
        "name": "USING WEB TECHNOLOGIES IN EFFECTIVE TEACHING OF MATHEMATICS AT UNIVERSITIES",
        "year": "2021",
        "journalName": "Бюллетень науки и практики",
        "author": [
            "Yakubova Umida",
            "Parpieva Nodira",
            "Mirhojaeva Najibakhon"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Yakubova Umida, Parpieva Nodira, Mirhojaeva Najibakhon\nThe article describes the role of web technologies in effective teaching of mathematics at universities. The advantages of the use of WebQuests are defined. This study aims to examine the effect of WebQuests used in instruction on students’ academic achievements and the student and teacher opinions on WebQuests.\n",
        "keywords": [
            "ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ",
            "УЧЕБНЫЙ ПРОЦЕСС",
            "ВЕБ-ТЕХНОЛОГИИ",
            "ВЕБ-КВЕСТ",
            "INFORMATION TECHNOLOGY",
            "LEARNING PROCESS",
            "WEB TECHNOLOGIES",
            "WEB-QUEST"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-orientirovannaya-sistema-podgotovki-tsifrovoy-modeli-reliefa-mestnosti",
        "name": "Веб-ориентированная система подготовки цифровой модели рельефа местности",
        "year": "2014",
        "journalName": "Математическая физика и компьютерное моделирование",
        "author": [
            "Елисеева Мария Владимировна",
            "Писарев Андрей Владимирович"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Елисеева Мария Владимировна, Писарев Андрей Владимирович\nПостроена концептуальная модель программного комплекса, позволяющая строить трехмерную поверхность исследуемой территории для последующего проведения компьютерных экспериментов. В основе цифрового рельефа местности лежат различные данные дистанционного зондирования Земли.\n",
        "keywords": [
            "ГЕОИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ",
            "ДИСТАНЦИОННОЕ ЗОНДИРОВАНИЕ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "ЦИФРОВАЯ МОДЕЛЬ РЕЛЬЕФА",
            "SRTM",
            "GEOINFORMATION TECHNOLOGIES",
            "REMOTE SENSING",
            "WEB-TECHNOLOGIES",
            "DIGITAL TERRIAN MODEL"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/didakticheskiy-potentsial-tehnologii-veb-kvest-v-formirovanii-inoyazychnoy-kommunikativnoy-kompetentsii-studentov-neyazykovyh",
        "name": "Дидактический потенциал технологии веб-квест в формировании иноязычной коммуникативной компетенции студентов неязыковых факультетов туристского профиля",
        "year": "2013",
        "journalName": "Язык и культура",
        "author": [
            "Шульгина Елена Модестовна",
            "Бовтенко Марина Анатольевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Шульгина Елена Модестовна, Бовтенко Марина Анатольевна\nРассматривается вопрос формирования иноязычной коммуникативной компетенции студентов неязыкового вуза с помощью технологии веб-квест. Освещены актуальность проблемы и пригодность применения данной технологии для формирования умений студентов коллективно решать профессионально значимые задачи с использованием иностранного языка.\n",
        "keywords": [
            "ИНОЯЗЫЧНАЯ КОММУНИКАТИВНАЯ КОМПЕТЕНЦИЯ",
            "ТЕХНОЛОГИЯ ВЕБ-КВЕСТ",
            "ДИДАКТИЧЕСКИЙ ПОТЕНЦИАЛ",
            "АПРОБИРОВАНИЕ ТЕХНОЛОГИИ ВЕБ-КВЕСТ",
            "FOREIGN-LANGUAGE COMMUNICATIVE COMPETENCE",
            "WEBQUEST TECHNIQUE",
            "DIDACTIC POTENTIAL",
            "WEBQUEST TECHNIQUE TESTING"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/avtomatizirovannyy-analiz-nevozmuschennogo-geomagnitnogo-polya-na-osnove-tehnologii-kartograficheskih-veb-servisov",
        "name": "Автоматизированный анализ невозмущенного геомагнитного поля на основе технологии картографических веб-сервисов",
        "year": "2013",
        "journalName": "Вестник Уфимского государственного авиационного технического университета",
        "author": [
            "Воробьев А. В.",
            "Шакирова Г. Р."
        ],
        "description": "\nАннотация научной статьи по электротехнике, электронной технике, информационным технологиям, автор научной работы — Воробьев А. В., Шакирова Г. Р.\nПредлагается способ определения и регистрации параметров невозмущенного геомагнитного поля в условиях минимума аппаратно-вычислительных средств и систем, а также ограниченных информационных и энергоресурсов. Описывается методика применения указанного способа для оперативного и достоверного вычисления основного ряда параметров геомагнитного диполя в автоматическом режиме. Рассматривается реализация предложенной математической и методической базы на веб-платформе с помощью языка программирования JavaScript.\n",
        "keywords": [
            "ГЕОМАГНИТНОЕ ПОЛЕ",
            "ГЕОМАГНИТНЫЙ ДИПОЛЬ",
            "ГЕОМАГНИТОСФЕРА",
            "ВЕБ-ТЕХНОЛОГИИ",
            "GEOMAGNETIC FIELD",
            "GEOMAGNETIC DIPOLE",
            "GEOMAGNETIC SPHERE",
            "WEB TECHNOLOGIES"
        ],
        "branch": "Электротехника, электронная техника, информационные технологии"
    },
    {
        "link": "https://cyberleninka.ru//article/n/aktualnye-problemy-sovremennoy-veb-tipografiki-vzglyad-v-buduschee",
        "name": "Актуальные проблемы современной веб-типографики: взгляд в будущее",
        "year": "2010",
        "journalName": "Вестник Московского университета. Серия 10. Журналистика",
        "author": [
            "Беляев А.А."
        ],
        "description": "\nАннотация научной статьи по СМИ (медиа) и массовым коммуникациям, автор научной работы — Беляев А.А.\nСтатья посвящена актуальным проблемам типографики в веб-дизайне. Автор подробно останавливается на использовании шрифтов во Всемирной сети Интернет, способах их внедрения в веб-страницу. Рассматривается роль веб-стандартов в реализации типографических правил оформления текста. Делается вывод о значении технологий в веб-типографике и том пути, который ей еще предстоит пройти.\n",
        "keywords": [
            "ТИПОГРАФИКА",
            "ВЕБ-ДИЗАЙН",
            "WEB DESIGN",
            "ШРИФТ",
            "FONT",
            "ВЕБ-СТАНДАРТЫ",
            "WEB STANDARDS",
            "ВЕБ-ТЕХНОЛОГИИ",
            "CSS",
            "TYPOGRAPHICS",
            "WEB TECHNOLOGY"
        ],
        "branch": "СМИ (медиа) и массовые коммуникации"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razrabotka-bezopasnoy-zdoroviesberegayuschey-lingvoinformatsionnoy-sredy-podgotovki-buduschego-uchitelya-v-vide-veb-portala-na-osnove",
        "name": "Разработка безопасной здоровьесберегающей лингвоинформационной среды подготовки будущего учителя в виде веб-портала на основе технологий веб 2. 0-3. 0",
        "year": "2013",
        "journalName": "Вестник Пермского государственного гуманитарно-педагогического университета. Серия № 1. Психологические и педагогические науки",
        "author": [
            "Крузе Борис Александрович"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Крузе Борис Александрович\nСтатья посвящена результатам исследования, проведённого в рамках проекта 046-М Программы стратегического развития ПГГПУ. Исходным пунктом теоретических рассуждений явился анализ здоровьесберегающих образовательных технологий, в результате которого и была построена лингвоинформационная платформа в логике требований компетентностного подхода к высшему профессиональному образованию.\n",
        "keywords": [
            "HEALTH-PROTECTIVE TECHNOLOGIES",
            "LINGUAINFORMATIONAL TECHNOLOGIES",
            "WEB-PLATFORM",
            "LINGUAINFORMATIONAL ENVIRONMENT"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/o-veberizatsii-gosudarstvennogo-upravleniya",
        "name": "О веберизации государственного управления",
        "year": "2012",
        "journalName": "Вестник Московского университета. Серия 21. Управление (государство и общество)",
        "author": [
            "Ганчеренок Игорь Иванович"
        ],
        "description": "\nАннотация научной статьи по экономике и бизнесу, автор научной работы — Ганчеренок Игорь Иванович\nВ статье позиционируется диалектическое представление о развитии государственного управления как синергетическом процессе. Определены вариативные и инвариантные составляющие, коррелированные с традиционным и инновационным в государственном управлении, гармонизирующие устойчивое развитие современного национального государства и общества.\n",
        "keywords": [
            "ГОСУДАРСТВЕННОЕ УПРАВЛЕНИЕ",
            "ВЕБЕР",
            "ВЕБ-ТЕХНОЛОГИИ",
            "ДИАЛЕКТИКА",
            "СИНЕРГЕТИКА",
            "PUBLIC ADMINISTRATION",
            "WEBER",
            "WEB-TECHNOLOGY",
            "DIALECTICS",
            "SYNERGETICS"
        ],
        "branch": "Экономика и бизнес"
    },
    {
        "link": "https://cyberleninka.ru//article/n/kombinirovannyy-metod-vizualizatsii-kartograficheskih-dannyh-veb-orientirovannoy-geoinformatsionnoy-sistemy",
        "name": "Комбинированный метод визуализации картографических данных веб-ориентированной геоинформационной системы",
        "year": "2015",
        "journalName": "Доклады Томского государственного университета систем управления и радиоэлектроники",
        "author": [
            "Милихин Михайил Михайлович",
            "Гриценко Юрий Борисович",
            "Рычагов Михаил Михайлович"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Милихин Михайил Михайлович, Гриценко Юрий Борисович, Рычагов Михаил Михайлович\nРассмотрены методы визуализации геоданных, использующиеся при разработке веб-ориентированных геоинформационных систем. Разработан комбинированный метод визуализации картографических данных, применение которого позволит построить новую архитектуру веб-ориентированной ГИС, обладающей возможностями десктопных ГИС.\n",
        "keywords": [
            "ВЕБ-ТЕХНОЛОГИИ",
            "ГЕОИНФОРМАЦИОННАЯ СИСТЕМА",
            "МЕТОДЫ ВИЗУАЛИЗАЦИИ ДАННЫХ",
            "SPATIAL DATA VISUALIZATION",
            "GEOGRAPHIC INFORMATION SYSTEMS",
            "WEB-TECHNOLOGIES"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/arhitektura-raspredelennyh-servis-orientirovannyh-sistem-avtomatizirovannogo-proektirovaniya",
        "name": "Архитектура распределенных сервис-ориентированных систем автоматизированного проектирования",
        "year": "2014",
        "journalName": "Известия Южного федерального университета. Технические науки",
        "author": [
            "Гридин Владимир Николаевич",
            "Дмитревич Геннадий Даниилович",
            "Анисимов Денис Андреевич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Гридин Владимир Николаевич, Дмитревич Геннадий Даниилович, Анисимов Денис Андреевич\nАктуальной проблемой в области информационных технологий является децентрализация архитектуры САПР путем перехода к распределенным системам проектирования, построенным на основе Интернет-технологий, реализующих задачи коммуникации и информационного обмена между приложениями. Такие независимо управляемые приложения являются автономными и могут взаимодействовать друг с другом в процессе выполнения общей задачи. Протоколы Интернет-технологий представляют надежную базу для связывания подсистем и не требуют согласованного использования ресурсов, находящихся в разных узлах сети, что существенно упрощает процесс построения и эксплуатации распределенной САПР. Основным требованием для возможности реализации такой распределенной системы является согласованность интерфейсов, посредством которых связаны отдельные подсистемы. При выполнении этого требования отдельные компоненты распределенной САПР могут создаваться различными разработчиками и поддерживаться на различных сайтах, откуда они будут поставляться (возможно, на коммерческой основе) потребителям. Самым эффективным методом объединения подсистем в распределенное приложение следует считать организацию удаленного вызова процедур на базе сервис-ориентированной архитектуры с использованием веб-сервисов.\n",
        "keywords": [
            "СИСТЕМЫ АВТОМАТИЗИРОВАННОГО ПРОЕКТИРОВАНИЯ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "СЕРВИС-ОРИЕНТИ-РОВАННАЯ АРХИТЕКТУРА",
            "РАСПРЕДЕЛЕННЫЕ СИСТЕМЫ",
            "ВЕБ-СЕРВИСЫ",
            "COMPUTER-AIDED DESIGN",
            "WEB TECHNOLOGY",
            "SER-BISMUTH-ORIENTED ARCHITECTURE",
            "DISTRIBUTED SYSTEMS",
            "WEB SERVICES"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/sozdanie-sistemy-razgranicheniya-dostupa-i-izolyatsii-smezhnyh-dochernih-protsessov-http-servera-apache-s-modulem-preventivnoy-zaschity",
        "name": "Создание системы разграничения доступа и изоляции смежных дочерних процессов http сервера Apache с модулем превентивной защиты",
        "year": "2008",
        "journalName": "Известия Южного федерального университета. Технические науки",
        "author": [
            "Бондарев А.А.",
            "Чернышов А.К."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Бондарев А. А., Чернышов А. К.\nВ статье рассматриваются основные этапы создания системы разграничения доступа и изоляции смежных дочерних процессов HTTP сервера Apache. Анализируются различные подходы к организации информационной и пользовательской модели веб-сервера. Вырабатывается общая концепция безопасности вебсервера. Приводятся основные этапы технической реализации с учетом специфики рассматриваемой платформы.\n",
        "keywords": [
            "ОРГАНИЗАЦИЯ ЗАЩИТЫ ВЕБ-СЕРВЕРА",
            "БЕЗОПАСНОСТЬ ВЕБ-СЕРВЕРА",
            "ПОЛЬЗОВАТЕЛЬСКАЯ МОДЕЛЬ",
            "ТЕХНОЛОГИЯ ЗАЩИТЫ ВЕБ-СЕРВЕРА",
            "THE ORGANISATION OF PROTECTION OF A WEB SERVER",
            "SAFETY OF A WEB SERVER",
            "THE USER MODEL",
            "TECHNOLOGY OF PROTECTION OF A WEB SERVER"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/podderzhka-brauzerami-tehnologiy-html5-i-css3",
        "name": "Поддержка браузерами технологий HTML5 и CSS3",
        "year": "2014",
        "journalName": "Вестник российских университетов. Математика",
        "author": [
            "Новожилов Андрей Вячеславович",
            "Акулов Геннадий Сергеевич"
        ],
        "description": "\nАннотация научной статьи по прочим социальным наукам, автор научной работы — Новожилов Андрей Вячеславович, Акулов Геннадий Сергеевич\nИсследованы вопросы перехода на новые технологии веб-программирования HTML5 и CSS3, которые упрощают процесс создания интерактивных веб-сайтов за счет внедрения новых элементов и атрибутов. Проведено исследование уровня поддержки браузерами указанных технологий, выявлено, что не все браузеры на данный момент в полной мере поддерживают HTML5 и CSS3. Рассмотрены такие браузеры, как Google Chrome, Opera, Safari, Firefox, Internet Explorer.\n",
        "keywords": [
            "СТАНДАРТЫ",
            "ТЕХНОЛОГИИ ВЕБ-ПРОГРАММИРОВАНИЯ",
            "HTML5",
            "CSS3",
            "STANDARDS",
            "TECHNOLOGY",
            "WEB-PROGRAMMING"
        ],
        "branch": "Прочие социальные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-tehnologiy-veb-2-0-dlya-podgotovki-kadrov-v-finansovo-nalogovoy-sfere",
        "name": "Применение технологий Веб 2. 0 для подготовки кадров в финансово-налоговой сфере",
        "year": "2016",
        "journalName": "Управленец",
        "author": [
            "Евстигнеев Евгений Николаевич",
            "Викторова Наталья Геннадьевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Евстигнеев Евгений Николаевич, Викторова Наталья Геннадьевна\nВозможности Интернета второго поколения в области образования громадны, однако недостаточно осмыслены, а современные технологии часто используются в учебном процессе самопроизвольно по усмотрению педагога. Необходим комплексный подход к реализации огромного потенциала Глобальной сети, но в первую очередь к пониманию сущности и формам проявления феномена Веб 2.0. Для решения проблемы предложена модель, с помощью которой проведен структурный этимологический анализ искомого термина, даны авторские определения. Применительно к вопросам подготовки кадров для финансово-налоговой сферы определены задачи и пути их решения. Кратко рассмотрены технологические, социальные и дидактические характеристики Веб 2.0. Описаны основные социальные сервисы. Охарактеризованы специализированные ресурсы общего назначения, онлайн-бухгалтерии, профессиональные электронные сервисы. Представлены современные системы онлайн-обучения, известные массовые открытые онлайн-курсы. Показаны перспективы и возможности их применения, приведены конкретные примеры, имеющие место в образовательной практике. Сформулированы выводы и предложения по преодолению отставания и достижению мировых стандартов в вопросах технологий обучения, подготовки и переподготовки креативных кадров для финансово-налоговой сферы.\n",
        "keywords": [
            "КАДРЫ ФИНАНСОВО-НАЛОГОВАЯ ДЕЯТЕЛЬНОСТЬ",
            "СЛОЖНАЯ СИСТЕМА",
            "КОНЦЕПЦИЯ ВЕБ 2.0",
            "МАССОВЫЕ ОТКРЫТЫЕ ОНЛАЙН-КУРСЫ",
            "ВЕБ-СЕРВИС",
            "ПЕРСОНАЛЬНАЯ ОБРАЗОВАТЕЛЬНАЯ СФЕРА",
            "HUMAN RESOURCES",
            "FINANCE AND TAX ACTIVITY",
            "COMPLEX SYSTEM",
            "WEB 2.0 CONCEPT",
            "MASSIVE OPEN ONLINE COURSES",
            "WEB SERVICE",
            "PERSONAL EDUCATIONAL SPHERE"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-gns-i-veb-tehnologiy-dlya-sozdaniya-integrirovannyh-informatsionno-analiticheskih-sistem",
        "name": "Применение ГНС- и веб-технологий для создания интегрированных информационно-аналитических систем",
        "year": "2007",
        "journalName": "Вычислительные технологии",
        "author": [
            "Бычков И. В.",
            "Гаченко А. С.",
            "Попова А. К.",
            "Ружников Г. М.",
            "Фереферов Е. С.",
            "… еще 1"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Бычков И. В., Гаченко А. С., Попова А. К., Ружников Г. М., Фереферов Е. С.\nThis article describes an effective principle for storage of stationary data. This technique allows reducing the random access memory usage and minimizing the time required for data uploading. Using the proposed approach, a vector SMD format and an expansion module of IIS Web-server (for Internet/Intranet electronic cards publication in SMD format) are developed and implemented. A brief description of the data analysis systems developed by ISDCT SB RAS within interdisciplinary research programs is also presented.\n",
        "keywords": []
    },
    {
        "link": "https://cyberleninka.ru//article/n/oblachnaya-veb-tehnologiya-provedeniya-konkursnyh-protsedur-otsenki-kachestva-obrazovatelnyh-resursov",
        "name": "Облачная веб-технология проведения конкурсных процедур оценки качества образовательных ресурсов",
        "year": "2019",
        "journalName": "Вестник Российского университета дружбы народов. Серия: Информатизация образования",
        "author": [
            "Киргизова Елена Викторовна",
            "Нарчуганов Кирилл Николаевич",
            "Пак Николай Инсебович",
            "Хегай Людмила Борисовна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Киргизова Елена Викторовна, Нарчуганов Кирилл Николаевич, Пак Николай Инсебович, Хегай Людмила Борисовна\nПроблема и цель. В статье изложены описание, модель и результат разработки прикладного программного обеспечения, доступного в сети Интернет, для автоматизации организации конкурсных процедур. Актуальность создания автоматизированных систем оценивания качества образовательных ресурсов обусловлена необходимостью обеспечения доступности и эффективности проведения оценочных и конкурсных процедур в учебных заведениях. Методология. Исследование направлено на проектирование и разработку облачного портала-конструктора, позволяющего автоматизировать проводимые конкурсные мероприятия в образовательных учреждениях. В отличие от существующих подобных разработок, созданная система представляет прикладное программное обеспечение для организации и проведения конкурсных мероприятий в образовательных учреждениях. Результаты. Работа имеет практическую ценность для учебных заведений всех уровней и отдельных сообществ, нуждающихся в автоматизированных системах конкурсного оценивания образовательных ресурсов. Заключение. Впервые предлагается проективная облачная среда автоматизации оценки качества образовательных ресурсов, имеющих объектный вид (цифровой образовательный ресурс, деятельность учителя, информационная система, информационная среда, урок и пр.), для которых возможно построение критериальной модели качества.\n",
        "keywords": [
            "АВТОМАТИЗАЦИЯ КОНКУРСНЫХ ПРОЦЕДУР",
            "ПОРТАЛ-КОНСТРУКТОР ДЛЯ ПРОВЕДЕНИЯ КОНКУРСА",
            "КРИТЕРИИ ОЦЕНКИ ОБРАЗОВАТЕЛЬНОГО РЕСУРСА",
            "ОЦЕНКА КАЧЕСТВА ОБРАЗОВАТЕЛЬНОГО РЕСУРСА",
            "AUTOMATION OF CONTEST PROCEDURES",
            "PORTAL-DESIGNER FOR THE CONTEST ORGANIZATION",
            "EDUCATIONAL RESOURCE ESTIMATION CRITERIA",
            "ESTIMATION OF THE QUALITY OF EDUCATIONAL RESOURCE"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/primenenie-gis-i-veb-tehnologiy-dlya-sozdaniya-integrirovannyh-informatsionno-analiticheskih-sistem",
        "name": "Применение ГИС и веб-технологий для создания интегрированных информационно-аналитических систем",
        "year": "2014",
        "journalName": "Вестник Бурятского государственного университета. Математика, информатика",
        "author": [
            "Гаченко Андрей Сергеевич",
            "Маджара Тарас Игоревич",
            "Ружников Геннадий Михайлович",
            "Хмельнов Алексей Евгеньевич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Гаченко Андрей Сергеевич, Маджара Тарас Игоревич, Ружников Геннадий Михайлович, Хмельнов Алексей Евгеньевич\nСтатья посвящена актуальным проблемам разработки региональной информационно-аналитической системы.\n",
        "keywords": [
            "ИНФРАСТРУКТУРА ПРОСТРАНСТВЕННЫХ ДАННЫХ",
            "БАЗОВЫЕ ПРОСТРАНСТВЕННЫЕ ДАННЫЕ",
            "КАТАЛОГИ МЕТАДАННЫХ",
            "РЕЕСТРЫ",
            "ОРГАНЫ ГОСУДАРСТВЕННОЙ ВЛАСТИ",
            "КАРТОГРАФИЧЕСКИЕ ДАННЫЕ",
            "INFRASTRUCTURE OF SPATIAL DATA",
            "BASIC SPATIAL DATA",
            "CATALOGS OF METADATA",
            "REGISTERS",
            "PUBLIC AUTHORITIES",
            "CARTOGRAPHICAL DATA"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ontologicheskoe-opisanie-multimediynyh-resursov-v-kontekste-tehnologiy-semanticheskogo-veb",
        "name": "Онтологическое описание мультимедийных ресурсов в контексте технологий семантического веб",
        "year": "2011",
        "journalName": "Вестник Саратовского государственного технического университета",
        "author": [
            "Сытник А.А.",
            "Вагарина Н.С.",
            "Мельникова Н.И."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Сытник А. А., Вагарина Н. С., Мельникова Н. И.\nРассматриваются формальные представления некоторых существующих подходов к описанию моделей метаданных мультимедиа информации в контексте технологий семантического Веб. Рассмотрены примеры мультимедийных онтологий всех трех уровней верхнего уровня (upper), средней зоны (core) и онтологии предметных областей (domain ontology)\n",
        "keywords": [
            "ФОРМАТЫ МУЛЬТИМЕДИА",
            "МУЛЬТИМЕДИЙНЫЕ ОНТОЛОГИИ",
            "ПРЕДМЕТНЫЕ ОНТОЛОГИИ",
            "СЕМАНТИЧЕСКОЕ ОПИСАНИЕ МУЛЬТИМЕДИА",
            "MULTIMEDIA FORMATS",
            "MULTIMEDIA ONTOLOGY",
            "DOMAIN ONTOLOGIES",
            "SEMANTIC DESCRIPTION OF MULTIMEDIA"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razrabotka-servernoy-chasti-veb-prilozheniy-s-ispolzovaniem-sovremennyh-tehnologiy",
        "name": "Разработка серверной части веб-приложений с использованием современных технологий",
        "year": "2018",
        "journalName": "Вестник науки и образования",
        "author": [
            "Долженко Андрей Николаевич"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Долженко Андрей Николаевич\nСтатья посвящена применению на практике современных технологий разработки серверной части клиент-серверных веб-приложений. Переход бизнеса сферы услуг из офф-лайн области взаимодействия с клиентами в он-лайн распространённая тенденция, особенно, если к моменту перехода услуги уже предоставлялись различными цифровыми методами. Дан обзор предметной области, изложенный в разрезе технологий, которые принято использовать при разработке клиент-серверных web-решений. Затем приводится краткая постановка задачи и описание проекта.\n",
        "keywords": [
            "WEB-ПОРТАЛ",
            "ОНЛАЙН И ОФЛАЙН ФОРМАТ",
            "ONLINE AND OFFLINE FORMAT",
            "ИНТЕРНЕТ-ПОРТАЛ",
            "ПРИЛОЖЕНИЕ",
            "APPLICATION",
            "МОДЕЛИ",
            "MODELS",
            "WEB-PORTAL",
            "INTERNET-PORTAL"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-kvest-kak-effektivnaya-tehnologiya-professionalizatsii-buduschih-zhurnalistov",
        "name": "Веб-квест как эффективная технология профессионализации будущих журналистов",
        "year": "2019",
        "journalName": "Человек. Культура. Образование",
        "author": [
            "Иванищева О.Н."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Иванищева О.Н.\nВ статье рассматривается спефицика использования веб-квест технологий в журналистском образовании. Отмечается, что веб-квест, активно применяемый в филологическом образовании, в частности при изучении иностранных языков и русского языка как иностранного, в методическом плане не отличается от веб-квеста, применяемого в журналистском образовании, но методологически является иным способом активизации способностей студентов и имеет своей целью развитие прежде всего их критического мышления. Указывается, что использование веб-квеста в журналистском образовании не столько и не сколько создает учебную среду, сколько развивает принцип партисипации. Рассмотрен вариант использования веб-квест технологии в изучении дисциплины «Современные зарубежные СМИ» в теме «Регулирование деятельности современных зарубежных СМИ».\n",
        "keywords": [
            "ВЕБ-КВЕСТ ТЕХНОЛОГИИ",
            "ЖУРНАЛИСТСКОЕ ОБРАЗОВАНИЕ",
            "ГОСУДАРСТВЕННЫЙ СТАНДАРТ",
            "WEB QUEST TECHNOLOGY",
            "JOURNALISM EDUCATION",
            "STATE STANDARD"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-kvest-tehnologii-v-organizatsii-samostoyatelnoy-raboty-studentov",
        "name": "Использование веб-квест-технологии в организации самостоятельной работы студентов",
        "year": "2016",
        "journalName": "Сибирский педагогический журнал",
        "author": [
            "Хлупина Надежда Олеговна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Хлупина Надежда Олеговна\nВ статье поднимаются проблемы использования информационных и коммуникационных технологий в образовательном процессе. Автор акцентирует внимание на необходимости овладения ИКТ-компетентностями, обозначенными в Профессиональном стандарте педагога. В соответствии с национальными задачами нашего государства проводится анализ преимуществ и недостатков организации самостоятельной работы студентов с использованием дистанционной образовательной технологии веб-квеста. Использование веб-квест-технологии позволяет изменить отношение студентов к самостоятельной работе, совершенствовать общие компетенции (осуществлять поиск, анализ и оценку информации, работа в команде), успешно выполнять соответствующие виды профессиональной деятельности, овладевая профессиональными компетенциями.\n",
        "keywords": [
            "ВЕБ-КВЕСТ",
            "САМОСТОЯТЕЛЬНАЯ РАБОТА СТУДЕНТОВ",
            "WEB QUEST",
            "STUDENTS' INDEPENDENT WORK"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/professionalnaya-podgotovka-veb-dizaynerov-s-ispolzovaniem-distantsionnyh-obrazovatelnyh-tehnologiy",
        "name": "Профессиональная подготовка веб-дизайнеров с использованием дистанционных образовательных технологий",
        "year": "2011",
        "journalName": "Знание. Понимание. Умение",
        "author": [
            "Шишлина Наталья Васильевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Шишлина Наталья Васильевна\nВ статье предлагается технология формирования профессиональной компетентности веб-дизайнера, которая может быть использована для разработки дистанционных курсов в системе дополнительного профессионального образования.\n",
        "keywords": [
            "ДОПОЛНИТЕЛЬНОЕ ПРОФЕССИОНАЛЬНОЕ ОБРАЗОВАНИЕ",
            "ДИСТАНЦИОННЫЕ ОБРАЗОВАТЕЛЬНЫЕ ТЕХНОЛОГИИ",
            "ВЕБ-ДИЗАЙН",
            "ADDITIONAL VOCATIONAL TRAINING",
            "DISTANCE EDUCATION TECHNOLOGIES",
            "WEB DESIGN"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-kvest-kak-novaya-obrazovatelnaya-tehnologiya-v-vysshey-shkole",
        "name": "Веб-квест как новая образовательная технология в высшей школе",
        "year": "2012",
        "journalName": "Общество. Коммуникация. Образование",
        "author": [
            "Шестакова Антонина Юрьевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Шестакова Антонина Юрьевна\nВ статье рассматриваются современные образовательные (педагогические) технологии. Автор приводит характеристику различных видов и форм интерактивных занятий и информационно-коммуникационных технологий. Рассмотрены особенности веб-квеста, положительные и отрицательные качества данной технологии, а также структура и этапы разработки веб-квеста.\n",
        "keywords": [
            "ОБРАЗОВАТЕЛЬНЫЕ ТЕХНОЛОГИИ",
            "ВЕБ-КВЕСТ",
            "ЭЛЕКТРОННЫЕ РЕСУРСЫ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/metodologiya-obucheniya-v-ramkah-kognitivnogo-podhoda-s-ispolzovaniem-veb-2-tehnologiy",
        "name": "Методология обучения в рамках когнитивного подхода с использованием Веб-2 технологий",
        "year": "2016",
        "journalName": "Педагогическое образование в России",
        "author": [
            "Блинова Татьяна Леонидовна",
            "Подчиненов Игорь Евгеньевич"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Блинова Татьяна Леонидовна, Подчиненов Игорь Евгеньевич\nВ работе ставится вопрос о недостатках традиционной методологии обучения и обсуждается идея создания новой методологии на основе системно-когнитивного подхода и информационно-коммуникационных технологий. Процесс обучения рассматривается как функционирование сложной слабоформализуемой многокомпонентной системы, в которую входят студенты, преподаватели, а также различные интернет-ресурсы. Рассмотрены различные стороны портрета обучаемого и предложена сетевая модель субъекта обучения. Отмечены два методических подхода: конструктивизм и коннективизм (или коннекционизм), которые как раз ориентированы на сетевую обучающую среду. Для организации изучения той или иной дисциплины в сетевой идеологии предложено воспользоваться Веб 2.0 технологией, с помощью которой достаточно легко спроектировать обучающую систему. В заключение утверждается, что в настоящее время имеются все теоретические предпосылки и необходимые технические возможности организовать учебный процесс на совершенно другом методологическом уровне и реализовать его в соответствии с парадигмой Болонского процесса, то есть сделать нацеленным на личностно-ориентированное обучение. Однако чтобы преподаватели могли овладеть новой методологией обучения, им потребуется широкое ознакомление с сетевыми информационными технологиями, то есть серьезная профессиональная переподготовка.\n",
        "keywords": [
            "МЕТОДОЛОГИЯ ОБУЧЕНИЯ",
            "СИСТЕМА",
            "КОГНИТИВИЗМ",
            "СЕТЕВЫЕ ТЕХНОЛОГИИ",
            "КОННЕКТИВИЗМ",
            "МОДЕЛЬ СУБЪЕКТА ОБУЧЕНИЯ",
            "ТЕХНОЛОГИЯ ВЕБ-20",
            "METHODOLOGY",
            "SYSTEM",
            "COGNITIVISM",
            "NETWORK TECHNOLOGY",
            "CONNECTIVISM",
            "THE MODEL OF SUBJECT OF TRAINING",
            "THE TECHNOLOGY OF WEB 2 0"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-kvest-kak-innovatsionnaya-tehnologiya-v-sisteme-realizatsii-fgos",
        "name": "Веб-квест - как инновационная технология в системе реализации ФГОС",
        "year": "2016",
        "journalName": "Наука и перспективы",
        "author": [
            "Щербина А.Н."
        ],
        "description": "",
        "keywords": [
            "ВЕБ-КВЕСТ",
            "ИННОВАЦИОННЫЕ ОБРАЗОВАТЕЛЬНЫЕ ТЕХНОЛОГИИ",
            "САМОСТОЯТЕЛЬНАЯ РАБОТА УЧАЩИХСЯ",
            "ПОИСК ИНФОРМАЦИИ",
            "ЦИФРОВОЙ ОБРАЗОВАТЕЛЬНЫЙ РЕСУРС.",
            "WEB-QUEST",
            "INNOVATIVE EDUCATIONAL TECHNOLOGIES",
            "INDEPENDENT WORK OF STUDENTS",
            "INFORMATION SEARCH",
            "DIGITAL EDUCATIONAL RESOURCE."
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ob-effektivnom-ispolzovanii-sovremennyh-tehnologiy-sozdaniya-interaktivnyh-veb-dokumentov-1",
        "name": "Об эффективном использовании современных технологий создания интерактивных веб-документов",
        "year": "2017",
        "journalName": "Интерактивная наука",
        "author": [
            "Одинокая Мария Александровна"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Одинокая Мария Александровна\nв статье анализируются вопросы, связанные с технологиями использования интерактивных веб-документов, таких как canvas, CSS, SVG, WebGL, WebSocket. Рассмотрены их возможности и области применения для создания различных видов интерактивных веб-документов.\n",
        "keywords": [
            "WEBGL",
            "ГРАФИКА",
            "ИНТЕРАКТИВНОСТЬ",
            "WEB-ПРИЛОЖЕНИЕ",
            "РАЗРАБОТКА",
            "DEVELOPMENT",
            "INTERACTIVITY",
            "HTML5",
            "GRAPHICS",
            "ВЕБ-ДОКУМЕНТ",
            "SVG",
            "CANVAS",
            "CSS",
            "WEB-APPLICATION",
            "WEB-DOCUMENT"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/motivatsiya-poznavatelnoy-deyatelnosti-studentov-posredstvom-tehnologii-veb-kvest",
        "name": "Мотивация познавательной деятельности студентов посредством технологии веб-квест",
        "year": "2016",
        "journalName": "Вестник Тамбовского университета. Серия: Гуманитарные науки",
        "author": [
            "Шульгина Елена Модестовна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Шульгина Елена Модестовна\nРассмотрены проблемы повышения эффективности иноязычного образования в высшей профессиональной школе. Согласно государственным образовательным стандартам нового поколения, основной целью обучения иностранному языку в высшей профессиональной школе является подготовка специалиста, обладающего таким уровнем иноязычной коммуникативной компетенции, который позволит эффективно решать профессиональные задачи в соответствующей области деятельности. Используя ряд педагогических инноваций, основанных на методологии проблемного и личностно-ориентированного методов, технология веб-квест является одним из наиболее эффективных педагогических средств при развитии иноязычной коммуникативной компетенции обучающихся. Ее дидактический потенциал способствует развитию у студентов критического мышления и интеллектуального развития, стимулирует их активность, самостоятельность и вовлечение в аутентичный контекст профессиональной деятельности. Как известно, мотивация познавательной деятельности студентов является одним из педагогических условий при формировании иноязычной коммуникативной компетенции. Предпринята попытка проанализировать, насколько высока эффективность учебных интернет-ресурсов, в частности, технологии веб-квест, в ее формировании и развитии. Структура веб-квеста предполагает как индивидуальную работу, так и командную, при которой интерактивная форма обучения наиболее соответствуют личностно-ориентированному подходу. В этой связи технология веб-квест способствует развитию мотивации к обучению, которая заключается не только в заинтересованности студентов в поиске нужной им информации, но и в их готовности самостоятельно выполнить поставленную задачу. Следовательно, студенты развивают тем самым свои способности к самостоятельной деятельности, что способствует преобразованию полученной информации в более обдуманное понимание. Таким образом, интеграция технологии веб-квест в учебный процесс решает одну из ключевых задач современного образования увеличение объема внеаудиторной самостоятельной работы студентов, за счет которой процесс метапознания формирует процесс саморегуляции личности, в связи с чем самостоятельная работа обретает характер управляемости со стороны самого обучаемого. Ее эффективность в учебном процессе обусловливается организационно-педагогическим сопровождением, направленным на максимальную реализацию задач, поставленных преподавателем на каждом из этапов веб-квеста.\n",
        "keywords": [
            "МОТИВАЦИЯ ПОЗНАВАТЕЛЬНОЙ ДЕЯТЕЛЬНОСТИ",
            "ТЕХНОЛОГИЯ ВЕБ-КВЕСТ",
            "ПРЕДМЕТНОЕ СОДЕРЖАНИЕ",
            "ПЕДАГОГИЧЕСКИЕ УСЛОВИЯ",
            "COGNITIVE ACTIVITY MOTIVATION",
            "WEB-QUEST TECHNOLOGY",
            "SUBJECT-MATTER",
            "PEDAGOGICAL CONDITIONS"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/analiz-novyh-vozmozhnostey-tehnologii-html5-po-sozdaniyu-veb-prilozheniy",
        "name": "Анализ новых возможностей технологии html5 по созданию веб-приложений",
        "year": "2014",
        "journalName": "Фундаментальные и прикладные исследования: проблемы и результаты",
        "author": [
            "Свентицкий П.И."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Свентицкий П.И.\nВ статье проводится анализ основных возможностей технологии HTML5 по созданию веб-приложений.\n",
        "keywords": [
            "HTML5",
            "ВЕБ-ПРИЛОЖЕНИЕ",
            "ТЕХНОЛОГИЯ",
            "САЙТ",
            "РАЗРАБОТКА"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ob-effektivnom-ispolzovanii-sovremennyh-tehnologiy-sozdaniya-interaktivnyh-veb-dokumentov",
        "name": "Об эффективном использовании современных технологий создания интерактивных веб-документов",
        "year": "2014",
        "journalName": "ScienceRise",
        "author": [
            "Егорова И.Н.",
            "Трофименко А.С."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Егорова И. Н., Трофименко А. С.\nСтатья посвящена исследованию наиболее востребованных современных технологий разработки вебдокументов, таких как: API Canvas, WebGL, SVG и CSS3. Рассмотрены достоинства и недостатки каждой из технологий в визуальном представлении информации: анимации, интерфейсах, 2D и 3D графике. Проведен анализ областей их применения, разработаны рекомендации по наиболее эффективному их использованию для разработки интерактивных WEB-документов\n",
        "keywords": [
            "ЕБ-ДОКУМЕНТ",
            "ИНТЕРНЕТ",
            "ИНТЕРАКТИВНОСТЬ",
            "РАЗРАБОТКА",
            "СПЕЦИФИКАЦИЯ",
            "ВЕКТОРНАЯ ГРАФИКА",
            "HTML5",
            "SVG",
            "WEBGL",
            "WEB-DOCUMENT",
            "INTERNET",
            "INTERACTIVITY",
            "DEVELOPMENT",
            "SPECIFICATION",
            "VECTOR GRAPHICS"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/model-effektivnosti-tehnologii-e-marketinga-na-primere-veb-studii-it-sfera",
        "name": "МОДЕЛЬ ЭФФЕКТИВНОСТИ ТЕХНОЛОГИИ Е-МАРКЕТИНГА НА ПРИМЕРЕ ВЕБ-СТУДИИ \"ИТ-СФЕРА\"",
        "year": "2019",
        "journalName": "Вестник Академии знаний",
        "author": [
            "Назаров А.Д."
        ],
        "description": "\nАннотация научной статьи по экономике и бизнесу, автор научной работы — Назаров А.Д.\nВ период трансформации цифровой экономики неотъемлемой частью любых коммерческих услуг становится не только наличие веб-сайта, но и эффективное его оптимизация и продвижение с помощью инструментов веб-аналитики и интернет-маркетинга. Сейчас, когда информационный поиск вышел на новый уровень и большинство веб-сайтов выглядит современными, необходимо постоянно обновлять веб-сайт и поддерживать актуальной информацию, а также делать сайт удобным и полезным. Однако, возникает вопрос, каким образом можно оценить «удобность» и «полезность» веб-сайта коммерческой компании. Для этого в статье предложена разработка весовой математической модели оценки веб-сайтов, позволяющая оценить удобство использования и полноту информации того или иного сайта, а также предложить рекомендации по его совершенствованию на основе полученных данных.\n",
        "keywords": [
            "Е-МАРКЕТИНГ",
            "ЭЛЕКТРОННЫЙ МАРКЕТИНГ",
            "ИНТЕРНЕТ-МАРКЕТИНГ",
            "ОЦЕНКА ЭФФЕКТИВНОСТИ ВЕБ-САЙТОВ",
            "МОДЕЛЬ ОЦЕНКИ ВЕБ-САЙТОВ",
            "E-MARKETING",
            "INTERNET MARKETING",
            "EVALUATION OF THE EFFECTIVENESS OF WEBSITES",
            "MODEL FOR ASSESSING WEBSITES"
        ],
        "branch": "Экономика и бизнес"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-veb-kvest-tehnologii-v-podgotovke-buduschego-uchitelya-matematiki",
        "name": "Использование веб-квест технологии в подготовке будущего учителя математики",
        "year": "2014",
        "journalName": "Обучение и воспитание: методики и практика",
        "author": [
            "Владыкина И.В."
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Владыкина И.В.\nВ статье рассказывается об использовании веб-квест технологии как одной из форм исследовательской деятельности при обучении будущих учителей математики.\n",
        "keywords": [
            "ИНФОРМАТИЗАЦИЯ ОБРАЗОВАНИЯ",
            "ВЕБ-КВЕСТ ТЕХНОЛОГИЯ",
            "ОБУЧЕНИЕ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/razrabotka-klientskoy-chasti-veb-prilozheniya-s-ispolzovaniem-tehnologiy-spa",
        "name": "РАЗРАБОТКА КЛИЕНТСКОЙ ЧАСТИ ВЕБ-ПРИЛОЖЕНИЯ С ИСПОЛЬЗОВАНИЕМ ТЕХНОЛОГИЙ SPA",
        "year": "2020",
        "journalName": "StudNet",
        "author": [
            "Газизуллин Нафис Инсафович",
            "Плещинская Ирина Евгеньевна"
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Газизуллин Нафис Инсафович, Плещинская Ирина Евгеньевна\nСтатья посвящена разработке клиентской части веб-приложения с помощью технологии SPA (Single Page Application). Приведена краткая информация о двух крупнейших компаниях, Google и Facebook, предоставляющих технологии в области SPA. Рассмотрены программные продукты данных компаний, перечислены основные преимущества и недостатки указанных программных продуктов. Проведено сравнение программных сред React и Angular. Интернет-технологии развиваются стремительно, и сегодня невозможно представить ни одну компанию без своего веб-сайта. Многие частные лица, оказывающих те или иные услуги, тоже имеют свои сайты. Главное требование к веб-сайту – он должен работать быстро, качественно, надежно и иметь понятный интерфейс.\n",
        "keywords": [
            "SPA",
            "JavaScript",
            "React",
            "Angular JS.",
            "SPA",
            "JavaScript",
            "React",
            "Angular JS."
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/veb-prilozhenie-dlya-turistov-s-polzovatelskim-kontentom-tehnologii-razrabotki",
        "name": "ВЕБ-ПРИЛОЖЕНИЕ ДЛЯ ТУРИСТОВ С ПОЛЬЗОВАТЕЛЬСКИМ КОНТЕНТОМ: ТЕХНОЛОГИИ РАЗРАБОТКИ",
        "year": "2019",
        "journalName": "Наука и перспективы",
        "author": [
            "Васева Е.С.",
            "Шутько А.В."
        ],
        "description": "\nАннотация научной статьи по компьютерным и информационным наукам, автор научной работы — Васева Е.С., Шутько А.В.\nВ статье рассматриваются технологии разработки веб-приложения для туристов, с помощью которого можно делиться отзывами о посещенных местах, находить себе единомышленников и выбирать туристические маршруты по критериям. Веб-приложение было создано на основе web-интерфейса с использованием языка программирования php и свободной реляционной системы управления базами данных MySQL. Приводится структура базы данных, показаны основные листинги форм веб-интерфейса и обрабатывающие данные скрипты.\n",
        "keywords": [
            "ВЕБ-ПРИЛОЖЕНИЕ С ПОЛЬЗОВАТЕЛЬСКИМ КОНТЕНТОМ",
            "БАЗА ДАННЫХ",
            "ВЕБ-ИНТЕРФЕЙС",
            "ЛИСТИНГ",
            "WEB APPLICATION WITH USER CONTENT",
            "DATABASE",
            "WEB INTERFACE",
            "LISTING"
        ],
        "branch": "Компьютерные и информационные науки"
    },
    {
        "link": "https://cyberleninka.ru//article/n/preimuschestva-ispolzovaniya-tehnologii-veb-kvest-na-uroke-inostrannogo-yazyka",
        "name": "ПРЕИМУЩЕСТВА ИСПОЛЬЗОВАНИЯ ТЕХНОЛОГИИ ВЕБ-КВЕСТ НА УРОКЕ ИНОСТРАННОГО ЯЗЫКА",
        "year": "2019",
        "journalName": "Проблемы романо-германской филологии, педагогики и методики преподавания иностранных языков",
        "author": [
            "Павлюкевич Любовь Владиславовна",
            "Батыкова Анна Сергеевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Павлюкевич Любовь Владиславовна, Батыкова Анна Сергеевна\nВ статье рассмотрена актуальность использования ИКТ в обучении иностранным языкам в условиях модернизации системы образования, в частности технология Веб-квест как вид проектной деятельности. Приводится краткая история данной технологии, раскрыта ее сущность и проанализированы преимущества ее использования на уроке иностранного языка, среди которых высокая мотивационная обеспеченность, использование ИКТ, развитие самостоятельности учащихся и др.\n",
        "keywords": [
            "ВЕБ-КВЕСТ",
            "МОТИВАЦИЯ",
            "ГРУППОВАЯ РАБОТА",
            "ИНТЕРНЕТ",
            "ИКТ",
            "ПРИНЦИПЫ ОБУЧЕНИЯ",
            "WEB-QUEST",
            "MOTIVATION",
            "GROUP WORK",
            "INTERNET",
            "ICT",
            "LEARNING PRINCIPLES"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/prodvinutoe-keshirovanie-i-optimizatsiya-veb-prilozheniy-s-pomoschyu-tehnologii-swr",
        "name": "ПРОДВИНУТОЕ КЕШИРОВАНИЕ И ОПТИМИЗАЦИЯ ВЕБ-ПРИЛОЖЕНИЙ С ПОМОЩЬЮ ТЕХНОЛОГИИ SWR",
        "year": "2021",
        "journalName": "Sciences of Europe",
        "author": [
            "Князев И.В."
        ],
        "description": "\nАннотация научной статьи по технике и технологии, автор научной работы — Князев И.В.\nВ данной статье анализируются продвинутые методики для кеширования запросов данных и оптимизации веб-приложений, а также практические примеры для веб-приложений, написанных на таких технологиях как React.JS и Next.JS.\n",
        "keywords": [
            "swr",
            "javascript",
            "reactjs",
            "nextjs.",
            "swr",
            "javascript",
            "reactjs",
            "nextjs."
        ],
        "branch": "Техника и технологии"
    },
    {
        "link": "https://cyberleninka.ru//article/n/tehnologiya-veb-kvesta-v-obuchenii-inostrannym-yazykam-sovremennyy-etap",
        "name": "ТЕХНОЛОГИЯ ВЕБ-КВЕСТА В ОБУЧЕНИИ ИНОСТРАННЫМ ЯЗЫКАМ: СОВРЕМЕННЫЙ ЭТАП",
        "year": "2020",
        "journalName": "Проблемы современного педагогического образования",
        "author": [
            "Агеенко Наталья Владимировна",
            "Старцева Наталья Валерьевна"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Агеенко Наталья Владимировна, Старцева Наталья Валерьевна\nВ статье актуализируется необходимость внедрения инновационных образовательных технологий для повышения эффективности учебного процесса. Отмечается, что использование инновационных компьютерных технологий является не только средством получения знаний, но и средством формирования профессиональных компетенций на современном этапе. Выделен ряд современных методик обучения иностранному языку и подробно описаны задачи веб-технологического квеста. Авторы приходят к выводу о целесообразности использования веб-квестов как одной из разновидностей инновационных технологий в образовательном процессе, эффективность которых подтверждается растущей познавательной активностью студентов, возможностью индивидуализации учебного процесса, повышением уровня социализации будущих специалистов, а также уровня профессиональной компетентности. Компьютерные технологии отвечают современным вызовам в образовании.\n",
        "keywords": [
            "INNOVATIVE EDUCATIONAL TECHNOLOGY",
            "EFFICIENCY",
            "DEVELOPMENT OF PROFESSIONAL COMPETENCIES",
            "WEB QUEST TECHNOLOGY",
            "SOCIALIZATION",
            "COGNITIVE ACTIVITY",
            "ИННОВАЦИОННАЯ ОБРАЗОВАТЕЛЬНАЯ ТЕХНОЛОГИЯ",
            "ЭФФЕКТИВНОСТЬ",
            "РАЗВИТИЕ ПРОФЕССИОНАЛЬНЫХ КОМПЕТЕНЦИЙ",
            "ТЕХНОЛОГИЯ ВЕБ-КВЕСТОВ",
            "СОЦИАЛИЗАЦИЯ",
            "ПОЗНАВАТЕЛЬНАЯ АКТИВНОСТЬ"
        ],
        "branch": "Науки об образовании"
    },
    {
        "link": "https://cyberleninka.ru//article/n/ispolzovanie-sovremennyh-informatsionnyh-tehnologiy-v-sisteme-nepreryvnogo-obrazovaniya",
        "name": "Использование современных информационных технологий в системе непрерывного образования",
        "year": "2012",
        "journalName": "Вестник Российского университета дружбы народов. Серия: Информатизация образования",
        "author": [
            "Ниматулаев Магомедхан Магомедович",
            "Магомедов Рамазан Магомедович"
        ],
        "description": "\nАннотация научной статьи по наукам об образовании, автор научной работы — Ниматулаев Магомедхан Магомедович, Магомедов Рамазан Магомедович\nВ статье раскрываются проблемы формирования системы непрерывного образования и повышения квалификации для эффективной реализации профессиональной деятельности педагога в условиях использования современных информационных технологий. Рассматриваются возможность и необходимость использования информационно-коммуникационных технологий, веб-технологий для интенсификации и придания дополнительной динамики образовательному процессу. В связи с этим определяются новые формы и методы организации учебной деятельности для развития и совершенствования этой деятельности.\n",
        "keywords": [
            "НЕПРЕРЫВНОЕ ОБРАЗОВАНИЕ",
            "ПОВЫШЕНИЕ КВАЛИФИКАЦИИ",
            "ИНФОРМАЦИОННО-КОММУНИКАЦИОННЫЕ ТЕХНОЛОГИИ",
            "ИНТЕРНЕТ",
            "ВЕБ-ТЕХНОЛОГИИ",
            "CONTINUING EDUCATION",
            "TRAINING",
            "INFORMATION AND COMMUNICATION TECHNOLOGY",
            "INTERNET",
            "WEB-TECHNOLOGY"
        ],
        "branch": "Науки об образовании"
    }
]